{
    "CHEM1100": {
        "course_code": "CHEM1100",
        "course_name": "Chemistry 1",
        "semesters": 3,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "This course provides the foundation in concepts underpinning inorganic, physical and organic\nchemistry necessary for advancement to the higher levels of study in chemistry and engineering courses. Core topics include: atomic structure, bonding and hybridisation, molecular shape, an introduction to organic chemistry, states of matter and intermolecular forces, chemical equilibrium, aqueous solution equilibria, thermodynamics, and redox chemistry. This course is a prerequisite to CHEM1200 Chemistry 2 for all students in the following programs: BSc, B Biomedical Science, B Biotechnology, B Engineering and B Occupational Health & Safety Science.",
        "prerequisites": "Senior Chemistry or CHEM1090",
        "incompatible": "CHEM1020, CHEM1010, CHEM1021, CHEM1022",
        "restricted": "",
        "major_part": null
    },
    "CHEM1200": {
        "course_code": "CHEM1200",
        "course_name": "Chemistry 2",
        "semesters": 7,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "This course builds on concepts that have been introduced in CHEM1100 (Chemistry 1) thereby developing the knowledge and understanding across inorganic, physical and organic chemistry necessary for advancement to the higher levels of study in chemistry, biochemistry and engineering courses. Core topics include: reaction profiles and kinetics, structure, reactivity and mechanisms, organic functional group chemistry, structural determination, acid and base chemistry and transition metal chemistry. This course is recommended for all students in the following programs: BSc, B Biomedical Science, B Biotechnology, B Engineering and B Occupational Health and Safety Science.",
        "prerequisites": "CHEM1100",
        "incompatible": "CHEM1221, CHEM1222, CHEM1010, CHEM1020, CHEM1021, CHEM1022",
        "restricted": "Summer Semester Quota of 175.",
        "major_part": null
    },
    "CHEM2050": {
        "course_code": "CHEM2050",
        "course_name": "Intermediate Chemistry 1",
        "semesters": 1,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "This course contains theory for both inorganic, organic chemistry as well as chemical kinetics that a student will need to advance to third level chemistry. Topics covered will include: Synthesis & mechanism in organic chemistry; Transition Metal Chemistry; Bonding and Molecular Orbital Theory; Chemical Kinetics; Molecular Modelling; Stereochemistry; Strategies for complex syntheses.",
        "prerequisites": "(CHEM1100 or CHEM1020) + (CHEM1200, CHEM1030 or CHEM1010)",
        "incompatible": "CHEM2041 or CHEM2001",
        "restricted": "",
        "major_part": null
    },
    "CHEM2054": {
        "course_code": "CHEM2054",
        "course_name": "Experimental Chemistry",
        "semesters": 1,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "This course will consist of practical laboratory training, addressing the market place need for industry-ready chemists with relevant practical and communication skills. A laboratory intensive experience will include attendant exposure to quantitative & qualitative analytical skills & other core laboratory competencies. In lectorials, students will learn the theory underlying various laboratory techniques, including spectroscopy, separation science and electrochemistry, before applying these in the laboratory. Emphasis will be placed on the requirements of good scientific communication in terms of keeping a lab notebook and writing of laboratory reports. Students will be introduced to the ethical principles underlying the responsible practice of Chemistry.",
        "prerequisites": "CHEM1100 and CHEM1200",
        "incompatible": "",
        "restricted": "",
        "major_part": null
    },
    "CHEM2060": {
        "course_code": "CHEM2060",
        "course_name": "Intermediate Chemistry 2",
        "semesters": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "In 2018, if you are unsure if you should be taking this course, please seek academic advising.\n\nThis course contains theory for inorganic main group chemistry, organic chemistry as well as thermodynamics and interfacial science that a student will need to advance to third level chemistry.",
        "prerequisites": "CHEM1100 and CHEM1200",
        "incompatible": "",
        "restricted": "",
        "major_part": null
    },
    "CHEM3016": {
        "course_code": "CHEM3016",
        "course_name": "Advanced Experimental Chemistry",
        "semesters": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "This course will consist of practical training, going some way towards addressing the market place need for industry-ready chemists with relevant practical skills. A laboratory intensive experience with the attendant exposure to quantitative & qualitative analytical skills as well as other core laboratory competencies will be taught. A lecture component may be included in order to enhance and develop many of the instrumental techniques employed in the laboratory.",
        "prerequisites": "CHEM2054",
        "incompatible": "",
        "restricted": "",
        "major_part": null
    },
    "CHEM3001": {
        "course_code": "CHEM3001",
        "course_name": "Advanced Organic Chemistry",
        "semesters": 1,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "Molecular conformations, effective sizes of groups. Types of organic transformations & their mechanisms: stereochemical outcomes, structural effects on reactivity, role of intermediates. Analytical approaches to organic synthesis: reagents, methodologies, specificities & stereochemistry, illustrated by synthesis of natural & non-natural compounds. Functional group & whole molecule retrosynthesis.",
        "prerequisites": "CHEM2050 or CHEM2901 or CHEM2054",
        "incompatible": "",
        "restricted": "",
        "major_part": null
    },
    "CHEM3010": {
        "course_code": "CHEM3010",
        "course_name": "Advanced Inorganic Chemistry",
        "semesters": 1,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "This course is for those specifically interested in inorganic chemistry and the physical methods that underpin its application to bio-inorganic and materials science. It is founded on the fundamental electronic properties which distinguish the d- and f-block elements from all others in the periodic table; their electronic structure, electron transfer and magnetic properties.",
        "prerequisites": "CHEM2050 or CHEM2901",
        "incompatible": "CHEM3002 or BIOL3005",
        "restricted": "",
        "major_part": null
    },
    "CHEM3011": {
        "course_code": "CHEM3011",
        "course_name": "Advanced Physical Chemistry",
        "semesters": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "This course is an introduction to concepts, theories & methods in modern physical chemistry & elements of computational molecular science. It will include molecular quantum mechanics, electronic structure, molecular dynamics, biomolecular & materials simulations, spectroscopy & statistical thermodynamics.",
        "prerequisites": "CHEM2056 or CHEM2002 or CHEM2902 or (PHYS2020 + PHYS2041)",
        "incompatible": "CHEM3003",
        "restricted": "",
        "major_part": null
    },
    "CHEM3004": {
        "course_code": "CHEM3004",
        "course_name": "Determination of Molecular Structure",
        "semesters": 1,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "The determination of molecular structure underpins all aspects of synthetic chemistry. There are many techniques available to determine the precise structure (connectivity, conformation, stereochemistry, chirality) of a molecule. X-ray crystallography is the most direct technique for molecular structure determination. Crystallography will be presented in this course in a series of lectures and problem based learning sessions. As a complement to the lecture material all students will undertake a computer based exercise as part of their assessment where they solve and refine a real crystal structure. Nuclear Magnetic Resonance (NMR) and mass spectrometry are used routinely in the characterisation of new and existing compounds. Simple 1-D and more sophisticated 2-D NMR experiments can lead to information that, if interpreted correctly, enable the assignment of connectivity and stereochemistry. The NMR section of this course will be presented as a series of lectures and problem solving sessions. An assignment using several spectroscopic techniques to assign the structure of an unknown compound will be part of the overall assessment of this section of the course. This course provides students with requisite skills and knowledge to characterise new or existing chemical compounds in a research or quality control/analytical laboratory setting.",
        "prerequisites": "CHEM2050 or CHEM2901",
        "incompatible": "",
        "restricted": "",
        "major_part": null
    },
    "CHEM3008": {
        "course_code": "CHEM3008",
        "course_name": "Medicinal & Biological Chemistry",
        "semesters": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "Medicinal chemistry is a multidisciplinary science involving molecular design, chemical synthesis and bioassays followed by modifying compound properties for pharmaceutical applications. Medicinal chemistry thus combines organic chemistry with biochemistry, physical chemistry, microbiology, pharmacology, structural biology, computer modelling and molecular biology.",
        "prerequisites": "CHEM2050 or CHEM2901 or CHEM2052",
        "incompatible": "",
        "restricted": "",
        "major_part": null
    },
    "CHEM3013": {
        "course_code": "CHEM3013",
        "course_name": "Nanoscience: Self-assembly",
        "semesters": 1,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "Introduction to advanced materials & nanotechnology. The focus is on colloids & self assembled systems and covers both inorganic and organic materials. Assembly, state-of-art characterisation, chemistry, properties & novel applications. This course explores the forces that control 2D and 3D nanomaterials.",
        "prerequisites": "(CHEM2002 or CHEM2902) or CHEM2056",
        "incompatible": "CHEM3007",
        "restricted": "",
        "major_part": null
    },
    "CHEM3014": {
        "course_code": "CHEM3014",
        "course_name": "Nanoscience: Synthesis",
        "semesters": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "units": "2",
        "duration": "One Semester",
        "description": "Introduction to the synthesis of nanostructures and their use in nanotechnology. Fundamentals of synthetic methods, structure-property relationships and application in computing, drug and vaccine delivery, plastic optoelectronics, diagnostics, nanoreactors, and nanorobots. This course would aid anyone as a practitioner in the field of nanomaterials.",
        "prerequisites": "",
        "incompatible": "CHEM3007",
        "restricted": "",
        "major_part": null
    }
}