{
    "AGRC1125D": {
        "course_name": "Agricultural Mechanisation 1",
        "course_code": "AGRC1125D",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Gatton Vocational Ed Centre",
        "school": "Gatton Vocational Ed Centre",
        "description": "",
        "semesters": 1,
        "prerequisites": "Only available to students enrolled in the Academic Program in Agricultural Technologies."
    },
    "INFS7410": {
        "course_name": "Information Retrieval and Web Search",
        "course_code": "INFS7410",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "The course studies the theory, design, and implementation of Information Retrieval (IR) techniques in text-based information systems. The theoretical component of the course focuses on IR methods for the processing, indexing, querying, organisation, and classification of textual documents, including hypertext documents available on the world-wide-web. A variety of current research topics are also covered, including social media, recommendation systems, and ranking. The practical component of the course addresses the design and implementation of high-capacity text retrieval and filtering systems such as web search engines.",
        "semesters": 2,
        "prerequisites": "INFS2200 or INFS7903"
    },
    "CHIN3010": {
        "course_name": "Spoken Chinese IIB",
        "course_code": "CHIN3010",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Further facets of spoken Chinese with immediate practical application.\nThis course may be cancelled if there are fewer than 20 enrolments.",
        "semesters": 2,
        "prerequisites": "CHIN2110"
    },
    "ENVM7528": {
        "course_name": "Industrial Ecology & Life Cycle Thinking",
        "course_code": "ENVM7528",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "",
        "description": "The production and consumption of goods and services is central to many of the sustainability related problems currently faced by human society. This course introduces students to the theories and applications of industrial ecology and environmental life cycle assessment (LCA) in natural sciences, engineering, business economic and government policy decision situations. Students will do problem sets, learn how to use LCA software models & tools, review cases and conduct an LCA project such as environmental life cycle assessment of industrial products and systems (e.g. food systems, mining and minerals, renewable energy technologies).",
        "semesters": 0,
        "prerequisites": ""
    },
    "LTCS3002": {
        "course_name": "Translating & Interpreting Studies",
        "course_code": "LTCS3002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Introduction to non-language specific techniques of translating and interpreting as well as theoretical and ethical issues of professional practices.",
        "semesters": 2,
        "prerequisites": "At least 8 units of any foreign language subject (or equivalent) or permission from Course Coordinator"
    },
    "NUMW2101": {
        "course_name": "Mental Health",
        "course_code": "NUMW2101",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course addresses one of the National Health Priority areas and is designed to introduce students to knowledge, skills and attitudes related to mental health, mental illness across the lifespan and integrating physical and psychosocial care from a nursing/midwifery perspective. Using an evidence-based approach, the course will focus on developing an understanding of common mental health issues, mental health assessment, intervention and relapse prevention, models of care and legal and ethical issues. Students will consolidate learning with regard to positive images about mental health recovery and the application of interpersonal skills in preparation for clinical placement in a mental health setting. The specific needs of Aboriginal and Torres Strait Islander people, people from culturally and linguistically diverse backgrounds, LGBTI (lesbian, gay, bisexual, transgender and intersex) populations and mothers and families during the perinatal period will be considered in the course.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ENGG7280": {
        "course_name": "Engineering Project 8A",
        "course_code": "ENGG7280",
        "duration": "One Semester",
        "units": 8,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Mech & Mine Engineering School",
        "description": "Please Note: this course has been replaced by ENGG7290 as of Semester 1, 2018.\nProject or thesis on a topic relevant to the School's research profile & the student's field of engineering study. Students commencing a year long project in sem 1 enrol in ENGG7281 for sem 1 and sem 2; students commencing a year long project in sem 2 enrol in ENGG7282 for sem 2 & the following sem 1; students completing the course in a single semester enrol in ENGG7280. \nStudents enrolling in a placement through ENGG7280 are able to negotiate placement dates with their host institution between the following dates - Sem1: 15 Jan to 30 June; Sem2: 1 July to 15 December.\n",
        "semesters": 0,
        "prerequisites": "Permission of Head of School"
    },
    "LAWS7917": {
        "course_name": "Pacific Comparative Law",
        "course_code": "LAWS7917",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "The course compares the legal systems of Pacific countries. It examines customary law and its relationship with introduced law against a background of legal pluralism and cultural relativism, and considers solutions and directions for the future.",
        "semesters": 1,
        "prerequisites": ""
    },
    "TIMS7326": {
        "course_name": "Management of Intellectual Property",
        "course_code": "TIMS7326",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course will give students extensive knowledge of procedures involved in protecting, presenting and managing their Intellectual Property in the context of the business world. It will give insights into how businesses commercialise new technology and products through good management and marketing skills while at the same time having a legal framework for commercial protection.",
        "semesters": 0,
        "prerequisites": ""
    },
    "HIST2407": {
        "course_name": "Germany from Bismarck to Hitler (1870-1933)",
        "course_code": "HIST2407",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "Rise of Prussia-Germany to its collapse in 1918, attempt to establish a democratic constitution (Weimar Republic) & rise of Nazi Party & other anti-democratic forces.\nThis course may not run if there are fewer than 20 enrolments.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MUSC3020": {
        "course_name": "Sound Recording Practice",
        "course_code": "MUSC3020",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Music School",
        "description": "This course develops advanced skills in creative music making music using music technologies and digital audio workstations. Topics include audio and MIDI recording, editing and mixing techniques, sound design, mix automation and critical listening. This course also focuses on microphone techniques for recording classical musicians. \n\nPlease note that this course offering may be cancelled if fewer than 10 students enrol.",
        "semesters": 2,
        "prerequisites": "MUSC1010 or MUSC2010"
    },
    "WRIT3700": {
        "course_name": "Publishing, Editing, and Authorship",
        "course_code": "WRIT3700",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "This course is situated within the frameworks of publishing studies and creative writing. It prepares students for careers as authors, editors, and publishers: by introducing them to current professional practices and conditions of authorship; by developing fundamental skills at all levels of editing; and by exploring contemporary print and digital publishing practices and processes.",
        "semesters": 2,
        "prerequisites": "8 units of advanced courses from the writing major or extended major, or permission of the course coordinators."
    },
    "PHIL7221": {
        "course_name": "Environmental Philosophy",
        "course_code": "PHIL7221",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "An introduction to ethical issues raised by relationships between humans and their environment. Topics include the value of wilderness and biodiversity, animal rights, obligations to future humans and nonhumans, the ethics of species extinction and the limits to growth.",
        "semesters": 2,
        "prerequisites": ""
    },
    "VETS1060": {
        "course_name": "Animal and Veterinary Biology",
        "course_code": "VETS1060",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl, Veterinary Science School",
        "description": "An overview of the diversity of living organisms with emphasis on relevance to the study of animal and veterinary science, leading to an introduction to the form and function of vertebrate body systems.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ANCH7981": {
        "course_name": "Dissertation",
        "course_code": "ANCH7981",
        "duration": "One Semester",
        "units": 8,
        "faculty": "",
        "school": "Historical & Philosophical Inq",
        "description": "Dissertation of 20,000 words on a topic approved by the Postgraduate Coursework Coordinator and supervised by a staff member.\nThis course is for full-time students commencing in Semester 1 OR Semester 2.\nPart-time students commencing in Semester 1 enrol in ANCH7980.\nPart-time students commencing in Semester 2 enrol in ANCH7982.",
        "semesters": 0,
        "prerequisites": ""
    },
    "GREK6675": {
        "course_name": "Greek Guided Texts",
        "course_code": "GREK6675",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "A detailed study of Greek literary and historical texts chosen by the Course Coordinator.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ARCA6008": {
        "course_name": "Honours Research Thesis",
        "course_code": "ARCA6008",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Humanities and Social Sciences",
        "school": "Social Science School",
        "description": "Independent research and thesis preparation under the guidance of a supervisor.",
        "semesters": 1,
        "prerequisites": "Bachelor of Arts (Honours): extended major in Archaeology, ARCS3001, GPA of 5 or higher for ARCA/ARCS/ANTH courses.\nBachelor of Science (Honours): major in Archaeological Science, ARCA3000 and ARCS3001, GPA of at least 4.5 over #8 of late year courses from Archaeological Science list."
    },
    "MGTS7526": {
        "course_name": "Risk Assessment and Decision Analysis",
        "course_code": "MGTS7526",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Businesses are exposed to many different risks. They do not have the resources to implement all possible risk mitigation strategies, so they have to prioritise. They also need to know what actions will minimise risk or reduce it to an acceptable level. Many factors affect risk and many risk factors are not easily quantifiable. Therefore, managers require risk assessment skills that allow them to accommodate multiple factors that affect risk and their relationship, account for uncertainty in risk factors, and evaluate risk management options. This requires skills in causal risk assessment whereby the relationships between risk factors are causally mapped, probabilities are applied to these causal relationships to develop a risk model and the risk model is used to evaluate risk management options. This course equips students with these skills.",
        "semesters": 2,
        "prerequisites": ""
    },
    "CONS7015": {
        "course_name": "Literature Review C",
        "course_code": "CONS7015",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Science",
        "school": "Biological Sciences School",
        "description": "Literature review on a chosen topic under the direction of a supervisor approved by the course coordinator.",
        "semesters": 3,
        "prerequisites": "Permission of Course Coordinator"
    },
    "SWSP7028": {
        "course_name": "Foundational Social Work Field Practice Course in Child, Youth and Family",
        "course_code": "SWSP7028",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course will provide students with a comprehensive understanding of the foundations of social work practice with children, young people and families. The course will focus on practice in both statutory and non-government service organisations. Course learning activities will focus on developing students' understanding and critical analysis of the legal, policy and organisational environments of practice with children, young people and families with a strong focus on understanding the Queensland and national environments of practice. Students will consolidate learning with regard to the application of psychological, sociological and political understandings of service user needs and experiences of service systems. Foundational practical skills in direct practice with children, young people, parents and other care givers will be considered. Specific needs of vulnerable children, young people and families will be considered particularly with respect to these families engagement with various service systems including child protection, education, health and juvenile justice systems.",
        "semesters": 0,
        "prerequisites": ""
    },
    "PLAN4010": {
        "course_name": "Research Topic (Planning)",
        "course_code": "PLAN4010",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Advanced coursework, field study or research project to complement the planning specialisations. A research topic approval form must be submitted before enrolment can be completed. Contact School for details.",
        "semesters": 3,
        "prerequisites": "Approval of Head of School"
    },
    "TIMS7319": {
        "course_name": "Management of Research & Development",
        "course_code": "TIMS7319",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course focuses on the organisational processes driving returns from R&D investments. Topics include connection R&D management to corporate, business and technology strategy-making processes, managing the resource allocation process, R&D investments decisions, risk management, measuring R&D effectiveness, management of the science/commerce interface, interfirm R&D managing changing technology trends, and R&D portfolio planning.",
        "semesters": 0,
        "prerequisites": ""
    },
    "LAWS7706": {
        "course_name": "Major Dissertation B",
        "course_code": "LAWS7706",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This #8 Dissertation consists of a piece of independent research completed by the student under the supervision of a member of the Law School academic staff. Students are to complete a dissertation paper on a topic approved by the Director of Postgraduate Coursework Programs (Law). The final dissertation shall be approximately 25,000 words in length. Students commencing in Sem 1 must enrol in LAWS7706 for both semesters. Students commencing in Sem 2 must enrol in LAWS7707 for both semesters. Any approved topic for LAWS7706 or LAWS7707 Major Dissertation B must be substantially different from any other postgraduate research project/topic previously undertaken by the student.",
        "semesters": 1,
        "prerequisites": ""
    },
    "WRIT7090": {
        "course_name": "Writing and Publishing for Children and Young Adults",
        "course_code": "WRIT7090",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "This course considers the vibrant segment of the trade publishing market that is children's and young adult writing, both from the perspective of the publishing professional and the creative writer. While the conditions of publishing have seen considerable disruptions and reconfigurations since the turn of the 21st century, the children's and young adult market has remained reliably significant in both economic and artistic terms. The course will consider the ways in which writing for children and young adults may differ from writing for other audiences; the particular ways in which these texts are produced, marketed, and circulated; and how authors and publishers relate to younger readers.",
        "semesters": 2,
        "prerequisites": ""
    },
    "PHIL7202": {
        "course_name": "Paradoxes",
        "course_code": "PHIL7202",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "An introduction to paradoxes of reasoning & rationality within philosophy. In addition to the sheer enjoyment these provide, they give rise to serious problems within philosophy, problems which will be pursued through the course.",
        "semesters": 0,
        "prerequisites": ""
    },
    "PHYS7825": {
        "course_name": "Experimental Design",
        "course_code": "PHYS7825",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "The lecture component covers experimental techniques, data analysis, and the design of experiments and instruments. In the laboratory students gain experience in advanced laboratory physics by carrying out a variety of experiments including an open-ended project style experiment. They learn special techniques of experimental physics, including analogue feedback control, and further develop skills in writing scientific reports and maintaining laboratory notebooks.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ENVM7202": {
        "course_name": "Resource Management & Environmental Planning",
        "course_code": "ENVM7202",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Introductory course addressing resources & systems thinking; sustainable development - history, concepts and applications; role and responsibilities of planning; new regionalism; integrated resource management and protected area case studies; water planning and management; includes discussion forums, analytical studies, mini-research project, and field work.",
        "semesters": 1,
        "prerequisites": ""
    },
    "MEDI7111": {
        "course_name": "Clinical Science 1",
        "course_code": "MEDI7111",
        "duration": "One Semester",
        "units": 3,
        "faculty": "Medicine",
        "school": "Biomedical Sciences School, Chemistry & Molec Biosciences, Medicine Faculty, Biomedical Sciences School, Chemistry & Molec Biosciences,",
        "description": "This course will introduce students to the study of clinically focused biomedical sciences using case-based learning approach that will be supported by a combination of lectures, practical sessions, expert tutorials and symposia. The course will include the following modules: Infection and Immunity, Cardiovascular, Respiratory and Renal.",
        "semesters": 1,
        "prerequisites": ""
    },
    "HLTH2000": {
        "course_name": "Understanding Digital Health",
        "course_code": "HLTH2000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Medicine Faculty",
        "description": "This course introduces students to the utility of information and communication technologies (ICT) within modern healthcare practice. Students will learn about a range of digital technologies and applications in the areas of clinical practice, education and administration that are fast becoming commonplace. The course fosters awareness of digital health at national and international levels; it examines the characteristics of digital health innovation, strategic vision and deployment in various countries such as Australia, US, Canada, Europe and the developing world. While evaluating the technological advances relative to patient-centered care, students will also study the potential pitfalls of the use of technology in healthcare. The course draws attention to the associated social, ethical, legal issues and workflow issues that must be considered when integrating digital health into clinical practice.",
        "semesters": 3,
        "prerequisites": ""
    },
    "PHIL7362": {
        "course_name": "Contemporary European Philosophy (Graduate)",
        "course_code": "PHIL7362",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "An exploration of contemporary themes and debates in recent French and German philosophy. Critiques of rationality, the nature of philosophical writing, ethical obligation, sexual difference and the future of philosophy.",
        "semesters": 0,
        "prerequisites": ""
    },
    "PHTY7933": {
        "course_name": "Clinical Reasoning and the Biomedical Model in Musculoskeletal and Sports Phys",
        "course_code": "PHTY7933",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "Advances student's clinical reasoning skills and knowledge in the fields of biological and medical sciences relevant to musculoskeletal sports physiotherapists.",
        "semesters": 2,
        "prerequisites": ""
    },
    "PUBH3003": {
        "course_name": "Evaluation of Health Programs: Field Placement",
        "course_code": "PUBH3003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Description: This course is built around a fieldwork project. Supporting classroom sessions cover: introduction to evaluation of health service programs; making the aims & objectives of programs explicit; translating objectives into quantifiable targets; setting realistic targets: benchmarking, consensus & other methods; structure, process, impact & outcome; designing tools for programs evaluation; practicalities of mixed methods approaches to evaluation; collection & coding of data; analysis of primary & routinely-compiled data; barriers to change in complex organisations; leadership styles; pathways to successful change; oral presentations.",
        "semesters": 0,
        "prerequisites": ""
    },
    "IBUS7324": {
        "course_name": "Global Management Thesis A",
        "course_code": "IBUS7324",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Students are required to complete a research thesis on topic of their interest within the global environment. Topics are to be approved by Head of the School of Business.",
        "semesters": 0,
        "prerequisites": "16 units from the MGMan List"
    },
    "ERTH7200": {
        "course_name": "Project or Thesis",
        "course_code": "ERTH7200",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Project or thesis relevant to resource exploration. Students commencing course in sem 1 enrol in ERTH7000 for sem 1 and sem 2; students commencing in sem 2 enrol in ERTH7200 for sem 2 and the following sem 1.",
        "semesters": 2,
        "prerequisites": "Permission of Head of School"
    },
    "OHSS3003": {
        "course_name": "Occupational Hygiene 2",
        "course_code": "OHSS3003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "This course is designed to build on the occupational hygiene knowledge, principles and practices developed in OHSS3000. Through a range of lectures, practicals and field visits, students will develop advanced skills for measuring and monitoring exposure to physical and biological hazards in the workplace. In addition students will acquire the necessary theoretical and practical knowledge to evaluate exposure information in respect to assessing and managing risk. The course focuses on key physical and biological health hazards including: lighting, noise and vibration, heat and cold, and ionising and non-ionising radiation. The course will also introduce students to emerging issues in occupational hygiene and explore exposure to psycho-social hazards.",
        "semesters": 2,
        "prerequisites": ""
    },
    "MGTS1982": {
        "course_name": "Working with Groups and Teams",
        "course_code": "MGTS1982",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "The course gives a broad practical understanding of processes of group development and function including understanding team roles, personal interactions in groups, leadership and conflict management. (Minimum enrolment required- 10 for Semester 2 and 25 for Summer Semester). From 2016 this course will replace MGTS2961.",
        "semesters": 6,
        "prerequisites": ""
    },
    "BIOT7033": {
        "course_name": "Issues in Biotechnology",
        "course_code": "BIOT7033",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Biomedical Sciences School, Chemistry & Molec Biosciences, Agriculture Food Sciences Schl",
        "description": "Overview of topical issues in biotechnology: Scientific basis & principles of biotechnology. Technical & non-technical issues in biotechnology products. Intellectual property basics. QA/QC regulatory compliance. Social, ethical & economic considerations & their impact on research & marketing. Currently debated issues in biotechnology & familiarisation with sources of this information.",
        "semesters": 2,
        "prerequisites": ""
    },
    "LAWS5209": {
        "course_name": "Law Moot B",
        "course_code": "LAWS5209",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "The course will involve mooting on a topical legal issue or field of law. Moots will vary from year to year. Refer to the Law School website for current competition and topic.",
        "semesters": 3,
        "prerequisites": "Permission from Head of School"
    },
    "VETS3012": {
        "course_name": "Animal Production Systems and Welfare",
        "course_code": "VETS3012",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "VETS3012 brings together the knowledge that has been taught in such subjects as immunology, parasitology, virology, nutrition, toxicology, reproduction, genetics and pathology and applies this knowledge to the practical on farm situation that today's veterinarians find in large animal practice. It is important that students are able to communicate effectively with rural clients. To do this they must have a sound knowledge of the production aspects of treating extensive and intensively managed production animals as well as large animal medicine.",
        "semesters": 1,
        "prerequisites": "ANIM1024, VETS1023"
    },
    "FOOD7018": {
        "course_name": "Food Bioprocessing",
        "course_code": "FOOD7018",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Bioprocessing involves the use of biologically-derived substances, such as live cells (animal, plant, yeast, fungi, microbial) or enzymes, to generate valuable products. This course covers such areas as: (i) production, extraction, purification, immobilisation and directed evolution of enzymes, (ii) downstream processing and value adding of food processing wastes, (iii) fermentation technology and genetic enhancement, (iv) biosensors, and (v) bioseparations. This course will require the student to research and review current and emerging bioprocessing topics under the supervision of a member of academic staff.",
        "semesters": 3,
        "prerequisites": ""
    },
    "MGTS7914": {
        "course_name": "The Sports Industry and Sports Markets",
        "course_code": "MGTS7914",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "The course will detail the extent and significance of the sports industry as widely defined. It will then study, empirically, the determinants of economic success for sporting teams and address issues of demand and supply management, player management, infrastructure, marketing and performance evaluation.",
        "semesters": 0,
        "prerequisites": ""
    },
    "PHIL1020": {
        "course_name": "Introduction to Logic",
        "course_code": "PHIL1020",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "Historical & Philosophical Inq",
        "description": "An introduction to the formal aspects of the modern science and art of logic for students of philosophy, mathematics or computer science, or indeed anyone interested in logic. No technical or mathematical background assumed.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MATH7022": {
        "course_name": "Project or Thesis in Financial Mathematics",
        "course_code": "MATH7022",
        "duration": "One Semester",
        "units": 8,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Research project/thesis report on topic in research field as recommended by supervisor and approved by Head of School.",
        "semesters": 3,
        "prerequisites": "Permission of Head of School"
    },
    "MARS2014": {
        "course_name": "Marine Science",
        "course_code": "MARS2014",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Biological Sciences School, Earth and Environment Sc Schl",
        "description": "Biology, geology, & oceanography of marine ecosystems, including estuaries, littoral zones & coral reefs.\nThere is a 3 day field trip to Moreton Bay Research Station held during the mid-semester break. Additional charges will apply. From Semester 1 2019 the field trip will be a compulsory component of the course.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ECON2060": {
        "course_name": "Behavioural and Evolutionary Economics",
        "course_code": "ECON2060",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "Examines approaches to economics of consumers and firms based upon applications of psychology and studies of actual behaviour in complex, uncertain and rapidly changing environments. Examines the policy implications of these contributions and includes coverage of recent work on the economics of happiness. The significance of behavioural economics was acknowledged by Nobel Prizes awarded to Herbert Simon (1978) and Daniel Kahneman (2002) and it has become widely taught in the past decade. The unit will be taught in a way that aims to develop critical thinking skills rather than focusing on mathematical techniques.",
        "semesters": 1,
        "prerequisites": "EC101 or 121 or ECON1010"
    },
    "DRAM2050": {
        "course_name": "Australian Drama",
        "course_code": "DRAM2050",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "This course examines the long tradition of Australian drama from early convict theatre, through nineteenth century melodrama, and across the bush drama, New Wave, Aboriginal drama and 'Internationalist' schools of the twentieth century to the present day. Questions the course asks include 'How is national identity reflected in the theatre Australia produces?', or even more importantly, 'How is national identity shaped by the work of theatre-makers across time?'",
        "semesters": 1,
        "prerequisites": "DRAM1010 for students in the drama major.\nAUST1000 for students in the Australian studies minor."
    },
    "PSYC4221": {
        "course_name": "Work and Research in Applied Psychology",
        "course_code": "PSYC4221",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "The 2018 maximum quota for the course will be 50 students. Enrolment is required by 9 July 2018 \n",
        "semesters": 2,
        "prerequisites": ""
    },
    "COMP7001": {
        "course_name": "Special Topics in Computer Science 7B",
        "course_code": "COMP7001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Specialist lectures/projects on topical issues in computer science to be given by visiting lecturers or staff members nominated by the Head of School. For details & availability contact enquiries@itee.uq.edu.au",
        "semesters": 3,
        "prerequisites": "Permission of Head of School"
    },
    "LAWS2703": {
        "course_name": "Law of Torts II",
        "course_code": "LAWS2703",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course builds on the basic knowledge of the law of torts developed in Torts I, focusing in greater depth on particular problem areas within the law of negligence. It also introduces students to a further range of torts protecting personal interests and places the law of torts in context by examining principles of vicarious liability and alternative compensation schemes that exist for personal injury and death.",
        "semesters": 2,
        "prerequisites": "LAWS2702"
    },
    "TOUR1001": {
        "course_name": "Global Cultures & Tourism",
        "course_code": "TOUR1001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course examines the philosophical, social and cultural traditions which underpin contemporary societies. It surveys some of the more important issues presently impacting on different societies but focuses specifically on issues relevant to Tourism, Hospitality and Events.",
        "semesters": 1,
        "prerequisites": ""
    },
    "POLS7712": {
        "course_name": "Knowledge Power and Politics",
        "course_code": "POLS7712",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "This course addresses the relationship between language, power and the study and practice of politics. In particular it addresses the questions: 'what type of knowledge is possible in the human or social sciences?' and 'what type of knowledge do we gain when we study politics?' The unit studies the methodological, epistemological and philosophical issues surrounding research in the social and political sciences. It seeks to address the conclusions which can be drawn from these debates for the nature of the study of politics and international relations.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MATH7010": {
        "course_name": "Project or Thesis",
        "course_code": "MATH7010",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Research project/thesis report on topic in research field as recommended by supervisor and approved by Head of School. Students commencing in sem 1 enrol in MATH7010 for sem 1 and sem 2; students commencing in sem 2 enrol in MATH7011 for sem 2 and the following sem 1.",
        "semesters": 1,
        "prerequisites": "Permission of Head of School."
    },
    "METR4201": {
        "course_name": "Control Engineering 1",
        "course_code": "METR4201",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering, Mech & Mine Engineering School",
        "description": "Introduction to control system design; system modelling principles for electrical & mechanical systems; the Laplace transform; block diagram modelling; open & closed loop control; role of feedback; transient & steady state performance; root locus; frequency response analysis; compensator design, practical issues in the implementation of control systems.",
        "semesters": 1,
        "prerequisites": "MECH2210 or ELEC2004"
    },
    "DRAM2400": {
        "course_name": "Performative Communication: Presentation and Public Speaking",
        "course_code": "DRAM2400",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "This course will develop your public presentation and performance skills. Taught in a workshop environment, it will provide essential training in physical and vocal communication, argument structure, and pitching to an audience.",
        "semesters": 1,
        "prerequisites": ""
    },
    "FINM7805": {
        "course_name": "Financial Management",
        "course_code": "FINM7805",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course provides a comprehensive overview to corporate financial decision making and adding value to the firm. The course will cover a number of important concepts and introduce such topics as financial mathematics, short-term financial management, debt and equity securities and their valuation, project evaluation with emphasis on the discounted cash flow techniques of net present value (NPV) and internal rate of return (IRR), portfolio theory and diversification, the weighted-average cost of capital (WACC), risk and the capital asset pricing model (CAPM), hedging with derivatives.",
        "semesters": 7,
        "prerequisites": ""
    },
    "SOCY7190": {
        "course_name": "Evaluating Social Programs",
        "course_code": "SOCY7190",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Social Science School",
        "description": "This course introduces concepts and skills to plan and conduct evaluations of social and development programs. During the semester students will become acquainted with theory of evaluation, design and logic of various types of evaluation, ethics, measurement of program outcomes, methodologies and data collection, including evaluation in health programs and the importance of accounting for gender and vulnerability in all evaluations. During the semester students will be afforded the opportunity to work with an organisation to produce an evaluation plan. Students will learn about negotiating a plan with a client, working with stakeholders, the different forms of evaluation, evaluation ethics, how to develop indicators and program logic, and finally how to ensure evaluation findings are disseminated and utilised.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MATH2000": {
        "course_name": "Calculus & Linear Algebra II",
        "course_code": "MATH2000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Please note that the contact hours for summer semester is 5L2T. \nMatrices, solution to linear systems, vector & matrix norms. Numerical algorithms for eigensystems, optimisation. First & linear second order differential equations, variation of parameters, applications, numerical methods. Surface & volume integrals, Stoke's & Green's Theorems, applications (flux, heat equations).",
        "semesters": 7,
        "prerequisites": "(MATH1051 or MATH1071) + (MATH1052 or MATH1072)"
    },
    "CRIM4111": {
        "course_name": "Advanced Methods A",
        "course_code": "CRIM4111",
        "duration": "One Semester",
        "units": 4,
        "faculty": "",
        "school": "",
        "description": "Research skills are highly valued by employers and are widely used in academic, government and non-governmental agencies, private companies and community organisations. This course aims to enhance the skill and knowledge of research methods used in the field of crime and justice. It will provide students the ability to build on research skills already gained in their degree, and provide them with research tools most appropriate for the field of crime and justice. Students will be able to develop research skill in the context of the most current and important research questions of the field as well as those skills most used in both the private and public sectors of crime and justice employment.",
        "semesters": 0,
        "prerequisites": "SOCY2339 + SOCY2049 or SOCY2019 + SOCY3329"
    },
    "MGTS7963": {
        "course_name": "Evaluation of Programs & Projects",
        "course_code": "MGTS7963",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": " This course will only be offered in EVEN Years",
        "semesters": 1,
        "prerequisites": ""
    },
    "CHEM6102": {
        "course_name": "Research Project in Chemistry",
        "course_code": "CHEM6102",
        "duration": "Two Semesters",
        "units": 10,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "description": "Individual research topic in the area of Chemistry, guided by an academic supervisor.",
        "semesters": 0,
        "prerequisites": ""
    },
    "PHIL2700": {
        "course_name": "Philosophy and Education",
        "course_code": "PHIL2700",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "This course is a practical approach to philosophy & education by drawing on philosophical methods of inquiry to address questions regarding education, as both formal educational provisions and teaching practices, and as learning which comes from social experience. It explores historical and contemporary approaches to education, the relation between philosophy, teaching and learning, and social and political issues. Issues addressed include: epistemology, pedagogy and curriculum; philosophy as a method of education; moral dimensions of education; education and citizenship; feminist approaches to education; and interculturality and Indigenous education, and moral development. The course also analyses the purpose, process, nature and ideals of education and the kinds of educational arrangements required to support democratic ways of life. Using as a starting point the idea of philosophical inquiry as an educational process, the approach will be multi-disciplinary.",
        "semesters": 1,
        "prerequisites": ""
    },
    "HLTH7001": {
        "course_name": "Introduction to Digital Health",
        "course_code": "HLTH7001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Medicine Faculty",
        "description": "This course introduces students to the utility of information and communication technologies (ICT) within modern healthcare practice. Students will learn about a range of digital technologies and applications in the areas of clinical practice, education and administration that are fast becoming commonplace. The course fosters awareness of digital health at national and international levels; it examines the characteristics of digital health innovation, strategic vision and deployment in various countries such as Australia, US, Canada, Europe and the developing world. While evaluating the technological advances relative to patient-centered care, students will also study the potential pitfalls of the use of technology in healthcare. The course draws attention to the associated social, ethical, legal issues and workflow issues that must be considered when integrating digital health into clinical practice.",
        "semesters": 3,
        "prerequisites": ""
    },
    "PLAN7520": {
        "course_name": "Research Project",
        "course_code": "PLAN7520",
        "duration": "Two Semesters",
        "units": 6,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Individual research project and/or field trip in an area of specialisation offered (on a discretionary basis) by staff members in their field of interest. Head of School consent is required. Prior to obtaining consent, intending students must discuss their project with, and obtain agreement to supervise that project from an appropriate member of academic staff. A consent form must be completed and submitted. Contact School for details. Students completing the course over a single semester enrol in PLAN7510. Students completing over a year and commencing in Semester 1 enrol in PLAN7520 for Semester 1 and Semester 2; commencing in Semester 2 enrol in PLAN7530 for Semester 2 and the following Semester 1; commencing in Semester 2 enrol in PLAN7540 and the following Summer Semester; commencing in Summer Semester enrol in PLAN7550 for Summer Semester and the following Semester 1.",
        "semesters": 1,
        "prerequisites": ""
    },
    "POLS7100": {
        "course_name": "Overview of Australian Political Institutions",
        "course_code": "POLS7100",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "An overview of Australian politics focusing on key political institutions such as parliament, cabinet, federalism, the constitution, pressure groups, parties, and the public service. The course explains the way in which Australian federal government works, highlighting both the formal foundations and informal practices characteristic of Australian politics. Suitable for international students and other students with a limited knowledge of Australian politics.",
        "semesters": 3,
        "prerequisites": ""
    },
    "OCTY4206": {
        "course_name": "Professional Issues for New Graduates",
        "course_code": "OCTY4206",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "Management techniques and considerations for individual practice, particularly as a new graduate.",
        "semesters": 2,
        "prerequisites": "All of Year Three of BOccThy (Hons) program plus OCTY4104 & OCTY4107"
    },
    "HSER1024": {
        "course_name": "Foundations for Interpersonal Practice",
        "course_code": "HSER1024",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course introduces the skills and processes of interpersonal communication including an understanding of how human behaviour change occurs. Using role plays and simulations, students develop microskills that are essential to working with children, young people, families, groups and communities.",
        "semesters": 0,
        "prerequisites": ""
    },
    "PSYC8301": {
        "course_name": "Internship and Professional Practice 1",
        "course_code": "PSYC8301",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "Supervised 250 hours professional experience. Internships conducted largely within the UQ Psychology Clinic, designed to extend skills in psychological assessment, therapy and report writing, and to develop understanding of professional issues.",
        "semesters": 3,
        "prerequisites": "Provisional or full registration as a Psychologist with the Psychology Board of Australia. PSYC7211 Clinical Skills"
    },
    "SLAT7899": {
        "course_name": "Language and Intercultural communication",
        "course_code": "SLAT7899",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Aspects of language & language-related phenomena across cultures; communication & mis-communication, politeness, verbal and non verbal communication.\nNOTE: Course may be cancelled if fewer than 20 students enrol.",
        "semesters": 2,
        "prerequisites": ""
    },
    "PHTY7821": {
        "course_name": "Theory, Practice & Research: Musculoskeletal Phty - Upper Limb",
        "course_code": "PHTY7821",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "Focus on developing professional competencies in the areas of assessment, clinical reasoning, diagnosis & treatment selection relating to the physiotherapy management of MS conditions of the upper limbs.",
        "semesters": 1,
        "prerequisites": "PHTY7802 + PHTY7803"
    },
    "ANIM2053": {
        "course_name": "Animal Nutrition",
        "course_code": "ANIM2053",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "The nutrition of domestic and wild animals; nutritional ecology, nutrients, digestion and nutrient supply, food evaluation and quality, regulation of food intake, quantitative nutrition.",
        "semesters": 1,
        "prerequisites": ""
    },
    "HLTH6000": {
        "course_name": "Advanced Discipline Readings",
        "course_code": "HLTH6000",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Medicine",
        "school": "Public Health School",
        "description": "Students will conduct a systematic review of the scientific literature, critique the relevant literature and synthesize the information relevant to their research thesis. Students will present the results in the form of a written presentation.",
        "semesters": 3,
        "prerequisites": ""
    },
    "DENT5599": {
        "course_name": "Research Project II",
        "course_code": "DENT5599",
        "duration": "Two Semesters",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "Conducting a research investigation, materials & methods, critical analysis of findings for honours research under supervision. Presentation of results in written & oral form. Final written report to be in the form of a journal article suitable for publication.",
        "semesters": 0,
        "prerequisites": "DENT4599"
    },
    "CSSE7610": {
        "course_name": "Concurrency: Theory and Practice",
        "course_code": "CSSE7610",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Provides a solid understanding of the issues of concurrent programming - processes and threads, scheduling, synchronisation, communications, and data sharing - including their application in distributed systems. The course covers methods for both the specification and verification of such systems at a high level of abstraction, and their implementation in a modern programming language.",
        "semesters": 2,
        "prerequisites": "CSSE2002 or CSSE7023"
    },
    "EDUC1706": {
        "course_name": "Introduction to Role of Science and Technology Education in Society",
        "course_code": "EDUC1706",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "This course provides an introduction to science and technology education in primary schooling. The course reviews the appropriate scientific ideas and practices for these levels of schooling. It builds understanding about how scientific knowledge can be used in current society ranging from personal health and well being to global concerns such as climate change and sustainability. The close link between science and technology forms an underlying theme in the course. The teaching strategies used in the course reflect international best practice and the Australian Curriculum.",
        "semesters": 2,
        "prerequisites": ""
    },
    "GRMN6920": {
        "course_name": "Dissertation",
        "course_code": "GRMN6920",
        "duration": "One Semester",
        "units": 8,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course involves an introduction to sustained research and the production of an Honours thesis (in German or English) in conjunction with an individual advisor. Students are required to establish a research question, reading list, clarify a research topic, write a literature review and present written conclusions through a careful process of drafting and redrafting.",
        "semesters": 3,
        "prerequisites": ""
    },
    "DECO2300": {
        "course_name": "Digital Prototyping",
        "course_code": "DECO2300",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "This course introduces students to a range of digital prototyping techniques for generating proof-of-concept solutions for design computing projects. Students will design and rapidly prototype interactive solutions, following up with critique and reflection on the success and/or failure of artefacts presented.",
        "semesters": 2,
        "prerequisites": "DECO1100 and (CSSE1001 or DECO1400)"
    },
    "ARCH7003": {
        "course_name": "Advanced Architectural Design: Adaptive Capacities",
        "course_code": "ARCH7003",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Architecture School",
        "description": "Students in this course operate on, in or alongside existing built fabric, analysing its heritage and material qualities, and formulating architectural proposals for its re-use, adaptation or conservation. The historical legacy of places is considered broadly, embracing the modern and industrial, cultural heritage and memorialisation as well as designated heritage sites. The design process takes in past and present uses of the site, as well as regulatory parameters, conservation policies and methodologies, stakeholders and economic viability. An expanded range of technologies, such as digital scanning, is used in the documentation of the site and the communication of proposed interventions. Students will be required to explain their interventions at a range of scales from the urban, to the interior and the architectural detail.",
        "semesters": 3,
        "prerequisites": "Admission to the MArch"
    },
    "LAWS5124": {
        "course_name": "Human Rights Law",
        "course_code": "LAWS5124",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course is a critical examination of the legal and social issues that arise in the practice of human rights law. It draws comparisons between Australian law and law in other jurisdictions, particularly the United States and Europe. The course seeks to develop students' skills in critical analysis by encouraging them to reflect on the role of human rights law within democratic societies, and whether human rights law has the capability to solve complex social problems.",
        "semesters": 2,
        "prerequisites": "All Level 1 & 2 LAWS courses"
    },
    "MKTG2961": {
        "course_name": "Agribusiness Sales",
        "course_code": "MKTG2961",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Application of industrial marketing principles to marketing of agricultural inputs & products.",
        "semesters": 0,
        "prerequisites": "ABUS2001 or MKTG2960 or MKTG1502"
    },
    "SLAT7897": {
        "course_name": "Independent Reading Course A",
        "course_code": "SLAT7897",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Advanced level study of a special subject, allowing students to pursue a course of readings & tutorial discussion related to their applied linguistic profession.",
        "semesters": 3,
        "prerequisites": "Permission of the course coordinator"
    },
    "EDUC7570": {
        "course_name": "Teaching Mathematics 1",
        "course_code": "EDUC7570",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "Developing foundational knowledge of numeracy and pedagogies in Mathematics, students will build their knowledge of mathematics curriculum. Through further exploration of key topics and issues in mathematics curriculum, they will become familiar with local, state and national curriculum and policy documents for school mathematics and numeracy.",
        "semesters": 4,
        "prerequisites": ""
    },
    "CHIN6364": {
        "course_name": "Special Topics in Chinese Cultural Studies",
        "course_code": "CHIN6364",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Students are trained in identifying, sourcing, reading and citing primary articles relevant to their Honours dissertation in the field of Cultural Studies. On completing this course students should be competent in locating and using Chinese research materials in the field of Cultural Studies; be familiar with relevant bibliographies and indexes; be familiar with common Chinese transcription systems and specialist terminologies; and have compiled a small bibliography of Chinese Cultural Studies materials relevant to their dissertation topic.",
        "semesters": 3,
        "prerequisites": ""
    },
    "DENT7901": {
        "course_name": "Dental & Oral Health",
        "course_code": "DENT7901",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "This course is restricted to students enrolled in the MNPractSt program (Rural & Remote plan). The course covers the epidemiology and prevention of major oral diseases, orofacial anatomy, dental caries, periodontal disease, traumatic injuries, soft tissue lesions and referral. Students are expected to establish a strong liaison with a local dental practitioner.",
        "semesters": 0,
        "prerequisites": ""
    },
    "EDUC6780": {
        "course_name": "Chemistry: Specialist Teaching Area",
        "course_code": "EDUC6780",
        "duration": "Two Semesters",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "This course is designed to challenge pre-service teachers to use their knowledge, expertise and experience to design learning environments that will engage students in the learning process and cater for a variety of learning styles. This includes the application of principles and methods of curriculum development, implementation and assessment to chemistry; preparing curriculum materials and their rationales: observations of teaching.",
        "semesters": 1,
        "prerequisites": "Entry to the Graduate Diploma of Education (Secondary) or Bachelor of Education (Secondary) (Dual Degree) professional year."
    },
    "GEND3002": {
        "course_name": "Women, Ethnicity & Identity: Issues of Race & Representation in Gender Researc",
        "course_code": "GEND3002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "Communication & Arts School, Education School",
        "description": "This interdisciplinary course aims to engage students with current debates in women's studies around the complexities of identify, ethnicity and race and the issues these raise in the context of gender research. Central to this course is discussion of the multiple ways in which identity and gender\ninteract and impact upon research methodologies, processes and results. Of particular interest in this course are issues of Indigeneity and whiteness and the course includes in-depth reflection on the politics of race, relationships and representation in gender research.\nNOTE: Course offering may be cancelled unless a minimum of 20 students enrol",
        "semesters": 0,
        "prerequisites": "GEND1000 and #6 of advanced Women's Studies major courses or ABTS1000 and #6 of advanced Aboriginal & Torres Strait Islander major courses"
    },
    "BINF7003": {
        "course_name": "Data Visualisation",
        "course_code": "BINF7003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "",
        "semesters": 0,
        "prerequisites": ""
    },
    "POLS7515": {
        "course_name": "Hybridity, Local Peace and Governance",
        "course_code": "POLS7515",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "This course engages with key contemporary debates in the theory and practice of peacebuilding, conflict transformation and formation of peaceful political community. It investigates the challenges and questions generated through the interaction and enmeshment of top-down institutional approaches to peacebuilding with bottom-up informal modes of peace formation and governance in the local context. It explores the international/local and state/non-state interactions in peacebuilding, focusing on the notion of hybridity and concepts like 'hybrid forms of peace' and 'hybrid political orders'. \n\nThe course begins by unpacking the conceptual framework and explores the theoretical arguments around statebuilding, hybrid political orders, hybrid peace and what is referred to as the `local turn'. In doing so we explore legal pluralism and hybrid approaches to policing and security. We then critically engage with these concepts - challenging the normative implications and considering the shortfalls of these arguments. Once the key concepts are bedded down we take a close look at what the `local' and hybridity means in practice through a series of guest lectures covering a range of case studies. Guest lecturers share stories as practitioners and field researchers from Indonesia, China, Indigenous Australia, Kenya, Uganda, Nigeria, and Pacific Island Countries.",
        "semesters": 0,
        "prerequisites": ""
    },
    "WRIT1110": {
        "course_name": "Creative Writing: Narrative Fiction",
        "course_code": "WRIT1110",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "Introduces students to creative writing and narrative through the art and techniques of short-form narrative prose fiction.",
        "semesters": 1,
        "prerequisites": ""
    },
    "BIOL2205": {
        "course_name": "Insect Science",
        "course_code": "BIOL2205",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Biological Sciences School",
        "description": "The course introduces students to the unique aspects of insect biology that have produced the tremendous biodiversity of insects on the planet. Students will become familiar with the major groups of insects, their biology & life histories. The reason for the success of insects as a group of animals is explained in terms of their external & internal anatomy, physiology, behaviour, metamorphosis & ecology. The course will be based around 5 thematic modules: (1) Taking to Land & Air, (2) Sexual Adventures, (3) Communities, (4) Global Impact & (5) Identity & Diversity. Please note that this is a self-directed learning course. There are no face-to-face lectures or practicals. ",
        "semesters": 2,
        "prerequisites": "BIOL1030"
    },
    "ANIM7620": {
        "course_name": "Concepts in Animal Science",
        "course_code": "ANIM7620",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Fundamental studies in animal welfare & behaviour; anatomy & physiology; nutrition; genetics, breeding & reproduction as well as health for students wishing to retrain in the animal science area.",
        "semesters": 3,
        "prerequisites": ""
    },
    "LAWS7999": {
        "course_name": "US Corporate Law",
        "course_code": "LAWS7999",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "As the largest economy in the world, the corporate law of the United States has an impact far beyond the US. US corporate law scholarship has also been extremely influential in shaping the laws of other jurisdictions, including Australia. This course will explore the major parts of United States corporate law, including the law relating to the formation and governance of companies.",
        "semesters": 0,
        "prerequisites": ""
    },
    "SPCG7030": {
        "course_name": "Directed Study",
        "course_code": "SPCG7030",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "A critical review of the literature to inform future research.",
        "semesters": 3,
        "prerequisites": ""
    },
    "POLS3807": {
        "course_name": "Policy Practice",
        "course_code": "POLS3807",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "This course is designed for students wishing to apply for work as policy officers in the public service Â¿ Australian Government or state/territory Â¿ or work with private sector or not-for-profit organisations at the policy interface with government. It will provide an understanding of what government does, what it is responsible for, and how decisions are made, and will, through a practical approach, build the essential reasoning, relational and writing skills required for work as a policy practitioner.\nStudents will be exposed to practitioners from graduate to senior levels in a range of Queensland Government departments (including Treasury and the Department of the Premier and Cabinet). The program also includes a visit to Parliament to observe Question Time and a visit to a policy unit in a government department. An important component of the program is the opportunity to test-run with senior Government officers a job application and an interview.",
        "semesters": 0,
        "prerequisites": ""
    },
    "STAT7003": {
        "course_name": "Probability & Statistics",
        "course_code": "STAT7003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Probability; random variables; probability distributions; Markov processes; statistical analysis & modelling",
        "semesters": 1,
        "prerequisites": ""
    },
    "FINM3404": {
        "course_name": "Banking & Lending Decisions",
        "course_code": "FINM3404",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course will consider the uniqueness of the financial institutions, assessment of credit risk and the principles of successful bank lending, as well as risk management in banks. At the end of this course, you will understand the risk assessment of various types of loans, the mechanisms for predicting financial distress, the principles of asset liability management, securitization and its impact of the Global Financial Crisis (GFC) 2007, bank regulation, bank profitability analysis and international banking system.",
        "semesters": 1,
        "prerequisites": "FINM1415 or 2401 or 2411 or 2412"
    },
    "OCTY7140": {
        "course_name": "Home Modification & Environmental Design",
        "course_code": "OCTY7140",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "Health & Rehab Sci School",
        "description": "Provides students with specialist clinical skills for assessing individuals in their environment within a framework of contemporary models of occupational therapy practice.",
        "semesters": 0,
        "prerequisites": "OCTY7812"
    },
    "HMST3103": {
        "course_name": "Management & Marketing of Sport & Physical Activity",
        "course_code": "HMST3103",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "Provides background knowledge, administrative, management & marketing techniques in researching, planning, operating & evaluating programs (including major events, conferences) pertaining to physical activity & sport. A 60-hour practical fieldwork placement is a major component of this course. Students in this course are expected to negotiate with an organisation independently for own fieldwork placements.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ECON2320": {
        "course_name": "Business & Economic Decision Techniques",
        "course_code": "ECON2320",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "Provides a working understanding of some of the principal techniques used in business decision making. Topics include linear programming, transportation & assignment models, project scheduling & control, inventory models, & decision theory & games. These techniques can be used to solve problems in areas as diverse as product mixing & blending, firm efficiency & benchmarking, project management, & multi-period financial planning. Problems & exercises are solved using Microsoft Excel or a simple menu-drive software package.",
        "semesters": 2,
        "prerequisites": "ECON1050; (For BInfTech students ECON1010 + STAT2004), (For Engineering students MATH1050, MATH1051 or MATH1052)"
    },
    "JOUR7802": {
        "course_name": "Internship",
        "course_code": "JOUR7802",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "Students participate in the workday routine of a news media organisation for the specified period, undertaking those tasks assigned to them and seeking to display initiative, enthusiasm, professionalism and a willingness to learn. You will, where opportunity allows, contribute to the published or broadcast news output of the organisation, working under the supervision of a professional journalist. You will plan, observe and analyse; submitting your planning prior to the placement, and summarising your observations and analysis at the conclusion of your internship. The 1,000-word report should outline and analyse observed newsroom processes & relate these to academic literature on journalism.",
        "semesters": 0,
        "prerequisites": "Completed #8 units postgraduate study."
    },
    "ERTH7510": {
        "course_name": "Geophysical Signal Processing",
        "course_code": "ERTH7510",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Concepts of digital signal analysis with emphasis on applications in seismic exploration. Minimum delay concept Z-transform, convolutional model, inverse & Wiener filtering, deconvolution, propagation in layered systems.",
        "semesters": 3,
        "prerequisites": "Permission of Head of School"
    },
    "TOUR3006": {
        "course_name": "Responsible Tourism and Ethics",
        "course_code": "TOUR3006",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course examines a series of contemporary concepts and theories essential for responsible tourism including sustainable tourism for eliminating poverty (pro-poor tourism), cultural heritage management and protected area management. Responsible tourist behaviours are also examined.",
        "semesters": 1,
        "prerequisites": ""
    },
    "EDUC6835": {
        "course_name": "Legal Studies: Specialist Teaching Area",
        "course_code": "EDUC6835",
        "duration": "Two Semesters",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "This course is designed to challenge preservice teachers to use their knowledge, expertise and experience to design learning environments that will engage students in the learning process and cater for a variety of learning styles. This includes the development of practical skills and understanding of approaches to teaching legal studies and preparing practical curriculum materials across range of topics covered in senior legal studies.",
        "semesters": 1,
        "prerequisites": "Entry to the Graduate Diploma of Education (Secondary) or Bachelor of Education (Secondary) (Dual degree) professional year."
    },
    "CRIM3100": {
        "course_name": "Correctional Practice",
        "course_code": "CRIM3100",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Social Science School",
        "description": "This course explores the challenges that convicted offenders face through processes of rehabilitation, reentry, and reintegration. Through an exploration of a range of corrections topics, students will gain knowledge about current and past correctional management practices. Students will be exposed to evidence-based concepts, research and policy from experts in the field. Students will gain critical knowledge and skills that will help them to contribute as practitioners in the field.",
        "semesters": 2,
        "prerequisites": "CRIM1019 and CRIM1000"
    },
    "MMDS1801": {
        "course_name": "Multimedia Studio 1",
        "course_code": "MMDS1801",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Not offered 2008.Studio based projects, seminars & critiques, exploring the nature of multimedia design & introduce essential communication skills. Projects involve imaginative perception, creative idea generation & evaluation. Practical skills development in two dimensional image creation & manipulation.",
        "semesters": 0,
        "prerequisites": ""
    },
    "CONS6010": {
        "course_name": "Research Project A",
        "course_code": "CONS6010",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Biological Sciences School",
        "description": "Research project on a chosen topic under the direction of a supervisor approved by the course coordinator.",
        "semesters": 3,
        "prerequisites": "Permission of Course Coordinator"
    },
    "VETS1022": {
        "course_name": "Veterinary Biology & Histology",
        "course_code": "VETS1022",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "An overview of the diversity of living organisms with emphasis on its relevance to the study of veterinary science; an introduction to the study of genetics, & mammalian gross anatomy & histology.",
        "semesters": 0,
        "prerequisites": ""
    },
    "CHEM1090": {
        "course_name": "Introductory Chemistry",
        "course_code": "CHEM1090",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "description": "This course introduces the core concepts and principles in chemistry at a foundation level that enables students who have not previously studied chemistry to progress further in tertiary chemistry. Concepts encountered include: atomic and electronic structure; bonding and molecular structure; intermolecular associations; states of matter; gas laws; solutions; equilibrium; acids & bases; thermochemistry; kinetics; redox processes; stoichiometry; and an introduction to organic chemistry. These are all considered in contexts that develop quantitative chemistry skills.",
        "semesters": 1,
        "prerequisites": ""
    },
    "POLS7207": {
        "course_name": "Independent Study",
        "course_code": "POLS7207",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "This is a restricted entry course and requires prior approval from the School. The independent study option allows students of exceptional ability to engage in a minor research project. The course is particularly useful for postgraduate coursework students who wish to investigate a topic of interest not covered by other postgraduate courses. Prospective students must themselves identify and approach a potential supervisor and discuss their proposed research question; supervisors are not assigned by the School for this course. Student eligibility will be examined in the following areas:\n - Grade point average (GPA): successful applicants would be expected to have achieved a program GPA of 5.5 or better in their Masters program\n- Progression through degree : successful applicants would be expected to be in the final semester of their studies (or have completed at least #8 units in the program)\n- Viability of project : the project outline will be reviewed to determine its quality, viability and feasibility\n- Availability of supervisor : the research project must be of direct interest to an academic staff member within the school, who in turn must have the workload capacity to supervise a student. Further information, including the application form and application due dates, is available from https://polsis.uq.edu.au/student-support. Students are required to submit the application form and their independent study proposal by the relevant due date by email to polsis@uq.edu.au",
        "semesters": 7,
        "prerequisites": ""
    },
    "PLNT2014": {
        "course_name": "Turf Science I",
        "course_code": "PLNT2014",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "An introduction to the concepts, terminology and processes involved in the field of turfgrass science. It focuses on turfgrass growth and development and species characterisation. Also emphasised are turf quality, the turfgrass environment (including atmospheric and soil componants of the environment), cultural practices, pest management and turf establishment.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MATH7301": {
        "course_name": "Advanced Algebra",
        "course_code": "MATH7301",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "(offered in semester 2 in odd years only)\nTopics from groups, rings, fields, algebraic number theory, category theory & homological algebra, with applications to quantum algebras.",
        "semesters": 0,
        "prerequisites": "Permission of Head of School"
    },
    "AERO4800": {
        "course_name": "Space Engineering",
        "course_code": "AERO4800",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Mech & Mine Engineering School",
        "description": "The course draws upon and extends many of the methods used by mechanical and space engineers in their professional practices. You will learn how to perform advanced trajectory design and launch vehicle sizing; analyse issues related to thermal loading and control of space systems, perform reliability estimates for complex systems, analyse complicated tasks by reducing them to their individual components, and communicate your ideas and concepts through engineering drawings and written and oral reports.",
        "semesters": 2,
        "prerequisites": "MECH2210 and MECH3400 and MECH2700"
    },
    "PSYC7435": {
        "course_name": "Business Psychology Project C",
        "course_code": "PSYC7435",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "The purpose of the Business Psychology Projects are to develop the skills required to work both as an internal and external consultant in the private, public and not-for-profit sector. Each student gets to work on a mix of projects covering different areas of practice and work settings. Types of settings may include small consultancy firms, large consultancy firms, publicly listed companies, government agencies, not-for-profit organisations, and independent practice. The projects are challenging, and require students to apply their skills to a wide range of complex problems. Projects typically involve a mix of internships and externships. During an internship, students work as a group on a consultancy project for a real client under the supervision of an experienced consultant. During an externship, students work in, or for, an external organisation.",
        "semesters": 3,
        "prerequisites": "PSYC7425"
    },
    "MKTG3509": {
        "course_name": "Contemporary Issues in Marketing",
        "course_code": "MKTG3509",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course introduces students to the professional scholarly literature in marketing. Through a series of lectures and guided readings, students should develop a broader appreciation of the field and its foundations, plus insights into recent developments within the field and the process of knowledge development within marketing.",
        "semesters": 2,
        "prerequisites": "MKTG2501"
    },
    "PLNT2002": {
        "course_name": "Plant Physiology",
        "course_code": "PLNT2002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "This course examines plant physiology and relates this to growth and development. The main physiological systems will be examined sequentially and aspects of biology relevant to currently active or promising research areas featured. The course features aspects of physiology that are relevant to the development of plants important to agriculture and horticulture, including weeds. Lectures and laboratory classes will be accompanied with web-based resources.",
        "semesters": 2,
        "prerequisites": ""
    },
    "LAWS7215": {
        "course_name": "JD Dissertation A",
        "course_code": "LAWS7215",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course is not offered in 2014.",
        "semesters": 0,
        "prerequisites": "#16 of LAWS courses"
    },
    "RBUS6911": {
        "course_name": "Commerce Honours Seminar",
        "course_code": "RBUS6911",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School, Chemistry & Molec Biosciences",
        "description": "Research seminar in topics relevant to commerce, for example management of Intellectual Property.",
        "semesters": 1,
        "prerequisites": "Permission from Head of School"
    },
    "PXPY7051": {
        "course_name": "Case Management in Mental Health I",
        "course_code": "PXPY7051",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Focuses on basic components of effective mental health case management practice: relationship building & maintenance; collaborative & appropriate assessment of client/patient's needs; planning practical interventions, both long & short term; crisis intervention & follow-up, review & evaluation of intervention with emphasis on client/patient's perspective & responses.",
        "semesters": 0,
        "prerequisites": ""
    },
    "HLTH7200": {
        "course_name": "The Australian Healthcare System: Present & Future Challenges",
        "course_code": "HLTH7200",
        "duration": "One Semester",
        "units": 1,
        "faculty": "Medicine & Biomedical Sciences",
        "school": "Public Health School",
        "description": "In the coming decade, how the Australian Health System operates will be the major issue of Australian political and public debate. This course examines three fundamental questions: Why is it a major challenge to sustain the Australian health system? Why healthcare leaders will need to rethink workforce planning? What are some current solutions on offer? In this course, you will learn to understand and to discuss with confidence the most important features of the Australian healthcare system. This means not only being able to understand the structure and arrive at your own answers to the above questions, but also to analyse significant policies, players, debates, and ideas informing current health system planning. A key objective of this course is to use this knowledge to reflect on your own management style and workplace practices, to understand where your organisation fits in with `the systemÂ¿, and to learn to decipher important policy patterns and trends in public health practice. You will have a clearer understanding of the factors and influences shaping the future of the Australian Health System.",
        "semesters": 0,
        "prerequisites": ""
    },
    "COMP7308": {
        "course_name": "Operating Systems Architecture",
        "course_code": "COMP7308",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Implementation and design techniques for operating systems. Core material includes advanced kernel-level and device driver programming techniques, how operating systems principles are realised in practice, principles and practice of operating system support for distributed and real-time computing, case studies and different approaches to operating system design and implementation, including different models of software ownership.",
        "semesters": 2,
        "prerequisites": "COMP7306 or CSSE7231"
    },
    "PHIL1110": {
        "course_name": "Critical Reasoning",
        "course_code": "PHIL1110",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "Analyses thought & its expression in oral & written work from a structured & logical perspective. Aims to promote clearer thinking, foster better expression, & improve your analytic capabilities with a view to developing clearer & more persuasive argument skills.\nThis course may not run if there are fewer than 20 enrolments.",
        "semesters": 1,
        "prerequisites": ""
    },
    "NURS2007": {
        "course_name": "Healthy Ageing",
        "course_code": "NURS2007",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "The major health & social problems associated with ageing will be covered. Students will re-visit the rights of the older person in relation to health care & the ethical & legal issues in relation to care of a person with dementia. Students will learn about the range of care provided for the elderly & disabled in the community including informal care in the family & the impact of caring for the elderly & disabled on the health & lives of the carers.",
        "semesters": 2,
        "prerequisites": "NURS1001, NURS1002, NURS1003, NURS1004, NURS1005, NURS1006, NURS1007, NURS1008, NURS2001, NURS2002, NURS2004, NURS2005"
    },
    "FOOD7618": {
        "course_name": "Graduate Research Project III",
        "course_code": "FOOD7618",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Design, implementation & presentation of a research project, approved by the Head of School & relevant to the course, with emphasis on defining the research issue, establishing methodology, undertaking appropriate analysis of data & drawing defensible conclusions. Students completing the course in one semester must enrol in FOOD7617. Students completing the course in two semesters must enrol in FOOD7618 (for both sem1 & 2) if commencing in sem 1 or FOOD7619 (for sem 2 & sem 1 of the following year) if commencing in sem 2.",
        "semesters": 1,
        "prerequisites": ""
    },
    "SCIE2011": {
        "course_name": "Perspectives in Science",
        "course_code": "SCIE2011",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Biomedical Sciences School, Mathematics & Physics School",
        "description": "Introduces the breadth of scientific endeavour, the integrated nature of scientific disciplines, and the importance of scientific process and critical thinking. Students will work in groups, examining a series of real scientific issues, dealing with medical, environmental and social issues. Students will learn more about the associated scientific research, integrate expert knowledge, and build on their own new university knowledge and experiences. This is a face-to-face course, using a combination of scientific discussion, self-directed learning, student presentations, class activities and a practical component. Entry is by application and is limited to 40 places.",
        "semesters": 2,
        "prerequisites": ""
    },
    "SPMD7005": {
        "course_name": "Clinical Exercise Science for Sports Medicine 1",
        "course_code": "SPMD7005",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "Develops theoretical and practical skills focussing on the cardiovascular system during exercise. Topics covered include physiological responses of the cardiovascular system in response to exercise, exercise ECG interpretations and the role of exercise in the primary, secondary and tertiary prevention of cardiovascular disease.",
        "semesters": 1,
        "prerequisites": ""
    },
    "NUTR2101": {
        "course_name": "Nutrition Science",
        "course_code": "NUTR2101",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "This course provides the basis for an in-depth understanding of nutrition biochemistry, what the human body requires in food to maintain homeostasis, and how the nutritional status of individuals and populations is determined. Topics covered include energy metabolism; components and role of the human gastro-intestinal tract; macronutrients and micronutrients absorption, metabolism and their role in health; signs, symptoms and causes of nutrient deficiency; the diet-disease relationship and significance in the context of the life-cycle and of chronic disease. The course also provides the understanding of how nutrition science is translated into dietary guidelines, and equips students with the tools to discern objectively between sound nutrition information and unfounded nutrition commercially-oriented claims.",
        "semesters": 1,
        "prerequisites": "(CHEM1090 or CHEM1100) + (CHEM1200 or CHEM1221)"
    },
    "RELN3501": {
        "course_name": "Advanced Study of Religious Texts B",
        "course_code": "RELN3501",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "Advanced study of selected religious texts.",
        "semesters": 1,
        "prerequisites": "Approval of Lecturer & Director of Undergraduate Studies"
    },
    "KORN3220": {
        "course_name": "Korean for Korean Speakers and Advanced Non-Korean Speakers",
        "course_code": "KORN3220",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course provides students functional communicative ability that is linguistically competent and culturally appropriate in a given context pursuing towards the TOPIK level 4. For this purpose, this course aims to build the structural foundation of Korean grammar and the use of honorifics and different speech styles will be also taught to enhance students' sociolinguistic and pragmatic competence. While this course will cover four language skills, more emphasis will be given on reading and writing skills, which need to be worked on by these students. Upon completion of the course, students should be able to talk and write about a variety of topics such as mood and personalities, clothing, weather, illness, Korean food, etc. with reasonable accuracy and in a sociolinguistically appropriate manner. Before enrolling in this course, students must take a placement test.",
        "semesters": 1,
        "prerequisites": "TOPIK (Korean Proficiency Test) level must not be over 4 to enter this course. Placement test is essential."
    },
    "PLNT7009": {
        "course_name": "Topics in Weed Science",
        "course_code": "PLNT7009",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Natural Resources, Agriculture & Veterinary Science",
        "school": "",
        "description": "Selected topics in weed biology, ecology and management.",
        "semesters": 0,
        "prerequisites": ""
    },
    "RELN2301": {
        "course_name": "Buddhism",
        "course_code": "RELN2301",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "Origin, doctrinal development & geographical expansion of Buddhism.\nThis course may not run if there are fewer than 20 enrolments.",
        "semesters": 1,
        "prerequisites": ""
    },
    "EVNT2003": {
        "course_name": "Event Planning and Management",
        "course_code": "EVNT2003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course focuses on the pre-event phase. Taking an inter-disciplinary approach, and integrating theory with practice, it equips students with the project management knowledge and skills to plan a range of business, leisure, sporting, cultural and lifestyle events.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ENGG7501": {
        "course_name": "Well Logging for Petroleum Engineers",
        "course_code": "ENGG7501",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "[Taught by intensive mode over a 2 week period with assessment following after this.]\nThe aim of this module is to: \nUnderstand the concept of formation evaluation and well logging. Understand the physical principles of the tools used in logging. Characterise the formation based on interpretation of well logs.",
        "semesters": 1,
        "prerequisites": ""
    },
    "DECO7110": {
        "course_name": "Design Thinking",
        "course_code": "DECO7110",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "This course introduces students to the design process, working through the discovery, interpretation, ideation, experimentation and evolution of design solutions. Through short collaborative design projects, students develop essential design skills of seeing, imagining and communicating in order to generate, iterate, evolve and communicate design concepts. Subjects such as design processes, thinking methods, brainstorming & idea generation, user focussed thinking and aesthetics are covered during the course.",
        "semesters": 1,
        "prerequisites": ""
    },
    "DIPMG1220": null,
    "PUBH7036": {
        "course_name": "Health Promotion Implementation and Evaluation",
        "course_code": "PUBH7036",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Public Health School",
        "description": "This course will introduce students to frameworks and tools for evaluation in health promotion. Students will gain the skills to develop comprehensive evaluation plans that facilitate the evidence needed to inform sustainable health promotion actions.",
        "semesters": 1,
        "prerequisites": ""
    },
    "CIVL4170": {
        "course_name": "Environmental Risk Assessment and Management",
        "course_code": "CIVL4170",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "Within the civil and environmental engineering field many projects are managed within a risk assessment framework. This course is a simulation of the planning phase of a development, taking into account safety to workers and the surrounding community; and the environmental and social impact of the plant. Students will apply risk assessment principles to reduce impacts from potential accidents and chronic emissions to acceptable levels, for those in the development and to the broader community and environment. Students will develop the capacity to formulate strategies that demonstrate a given development scenario will be compliant with relevant safety and environmental legislation and implement best practice principles.",
        "semesters": 1,
        "prerequisites": "(CIVL2130 or CIVL2135) and CIVL3140 and CIVL3141 and CIVL3210 and CIVL3420"
    },
    "ENGY7201": {
        "course_name": "Applied Carbon Management Methods",
        "course_code": "ENGY7201",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "This course is designed to impart a professional knowledge of skills in the measurement, reporting and verification (MRV) of carbon as it relates to carbon management. Topics include how to identify climate change related corporate risks and develop climate change strategies as part of a sustainability strategy. Corporate carbon auditing including protocols, methodologies, international standards, calculations and databases will also be examined. The course also covers how to apply these management methods and skills in different areas, including upstream and downstream policies in business supply chains, carbon inventory management, carbon accounting and corporate climate change management.",
        "semesters": 0,
        "prerequisites": ""
    },
    "SWSP7504": {
        "course_name": "Advanced Assessment Skills in Child Protection",
        "course_code": "SWSP7504",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "NOT OFFERED IN 2011.\nTo enrol in this course, students must have completed an interpersonal skills training course. Please contact the School of Social Work and Human Services for further information.\nThis course will provide students with advanced knowledge and skills in assessment and decision-making processes in child protection. The course will critically analyse contemporary approaches to assessment and develop students' skills in applying decision-making theories and processes in contexts of child welfare and child-protection practice. Consideration will be given to the comparative uses and limits of scientific, reflective, and participatory modes of assessment and decision-making. Course will only be offered if enrolments exceed 15 students.\n\nThis course will not be offered in 2010. It is unlikely to be offered in future semesters. Please contact the School of Social Work and Human Services if you require further advice.",
        "semesters": 0,
        "prerequisites": ""
    },
    "LAWS7846": {
        "course_name": "International & Comparative Trademark Law",
        "course_code": "LAWS7846",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course undertakes a comparative examination of the protection of commercial reputation by means of trademarks, including locus of reputation and parallel importation of trade-marked goods, remedies, defences and rectification proceedings, dealings in trade marks (including licensing and franchising) and international trade mark treaties and laws, passing off, Trade Practices Act 1974/Australian Consumer Law, the protection of well-known marks, and other related rights.",
        "semesters": 0,
        "prerequisites": ""
    },
    "ACCT6104": {
        "course_name": "Managerial Accounting Honours A",
        "course_code": "ACCT6104",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "The course introduces the major theoretical foundations of management accounting research, including economic (agency), psychological, and organizational (contingency) approaches, with a particular emphasis on contingency theory. A major focus of the course is the design and use of management control systems (MCS), and within this focus, the operation of performance measurement systems and budgets are considered. Management accounting research across different sectors (for example, for-profit, non-profit) is discussed, along with the implication of MCS design choices both within the firm, and in inter-firm relationships.",
        "semesters": 1,
        "prerequisites": "ACCT3104 + permission from Head of School"
    },
    "CHEE4009": {
        "course_name": "Transport Phenomena",
        "course_code": "CHEE4009",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "Various first principles encountered in various engineering areas. Examples cover momentum, heat & mass transfer demonstrating utility of first principles.",
        "semesters": 1,
        "prerequisites": "CHEE3002 and CHEE3005"
    },
    "PUBH3002": {
        "course_name": "Health Policy in Practice",
        "course_code": "PUBH3002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Public Health School",
        "description": "This course introduces students to some of the major challenges faced by the Australian health system and examines some of the policy responses that have been developed to address those challenges. The course aims to develop basic skills relevant to both the development and analysis of policy responses, with particular emphasis on the gathering, analysis and synthesis of evidence from multiple sources and perspectives.",
        "semesters": 1,
        "prerequisites": ""
    },
    "CHIN3100": {
        "course_name": "Spoken Chinese IIIA",
        "course_code": "CHIN3100",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "CHIN3100 & CHIN3110 aim to consolidate & enhance aural comprehension & oral skills in spoken Chinese on a wide range of topics covering major aspects of modern Chinese society.\nThis course may be cancelled if there are fewer than 20 enrolments.",
        "semesters": 1,
        "prerequisites": "CHIN2111 or CHIN3010"
    },
    "CIVL3350": {
        "course_name": "Structural Design",
        "course_code": "CIVL3350",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "Design projects involving design, analysis & drawing of practical structures in steel & reinforced concrete.",
        "semesters": 2,
        "prerequisites": ""
    },
    "MUSC2810": {
        "course_name": "Indigenous Australian Music: Indigenous music-making in Australia",
        "course_code": "MUSC2810",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Music School",
        "description": "This course provides students with the opportunity to learn about Indigenous Australian peoples and their music making; examine the diverse forms of Indigenous performance; and explore how Indigenous Australian performers simultaneously resist and use colonialist constructions of Aboriginal and Torres Strait Islander performance to create new and exciting forms.\n\nPlease note that this course offering may be cancelled if fewer than 10 students enrol.",
        "semesters": 2,
        "prerequisites": ""
    },
    "CHEM2003": {
        "course_name": "Food Chemistry",
        "course_code": "CHEM2003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "The chemistry associated with the structure & functions of food components & systems. Reactions & interactions of food components, particularly related to degradative processes. Introduction to the chemical analysis of foods using modern analytical chemistry techniques.",
        "semesters": 2,
        "prerequisites": "CHEM1100, CHEM1010 or CHEM1030"
    },
    "EDUC2712": {
        "course_name": "Primary Professional Experience 2",
        "course_code": "EDUC2712",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "Teaching is a multi-faceted profession. Becoming a teacher requires commitment and dedication to lifelong learning and personal growth through reflection. This course provides a further introduction to school life through workshops and 10 days of school visits. Observation of practice will be provided to enable the opportunity for personal development and growth. Furthermore, practice in the design and implementation of lessons will also be a feature of this course. Therefore the focus of this course is on the development of lesson plans with further development of observation skills and understanding the importance of communication in a school context. This course is developmental and builds on EDUC1715 and provides a basis for the subsequent courses, EDUC2714, EDUC3714 and EDUC4714. The course will also build on and incorporate knowledge developed across Years 1 and 2 of the Bachelor of Education program.\n\n",
        "semesters": 1,
        "prerequisites": "(EDUC1715 + #12 EDUC from Year 1) plus Blue Card"
    },
    "WRIT6055": {
        "course_name": "Writing Creative Non-Fiction and Memoir",
        "course_code": "WRIT6055",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "This course will provide students with the skills and knowledge necessary to research, develop and write short creative non-fiction and short memoir.",
        "semesters": 1,
        "prerequisites": ""
    },
    "SWSP1033": {
        "course_name": "Introduction to Social Work",
        "course_code": "SWSP1033",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "Introduces students to various elements of social work: purpose, values, ethics, knowledge and theory for practice and provides opportunity for students to develop analytical skills for outcome directed and critical reflective practice.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PUBH7016": {
        "course_name": "Health Systems Resourcing",
        "course_code": "PUBH7016",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Introduction to concepts in human & financial resourcing of health system. Human resource management, funding Australian health system, comparative health system resourcing, equity & ethics, evaluation of efficacy.",
        "semesters": 0,
        "prerequisites": ""
    },
    "KORN6340": {
        "course_name": "Advanced Korean Language Skills",
        "course_code": "KORN6340",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Advanced training in reading, analysing and summarising academic writing in Korean; individualised guided reading project on a research topic.",
        "semesters": 3,
        "prerequisites": ""
    },
    "PHTY4404": {
        "course_name": "Professional Practice 4",
        "course_code": "PHTY4404",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "Students will develop an ability to integrate the knowledge, physical skills, principles of evidence based practice, clinical reasoning, and ethical & professional behaviours that are necessary to function competently as a physiotherapist. Students in this course will undergo a supervised full-time physiotherapy professional practice immersion. Professional skills & reflective practice will be facilitated in order to prepare the student for challenges in health care service & delivery. Emphasis will be placed on developing student's knowledge & skills to function autonomously as primary contact health care practitioners in a range of contexts (e.g. hospital, community, ambulatory, & primary health care settings).",
        "semesters": 7,
        "prerequisites": "All Year One, Year Two and Year Three courses for the BPhty (Hons) program"
    },
    "GEOG3003": {
        "course_name": "The Global Metropolis",
        "course_code": "GEOG3003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "This course explores advanced themes and issues in urban geography, including housing, transport, spatial structure and urban form, economic development, historical formation, and land use planning. Applies a case-based approach to each respective issue in an applied context. Most case studies refer to Asia-Pacific region, which is the most significant urbanised area in the world. Takes a global and holistic perspective on the world's most significant urbanisation issues related to rapid growth, demographic change, and sustainability.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ELEC7462": {
        "course_name": "Digital Signal Processing",
        "course_code": "ELEC7462",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Advanced digital filtering: polyphase, multirate, all-pass, lattice & IIR filters. Signal conditioning, analog filter types, sigma delta converters. Fast algorithms; Cooley-Tukey FFT, mixed radix formulations, Good-Thomas algorithm. Autoregressive, moving average signals. DSP applications and programming.",
        "semesters": 2,
        "prerequisites": "ELEC7312"
    },
    "ERTH6560": {
        "course_name": "Advanced Geophysical Signal Processing",
        "course_code": "ERTH6560",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "This course is designed to follow on from the introductory course entitled 'Geophysical Signal Processing' (ERTH4120, ERTH7150). The theoretical material from that course is assumed to be prerequisite and will be required here. The course will include various elements including:\n\n- A number of assignments designed to extend concepts studied previously\n\n- Concise mini-lectures to outline assignments and introduce new concepts\n\nThe course pans one semester and is worth 2 units. In this course, assignment work is an important tool in the learning process. The course is intended for students who can operate autonomously.\n",
        "semesters": 3,
        "prerequisites": "Geophysical Signal Processing (ERTH4120 or ERTH7510)"
    },
    "POLS7302": {
        "course_name": "Politics of Development",
        "course_code": "POLS7302",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "This course focuses on the centrality of politics in development. It examines contemporary development processes in relation to historical trends, and explores the ways in which local and global contexts are increasingly interconnected in an era of globalisation. The course introduces and engages competing approaches to development, and considers the politics and political implications of everyday lived experiences of development policy. Throughout the course, we closely examine the politics of social change, and consider the legacies of historical political change and their implications for contemporary development processes and challenges.",
        "semesters": 1,
        "prerequisites": ""
    },
    "COMU2120": {
        "course_name": "Media Design",
        "course_code": "COMU2120",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "You will acquire the skills for integrated design, production and distribution of media content. The course incorporates text, audio, visual, interactive and graphic design elements.",
        "semesters": 2,
        "prerequisites": "Students enrolled in the B Communication or B Journalism pre-2017 must have completed INFS1300 + COMU1999. Students enrolled FROM 2017 must have completed COMU1130 + COMU1140 and either JOUR1112 (B Journalism students) or WRIT1200 (B Communication students)."
    },
    "FINM4413": {
        "course_name": "Advanced Corporate Finance",
        "course_code": "FINM4413",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "An advanced course in corporate finance, covering a range of topical corporate finance issues including cost of capital, corporate valuation, and corporate restructuring.",
        "semesters": 0,
        "prerequisites": "FINM3401 or 3411"
    },
    "CHEE7111": {
        "course_name": "Advanced Process and System Modelling",
        "course_code": "CHEE7111",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "(First offered 2013) This course builds on CHEE3007 Process Modelling and Dynamics and considers a range of techniques required to model complex and unfamiliar processes. It uses advanced features of commercial modelling software. Large scale experimental data from processes or experiments are used to build 'data driven' models for a range of applications. Following this, discrete and hybrid system modelling is undertaken to model industrial or experimental processes that combine time-continuous and discrete event systems. The projects are derived from current industry applications.",
        "semesters": 1,
        "prerequisites": "CHEE3007 and CHEE4009"
    },
    "STAT7017": {
        "course_name": "Mini Project B",
        "course_code": "STAT7017",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Research project report on topic in research field as recommended by supervisor and approved by Head of School.",
        "semesters": 3,
        "prerequisites": ""
    },
    "WATR7106": {
        "course_name": "Emerging Issues in the Urban Water Cycle and Public Health",
        "course_code": "WATR7106",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "In the management of the urban water cycle the environmental engineer is frequently required to address challenges that threat public health and environmental quality. This course aims to provide students with a framework for understanding emerging contaminations (e.g. antibiotic resistance genes, water born pathogens and nanoparticles) and their health effects in a broader water, health and environment nexus. Graduates will be positioned to understand the sources, occurrence, fate, and health effects of emerging contaminations in environmental settings (in particular in the water cycle). In addition to covering the basic concepts and principles of water and public health, the course will highlight various emerging challenges for public health and environmental quality, these will include: 1) antibiotic resistance genes and antibiotic resistant bacteria; 2) Legionella pneumophila in water supply systems and LegionnairesÂ¿ disease; 3) nanoparticles ecotoxicity; 4) pharmaceuticals and personal care products (PPCPs); 5) micro-plastics in environments; and 6) water contamination from firefighting foams.",
        "semesters": 0,
        "prerequisites": "CHEM1200"
    },
    "DECO7220": {
        "course_name": "Graphic Design",
        "course_code": "DECO7220",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Design practice in light of background of shifting production languages, convergent technologies & professional design contexts. Fundamental graphic applications for print technologies & principles of print, page anatomy & construction, design production literacies & requirements for application to screen design. Role of process in design & roles & responsibilities inherent in design production processes.",
        "semesters": 1,
        "prerequisites": ""
    },
    "MKTG3501": {
        "course_name": "Marketing Strategy",
        "course_code": "MKTG3501",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Critical evaluation of marketing principles through practical exercises & detailed analyses of real-life case studies.",
        "semesters": 2,
        "prerequisites": "MKTG2501"
    },
    "COMP7007": {
        "course_name": "Special Topics in Computer Science 7C",
        "course_code": "COMP7007",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "The School of ITEE will be offering a special topics course under code COMP7007 (postgraduate) during summer semester 2015/6. The course content is in the area of introductory social robotics. The course commences 30/11/2015 and finishes 6 February 2016. The course will consist of on-line materials and direct presentations, with weekly discussion sessions which must be attended in person. Assessment involves individual or small-group projects.",
        "semesters": 3,
        "prerequisites": "Permission of Head of School"
    },
    "MINE4120": {
        "course_name": "Mine Geotechnical Engineering",
        "course_code": "MINE4120",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Mech & Mine Engineering School",
        "description": "Surface Excavations - stability of slopes formed in soil & rock, stability of embankments, road design. Underground Excavations - application of rock mass classification systems & stability charts, hazard assessment, geotechnical risks, vertical development, pillar mechanics & design, excavation stability, caving geomechanics, longwall geomechanics, ground control systems & techniques, backfill design & applications, subsidence, dynamic events.",
        "semesters": 1,
        "prerequisites": ""
    },
    "DENT4070": {
        "course_name": "Advanced Dental Disciplines A",
        "course_code": "DENT4070",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "This course builds on student experience in general dental practice and the specialist dental disciplines. Students will develop their skills and competence in history taking, assessment, recognition, diagnosis, care planning and aspects of management for conditions commonly managed within the dental specialties including prosthodontics, endodontics, and orthodontics. Students will begin to acquire clinical skills and competence in multi-disciplinary care of adults with moderately complex needs. Each week students will undertake approximately 7-9 hours of clinical patient care including provision of care, dental assisting, observations and lab work, and 6 hours of competency building activities such as lectures, seminars, problem-based learning, workshops, self-directed activities, pre-clinical simulation exercises and lab work. This course assumes approximately 3 hours of self-directed learning each week.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ENGG7114": {
        "course_name": "Double Degree Exchange Studies",
        "course_code": "ENGG7114",
        "duration": "",
        "units": 0,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Eng, Archi & Info Tech Fac",
        "description": "Course to be used for enrolment by Double Degree outgoing exchange students. HECS Band 2",
        "semesters": 3,
        "prerequisites": ""
    },
    "RBUS6913": {
        "course_name": "Commerce Contemporary Research Issues",
        "course_code": "RBUS6913",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "",
        "semesters": 0,
        "prerequisites": "ECON7300 + (ECON7002 or 7011)"
    },
    "CHEE7104": {
        "course_name": "Chemical Engineering Placement A",
        "course_code": "CHEE7104",
        "duration": "One Semester",
        "units": 8,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "Please Note: this course has been replaced by ENGG7290 as of Semester 1, 2018.\nA major investigation or research project or a significant design task in industry, UQ or another university/research institute that integrates factors encountered in real life industry or research projects. This will include an assessment of the risk associated with the project including the conduct of the project. Projects must be approved prior to enrolment.",
        "semesters": 0,
        "prerequisites": "Permission of Head of School"
    },
    "LING2040": {
        "course_name": "Morphology",
        "course_code": "LING2040",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Centres around comparison of word structure in a wide variety of the world's languages.\nNOTE: Course offering may be cancelled unless a minimum of 20 students enrol.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PLAN3005": {
        "course_name": "Community Planning & Participation",
        "course_code": "PLAN3005",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "This course examines public participation and community planning and policymaking. It will be of interest to students in the planning, policy, design, and environmental management fields. The course begins by asking: why involve the public in planning and policymaking? This leads to an examination of the politics of planning, the tension between local and professional knowledge in policy-making, and the many and varied understandings of \"community\". The course then considers the co-evolution of planning and public participation in national and international contexts.",
        "semesters": 2,
        "prerequisites": ""
    },
    "INFS3208": {
        "course_name": "Cloud Computing",
        "course_code": "INFS3208",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "As a major computing infrastructure, Cloud Computing provides the modern on-demand services for management and usage of large and shared computing resources including storage, computations and communications. This course will cover in-depth knowledge for Cloud Computing and the practical experience in designing and implementing large-scale and composite business web applications on Cloud Computing platform. \n\nThis course covers a wide range of cloud computing-related X-as-a-Service technologies, including Software-as-a-Service (SaaS), Platform-as-a-Service (PaaS), Infrastructure-as-a-Service (IaaS), Data-as-a-Service (DaaS), and related technologies such as Cloud Computing Ecosystem. For delivering scalable computing services in a pay-as-you-go model via the Internet, Cloud Computing approaches are used to deal with effective and efficient development and deployment problems of web services and information systems with particular focus on \"big data\" challenges that arise across a variety of domains.",
        "semesters": 2,
        "prerequisites": "CSSE1001 and INFS1200"
    },
    "SOCY2220": {
        "course_name": "Globalisation & Development in Post-Colonial Societies",
        "course_code": "SOCY2220",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Social Science School",
        "description": "Concepts and theories of globalisation and development in specific historical contemporary and comparative contexts, within framework of different sociological approaches; survey of literature; case studies of globalisation and implications for development strategies in developing societies.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ENVM2512": {
        "course_name": "Fire Ecology & Management",
        "course_code": "ENVM2512",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "In depth knowledge and practical skills required to manage fire. Aspects of fire behaviour, fire suppression, prescribed burning, fire ecology and management planning.",
        "semesters": 2,
        "prerequisites": ""
    },
    "WRIT2020": {
        "course_name": "Grammar for Writing",
        "course_code": "WRIT2020",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Not offered in 2012\nThis is an advanced course on English grammar, using the same model of description as that in LING1000 (based on the The Cambridge Grammar of the English Language) to deal with the more complex structures that are characteristic of written language. The grammar covered will involve three categories: word, sentence and text level grammar, with a focus on these last two. A range of authentic written texts will be used to demonstrate the use of grammatical structures and their effects.\nNOTE: Course offering may be cancelled unless a minimum of 20 students enrol",
        "semesters": 0,
        "prerequisites": "LING1000 or permission of course coordinator"
    },
    "ADVT3508": {
        "course_name": "Contemporary Issues in Advertising",
        "course_code": "ADVT3508",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "ADVT3508 provides students with an in-depth and critical review of contemporary advertising research and issues. A broad overview of influential advertising theories, research and practice underpins this analysis. The course aims to equip students with the knowledge and skills needed to undertake a comprehensive review of contemporary issues that pushes the boundaries of our knowledge of the field.",
        "semesters": 1,
        "prerequisites": "ADVT2506 or 2509 or 2510 or 2511 or MKTG2506 or 3502"
    },
    "MATH3404": {
        "course_name": "Optimisation Theory",
        "course_code": "MATH3404",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Calculus of variations: critical points; Euler equations; transversality; corner conditions; Hamilton equations; Jacobi equations; Legendre sufficient condition; Weierstrass E-function. Control theory: Lagrange, Mayer & Bolza problems; Pontryagin maximal principle, legendre transformations, augmented Hamiltonians, transversality, bang-bang control, linear systems.",
        "semesters": 2,
        "prerequisites": "MATH2000 or MATH2001"
    },
    "ANTH2250": {
        "course_name": "Medical Anthropology: Local and Global Perspectives",
        "course_code": "ANTH2250",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Social Science School",
        "description": "The course is intended to introduce students to the field of medical anthropology. It explores social, cultural and political dimensions of health and illness through an examination of topics such as biomedicine, inequalities and violence, the cultural meanings of health and illness, sexuality and sexual/reproductive health, relationships between patients and healers, global health and medical humanitarianism, the health of Indigenous peoples, mental health, transcultural psychiatry and more.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ANIM3063": {
        "course_name": "Animal Welfare & Ethics",
        "course_code": "ANIM3063",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "This course will provide a basic understanding of animal welfare science, to complement animal welfare information obtained in other courses. It will enable students to appraise welfare in animal industries, in particular farms, as well as in companion and wild animal settings. It will introduce them to the key roles of behavioural and physiological analysis in welfare assessment and will expose them to hypothetical situations in which they will be required to make judgements on animal management.",
        "semesters": 2,
        "prerequisites": ""
    },
    "OCTY2209": {
        "course_name": "Psychosocial Aspects of Occupational Therapy Practice",
        "course_code": "OCTY2209",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "This course builds on the psychiatric & mental health foundations provided in OCTY2105. Content addresses information gathering & service delivery processes in psychosocial fields of adult occupational therapy, including: mental health, physical health, ageing & intellectual disability. A specific focus is on understanding the impact of psychological, social, emotional, & behavioural factors on the individual experience of a diversity of physical & mental health conditions.",
        "semesters": 2,
        "prerequisites": "OCTY2103, OCTY2105"
    },
    "ECON1902D": {
        "course_name": "Macroeconomics",
        "course_code": "ECON1902D",
        "duration": "One Trimester",
        "units": 2,
        "faculty": "UQ College",
        "school": "Business, Economics & Law Fac",
        "description": "This course examines how the Australian economy functions and its interaction with international economy. Students will also study GDP, unemployment and inflation, interest rates, investment, government expenditure, and taxation policies and balance of payments. Alternative macroeconomic theories and models are also examined.",
        "semesters": 40,
        "prerequisites": ""
    },
    "LAWS1701": {
        "course_name": "Law of Contract I: Principles of Contractual Agreement",
        "course_code": "LAWS1701",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course examines the nature of, and elements giving rise to, contractual agreement, that is, how parties may assume enforceable contractual obligations towards each other and how to ascertain the content and meaning of those obligations.",
        "semesters": 1,
        "prerequisites": ""
    },
    "LAWS7113": {
        "course_name": "Civil Procedure",
        "course_code": "LAWS7113",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "An analysis of the common law system of adversarial adjudication, including State and Federal civil court jurisdiction, costs of litigation, service of process, the role of the court in managing civil litigation, defining the questions for trial, obtaining evidence, pre-trial disclosure, disposition without trial, settling litigation, judgment and enforcing judgment, and appeals.",
        "semesters": 0,
        "prerequisites": "At least #16 of LAWS courses"
    },
    "LAWS5019": {
        "course_name": "Law of Insolvency",
        "course_code": "LAWS5019",
        "duration": "One Semester",
        "units": 1,
        "faculty": "",
        "school": "",
        "description": "NOT 2009. Involves the study of bankruptcy law, company credit and security arrangements, winding up of companies.",
        "semesters": 0,
        "prerequisites": "LAWS5017"
    },
    "COMS7201": {
        "course_name": "Computer Networks I",
        "course_code": "COMS7201",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "OSI & Internet reference models. Communication protocols for Local, Metropolitan & Wide Area Networks. BISDN networks.The Internet protocol suite. Mobile Networks. Network security. Trends in communication networks. Quality of service in communication protocols.",
        "semesters": 1,
        "prerequisites": "COMP7306 OR CSSE7231"
    },
    "SWSP7044": {
        "course_name": "Lifespan, Culture and Disability",
        "course_code": "SWSP7044",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course covers theories and models of relating to human development over the complete span of life from conception of old age. It examines the application of this knowledge to social work practice with a particular focus on children and young people, disability and ageing. The course considers the effects of cultural diversity and adversity on people throughout their lifespan.",
        "semesters": 1,
        "prerequisites": ""
    },
    "DRAM2025": {
        "course_name": "Major Movements in European Theatre (1500-1800)",
        "course_code": "DRAM2025",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "This course will consider the development of drama from the scripted Medieval plays, through the Elizabethan and\nSpanish Golden Ages, to neoclassicism and the Sturm and Drang movement. The course covers examples of\ntheatre from Portugal, England, Spain, France, and Germany, and is particularly interested in the role of witchcraft,\nmagic, and the supernatural in the historical European theatrical tradition (",
        "semesters": 0,
        "prerequisites": "DRAM1010"
    },
    "ECON3540": {
        "course_name": "Evolution of Economic Systems",
        "course_code": "ECON3540",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "Analysis of how complex systems develop using contributions from behavioural, evolutionary and institutional economics with an emphasis on the role institutions, coordination problems, knowledge issues and cognitive aspects, illustrated with country-based case material.",
        "semesters": 1,
        "prerequisites": "ECON1010"
    },
    "PHIL7213": {
        "course_name": "The Nature of Moral Values",
        "course_code": "PHIL7213",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "Historical & Philosophical Inq",
        "description": "NOT OFFERED IN 2011\nIn this course we explore the nature of moral values through an examination of key texts in the history of philosophy and through contemporary readings.",
        "semesters": 0,
        "prerequisites": ""
    },
    "ENGL2070": {
        "course_name": "21st Century World Literatures",
        "course_code": "ENGL2070",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "What is distinctive about post-millennial British and American fictions? This course will suggest it is the commitment to a world in crisis often demarcated by the 2001 attacks on New York's Twin Towers, and their legacy of war, terrorism, and counter-terrorism. The novels we will read address this cataclysm, along with other equally urgent issues from climate change to neo-liberalism and the growing schism between extreme wealth and extreme poverty, to the sociopolitical dynamics surrounding identity, national and gendered, and alterity. Each of the novels we will explore uses the art form in which it is embedded to engage with the past and the present in order to imagine into existence, against overwhelming odds, an ethical future.\n\nNOTE: Course offering may be cancelled unless a minimum of 20 students enrol.",
        "semesters": 1,
        "prerequisites": "#2 ENGL"
    },
    "FOOD4612": {
        "course_name": "Research Project",
        "course_code": "FOOD4612",
        "duration": "Two Semesters",
        "units": 4,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Students commencing in sem 1 must enrol in FOOD4611 for both semesters. Students commencing in sem 2 must enrol in FOOD4612.",
        "semesters": 2,
        "prerequisites": ""
    },
    "EDUC7031": {
        "course_name": "TESOL Curriculum & Pedagogy: Classroom Strategies",
        "course_code": "EDUC7031",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "This course provides tools and critical perspectives for the analysis, development and use of curriculum materials in second language classrooms. It provides students with an overview of dominant and emergent approaches to the teaching of TESOL, hands-on review of instructional materials, and classroom instructional techniques and strategies.\n\nThis course may not be offered if the enrolment is less than 10 students.",
        "semesters": 2,
        "prerequisites": ""
    },
    "AGRC1016": {
        "course_name": "Food & Fibre in the E-Landscape",
        "course_code": "AGRC1016",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "An introduction to the electronically enabled food and fibre sector. The concept of the e-landscape and the associated major technologies used through the supply chain of various agri-industries from on-farm (eg precision farming, the NLIS, waste water management) to the end customer (eg product traceability systems, cold chain technologies, and social media). Current agri-industry examples will be used throughout. Students are expected to attend lectures, spend approximately 2hrs per week online and 6hrs of self study. Course content is provided through lectures, reading materials posted on the Course Blackboard site and via in-class and online Discussions.",
        "semesters": 2,
        "prerequisites": ""
    }
}