{
    "INDH3104": {
        "course_name": "Nutrition & Health in Aboriginal & Torres Strait Islander Communities",
        "course_code": "INDH3104",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "The course aims to introduce students to the principles and practice of nutrition, to promote health through good nutrition and equip students to be able to support nutrition improvement among Indigenous Australians. There are three topic areas covered in this course: basic nutrition, food and nutrition in Indigenous Australia and promoting healthy nutrition in Indigenous Australia.",
        "semesters": 0,
        "prerequisites": "Nil"
    },
    "PHYS7745": {
        "course_name": "Extended Research Project",
        "course_code": "PHYS7745",
        "duration": "One Semester",
        "units": 8,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "This course provides an introduction to research in physics. Students choose a topic and a supervisor, and submit a written report by the end of semester. Students commencing in sem 1 enrol in PHYS7743 for sem 1 and sem 2; students commencing in sem 2 enrol in PHYS7744 for sem 2 and the following sem 1. Students completing in single semester enrol in PHYS7745.",
        "semesters": 3,
        "prerequisites": "Permission of Head of School"
    },
    "VETS5117": {
        "course_name": "Research Veterinary Elective",
        "course_code": "VETS5117",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "Implementation and presentation of a research project in an area of veterinary science, with emphasis on defining the research issue, undertaking research techniques, undertaking appropriate analysis of data and drawing defensible conclusions.",
        "semesters": 2,
        "prerequisites": ""
    },
    "BIOT7009": {
        "course_name": "Emerging Biotechnologies",
        "course_code": "BIOT7009",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences, Agriculture Food Sciences Schl",
        "description": "Advanced study of the basic science underpinning new biotechnologies. Modules will include diagnostics, next generation genome sequencing, RNAi, biofuels, stem cells and gene therapy.",
        "semesters": 0,
        "prerequisites": ""
    },
    "ECON7380": {
        "course_name": "Advanced Macroeconometrics",
        "course_code": "ECON7380",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "This course surveys the econometric theory which underlies modern applied research on macroeconomic issues, as well as some of the literature that has applied this theory. The main objectives are to give students a background that enables them to understand and critically appraise applied work on macroeconomic issues, and to provide them with some practical experience in working with macroeconomic data. The course covers a number of applications so that the students become aware of actual problems that macroeconomists address prior to moving to the approaches taken. Topics covered includet he specification and estimation of the Phillips Curve; the specification and estimation of Reaction Functions; applications of VAR (e.g., NKPC) including identification by sign restrictions, long-run restrictions, and translating theory to the econometric specification; state space modelling including alternative approaches to estimation and inference;TVP-VARs applications and Specification and estimation of the Dynamic Stochastic Equilibrium Model (DSGE).",
        "semesters": 2,
        "prerequisites": "ECON3350 or ECON7350"
    },
    "COMS4105": {
        "course_name": "Communication Systems",
        "course_code": "COMS4105",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Communications receivers & transmitters, modulation & demodulation, baseband & narrowband signal characteristics, analogue & digital communication systems, information theory, source & channel coding.",
        "semesters": 2,
        "prerequisites": "CSSE3010 and ELEC3004"
    },
    "ACCT3102": {
        "course_name": "External Reporting Issues",
        "course_code": "ACCT3102",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Role of accounting information in financial contracts, accounting for shareholders' equity, revenue, expense, assets & liabilities, with applications to leases, extractive industries, income tax.",
        "semesters": 3,
        "prerequisites": "ACCT1110 or 2101 or 2112"
    },
    "BIOL6502": {
        "course_name": "BSc(Hons) Research in Biological Sciences",
        "course_code": "BIOL6502",
        "duration": "Two Semesters",
        "units": 14,
        "faculty": "Science",
        "school": "Biological Sciences School",
        "description": "In the School of Biological Sciences BSc Honours program you will undertake your own research project in a setting of academic excellence in biological research. The program challenges you to make the transition from undergraduate student with set course of study to a postgraduate student actively involved in research and associated activities. During the Honours year you will develop and demonstrate your capabilities for critical thought and independent research within an area of biology. You will learn how to conceive, design, carry out and communicate science. This course includes a research proposal, proposal seminar, research project, final seminar and seminar diaries.",
        "semesters": 2,
        "prerequisites": ""
    },
    "VETS5124": {
        "course_name": "Rural Veterinary Practice - Livestock Medicine",
        "course_code": "VETS5124",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "Students develop their clinical skills in rural veterinary practice, with an emphasis on livestock medicine, through participation in the clinical activities of the School's clinical facilities. There is a focus on both individual animal and flock/herd health.",
        "semesters": 0,
        "prerequisites": ""
    },
    "ANAT6001": {
        "course_name": "Systematic Anatomy",
        "course_code": "ANAT6001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Biomedical Sciences School",
        "description": "This course is offered in intensive mode. Available to any students requiring background in gross anatomy, particularly intending MOccThySt students. Gross Anatomical Structure of the human body will be covered. There will be an emphasis on neuromusculoskeletal systems relevant to occupational therapy.",
        "semesters": 0,
        "prerequisites": ""
    },
    "AUDL7824": {
        "course_name": "Clinical Practice III & Professional Issues",
        "course_code": "AUDL7824",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "Clinical practice in audiology in a range of settings and professional and ethical issues associated with such practice.",
        "semesters": 1,
        "prerequisites": "AUDL7803, AUDL7806, AUDL7823"
    },
    "SWSP2077": {
        "course_name": "Direct Practice 1",
        "course_code": "SWSP2077",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "Social work practice is understood in relation to a number of methods. Students will be taught, and are expected to demonstrate, competence in basic communication skills and two methods of social work practice with individuals.",
        "semesters": 1,
        "prerequisites": ""
    },
    "POLS3206": {
        "course_name": "Policy Challenges of Asia-Pacific Security",
        "course_code": "POLS3206",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "The course considers the main security challenges in the Asia-Pacific - military & non-traditional - focusing on major debates over policy responses to them. The Asia-Pacific is the world's most economically dynamic region. It is also one of the world's worst hot-spots for a host of security problems: the rise of China is challenging American primacy in the Asia-Pacific, a key fixture since the end of World War II; on the Korean Peninsula, the threat of nuclear war is very real; and the region's rapacious and rapid economic development has generated or exacerbated a wide range of non-traditional security problems, such as pandemics, climate change and environmental degradation. This course considers the main security challenges in the Asia-Pacific - both military and non-traditional - focusing on major debates over policy responses to them. It seeks to equip students with the capacities to analyse security problems in the region and provide relevant policy advice.",
        "semesters": 1,
        "prerequisites": ""
    },
    "IENV6802": {
        "course_name": "Information Environments Thesis",
        "course_code": "IENV6802",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "",
        "school": "",
        "description": "(not offered in 2008) Research dissertation on issues in information environments. Specific topics decided in consultation with a supervisor. Topics may cover historical & prospective design & use of information environments, as well as functional, social, aesthetic, & technical issues. Students commencing in semester 1 enrol in IENV6801 for sem 1 and sem 2, students commencing in semester 2 enrol in IENV6802 for sem 2 and the following sem 1.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MGTS7301": {
        "course_name": "Tools and Techniques for Business Analysis",
        "course_code": "MGTS7301",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course introduces students to the different types of information that managers and other decision-makers gather, and the tools used to analyse that information for effective business decisions. It provides an overview of the extensive range of strategic and operational frameworks drawn from fields such as strategic management, financial management, marketing, human resource management, supply chain management and international business. The purpose of this comprehensive toolkit course is not only to provide students with a wide range of the necessary business analytical tools, but also to integrate these tools into a more complete and meaningful package that can be used as a portable toolkit for ensuing courses, and across their post-study career. To do this, this course follows a problem based approach, where an understanding of the decision-making frameworks is gained through its application to practical problems. Three themes per semester will be investigated in groups, using the multiple lenses that tools such as Business Model Canvas, Balanced Scorecards, Career Mapping, SOAR, PESTEL, Market Analysis, Porter's Five Forces, Financial Forecasting, Bell-Mason Diagnostic, Prior Art Searches, Scenario Planning, Technology Analysis, SWOT, Strategy Diamond, Seven Tools of Project Management, Business Plans, Root Cause Analysis, MInto Pyramid, and HR Audits provide. This will provide students with insights into both the nature of the business problems as well as methods that are used for identifying and evaluating alternative solutions.",
        "semesters": 3,
        "prerequisites": ""
    },
    "CHIN2200": {
        "course_name": "Written Chinese IB",
        "course_code": "CHIN2200",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Continuation of CHIN1200.\nThis course may be cancelled if there are fewer than 20 enrolments.",
        "semesters": 2,
        "prerequisites": "CHIN1200"
    },
    "VETS5017": {
        "course_name": "Research Veterinary Elective",
        "course_code": "VETS5017",
        "duration": "Two Semesters",
        "units": 2,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "Implementation and presentation of a research project in an area of veterinary science, with emphasis on defining the research issue, undertaking research techniques, undertaking appropriate analysis of data and drawing defensible conclusions, writing up results in a format suitable for submission for publication, and presentation as an oral abstract.",
        "semesters": 1,
        "prerequisites": "VETS4010, VETS4022, VETS4035, VETS4034, VETS4012, VETS4021"
    },
    "ECON2500": {
        "course_name": "China: Emergence, Implications & Challenges",
        "course_code": "ECON2500",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "After a long period of relative decline, China's economy is once again on the ascendency. China has already taken over from Japan as the engine of growth in an increasingly prosperous East Asian region. China's economic emergence has far-reaching implications and presents immense challenges both within China and abroad. By covering the nature of China's emergence and the consequent implications and challenges, this course provides students with a thorough understanding of China's contemporary economy.",
        "semesters": 1,
        "prerequisites": "ECON1010 + ECON1020"
    },
    "MUSC3211": {
        "course_name": "Practical Studies 3",
        "course_code": "MUSC3211",
        "duration": "Two Semesters",
        "units": 4,
        "faculty": "Humanities and Social Sciences",
        "school": "Music School",
        "description": "Development of advanced instrumental or vocal technique & of high level stylistic & interpretative skills. Includes required ensemble participation & concert attendance.",
        "semesters": 1,
        "prerequisites": "Grade of 6 or higher in MUSC2201 or permission of Head of School"
    },
    "BISM2202": {
        "course_name": "Data Analytics and Information Management",
        "course_code": "BISM2202",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Data & information as organisational resources. Management of data, information & knowledge; data integrity & quality issues; data warehousing, data mining and business intelligence. Management issues of security, security, privacy, ethics for information & knowledge resources.",
        "semesters": 2,
        "prerequisites": "BISM2207"
    },
    "DENT1011": {
        "course_name": "Foundations of Dental Practice",
        "course_code": "DENT1011",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "Introduction to pre-clinical skills required in dental practice. Preclinical exercises to develop basic skills. Introduction to range of dental materials & techniques & their use in dental practice. Appreciation & application of safe working practices in the clinical setting.",
        "semesters": 0,
        "prerequisites": "ORAL1010 + ORAL1020 + ORAL1030"
    },
    "IMED7001": {
        "course_name": "Core Knowledge & Professional Practice",
        "course_code": "IMED7001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Medicine Faculty",
        "description": "This course covers the core principles of skin cancer medicine and surgery. Key content areas include: the normal anatomy, embryology and physiology of the skin, the biology and pathology of skin cancer as well as both dermatopathology and dermatology relevant to skin cancer management. Risk factors for the development of skin cancer and associated conditions are dealt with, along with their relevance in principles of skin cancer prevention. Skin cancer incidence and mortality are explored in both the Australasian and global context.",
        "semesters": 3,
        "prerequisites": ""
    },
    "NURS7010": {
        "course_name": "Emergency Care in Rural & Remote Areas",
        "course_code": "NURS7010",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course aims to assist students develop a comprehensive knowledge of emergency care principles and practices in order to respond safely and effectively to individuals requiring emergency care. This knowledge will be underpinned by critical analysis of safety principles and effective methods of patient care. All students in the Rural and Remote strand will complete this course to gain a foundational knowledge for their specialist area of practice. It will cover the areas of: mechanism of injury; treatment of specific medical conditions; planning and preparing patients for transportation and legal boundaries for Nurse Practitioners in emergency situations. Teaching materials are presented as interactive web-based exercises with independent work-book related activities and readings.",
        "semesters": 0,
        "prerequisites": "NURS7001, NURS7002 and NURS7003"
    },
    "JOUR6002": {
        "course_name": "Research Design in Journalism and Communication",
        "course_code": "JOUR6002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "The course is about the process of undertaking and completing research including developing research ideas and projects in journalism and communication research traditions. Through guidance from supervisors and independent study, the course allows students to examine the goals of research, how to conceptualise and formulate researchable ideas, develop a research proposal, conduct a study and report the outcomes of their research. As part of this course students will devise a focused reading program relevant to their research project, lead discussions in designing a journalism and communication research project and develop specialised knowledge and skills that might be applied to proposed or on-going research.",
        "semesters": 0,
        "prerequisites": ""
    },
    "TOUR7032": {
        "course_name": "Marketing & Distribution Research Project",
        "course_code": "TOUR7032",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course develops the skills needed to plan and manage marketing and sales in the tourism, hospitality and event industries. Topics covered include marketing communications, electronic marketing, social media, market analysis, relationship marketing, sales techniques, distribution channels, experiential marketing, business to business marketing and integrated destination marketing and branding.",
        "semesters": 7,
        "prerequisites": ""
    },
    "ELEC3401": {
        "course_name": "Medical & Industrial Instrumentation",
        "course_code": "ELEC3401",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "[Not offered from 2012 - replaced by ELEC4403] Measurement of biological signals from transducers, signal conditioning, display & analysis. Practical work based on design, construction & validation of simple clinical measurement devices. Field trips to clinical measurement laboratories.",
        "semesters": 0,
        "prerequisites": "ELEC3400"
    },
    "ECHO7004": {
        "course_name": "Echocardiography: Care of the critically ill",
        "course_code": "ECHO7004",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Medicine Faculty",
        "description": "This course will build upon the general echocardiographic skills acquired previously and will direct the student to apply these specifically in their assessment of the critically ill patient. Cardiorespiratory interactions and mechanical ventilation will be considered along with performing haemodynamic measurements and the assessment of volume status. Scenarios commonly encountered while caring for the critically ill will be considered in detail such as the assessment of a patient with hypotension or hypoxaemia. The assessment of commonly encountered cardiac devices will be covered. The use of extracardiac ultrasound will be explored including its use to facilitate vascular access. The general issues involved in providing an echocardiology service will be explored including quality assurance.",
        "semesters": 3,
        "prerequisites": "ECHO7001, ECHO7002, ECHO7003"
    },
    "ERTH4220": {
        "course_name": "Exploration Seismology",
        "course_code": "ERTH4220",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Elastic wave equation & solution. Land & marine acquisition techniques & instrumentation. Seismic reflection processing methodology.",
        "semesters": 1,
        "prerequisites": "MATH2000, MATH2100 and ERTH3021"
    },
    "COMP7703": {
        "course_name": "Machine Learning",
        "course_code": "COMP7703",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Machine learning is a branch of artificial intelligence concerned with the development & application of adaptive algorithms that use example data or previous experience to solve a given problem. Topics include: \nlearning problems (e.g regression, classification, unsupervised,\nreinforcement) & theory, neural networks, statistical & probabilistic models, clustering, ensembles, implementation issues, applications (e.g. bioinformatics, cognitive science, forecasting, robotics, signal & image processing).",
        "semesters": 1,
        "prerequisites": "CSSE7030 and MATH7501 and STAT7203"
    },
    "LEIS2000": {
        "course_name": "Recreation Participation & Practice",
        "course_code": "LEIS2000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Theories & models of recreation in society; practical aspects of visitor services planning & delivery in public & private sectors; introduction to recreation research methods with an emphasis on service quality from a consumer perspective.",
        "semesters": 0,
        "prerequisites": ""
    },
    "INFS7204": {
        "course_name": "Service-Oriented Architectures",
        "course_code": "INFS7204",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "In-depth knowledge for SOA and the practical experience in designing and implementing large-scale and composite business web applications. This course covers a wide range of SOA-related technologies, including .Net, web service, composition techniques, and related technologies such as workflow, semantic web, ontology.",
        "semesters": 0,
        "prerequisites": "CSSE7030 and INFS7900"
    },
    "EIBS7300": {
        "course_name": "Creativity for Innovation and Design Thinking",
        "course_code": "EIBS7300",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Innovation matters to everyone, including managers in small or large organisations, start-up entrepreneurs, those in government roles, or teachers. This course looks at how individuals and organisations use creativity and design thinking skills to identify and choose opportunities that enable innovation. Creative problem solving skills are developed and enhanced through a range of real world activities. An overview of design thinking tools is provided to help students understand design thinking as a problem solving approach. Ideas developed through these processes are then applied to a customer discovery approach to understand their value in the market place.",
        "semesters": 1,
        "prerequisites": ""
    },
    "WRIT7045": {
        "course_name": "Individual Project",
        "course_code": "WRIT7045",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "Students will choose an individual project, in consultation with the course coordinator, that relates to Writing, Editing, and Publishing. The project can be a traditional scholarly project, creative practice as research, a work-integrated learning project, or some other innovative project as approved by the course coordinator. There is no prescribed syllabus or formal teaching.",
        "semesters": 7,
        "prerequisites": ""
    },
    "ENVM3405": {
        "course_name": "Managing Post-Mining Landscapes: Land Rehabilitation in the Mining Industry",
        "course_code": "ENVM3405",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Mining and processing of mineral ores and energy resources has significant impacts on both mine sites and operational refinery and processing lands. This course will examine the major land and water impacts of mining and refining activities, and introduce land rehabilitation concepts specific to the management of sites impacted by mining and refining activities. Lectures will be supported by laboratory work to give hands-on analytical experience.",
        "semesters": 0,
        "prerequisites": ""
    },
    "HLTH7204": {
        "course_name": "Education in Clinical Nursing & Midwifery",
        "course_code": "HLTH7204",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "Clinical teaching and learning skills are integral components of professional nursing and midwifery practice. However the context and the nature of the clinical teaching experience requires different approaches which will be influenced by the learning needs of the individual consumer, colleague or student. This core course will prepare nurses and midwives for educational leadership roles within their own specified area of practice; enable them to educate, support and develop their colleagues; provide health education to their clients and support beginning practitioners entering their profession. This course may not be offered internally if the enrolment is less than 8 students.",
        "semesters": 1,
        "prerequisites": ""
    },
    "HIST2404": {
        "course_name": "Imperial Britain: Society & Culture in the Age of Empire (1780-1880)",
        "course_code": "HIST2404",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "This course explores the rise of Great Britain to global prominence from the mid-eighteenth century through key developments in British society and culture. Between 1780 and 1880, an economy in explosive growth fuelled new forms of wealth, dislocation and innovation. Modern problems of industry, political reform, social order and inequality, urban expansion and mass culture were faced for the first time. Using historical accounts and the work of writers and artists, we explore major themes such as the impact of industrialism, empire, social change and political unrest.",
        "semesters": 0,
        "prerequisites": ""
    },
    "TIMS7330": {
        "course_name": "Startup Entrepreneurship In Practice",
        "course_code": "TIMS7330",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course is a sequel to Principles of Entrepreneurship and is designed for students wishing to pursue a career within the startup ecosystem. \n\nStudents will be exposed to the different roles and career paths within the startup ecosystem through engagement with startups and their supporters such as mentors, community managers, investors and policy makers. \n\nTheoretically the course is framed using theory on legitimacy, uncertainty and the entrepreneurship process to provide a foundation for understanding the different roles and practices in startup ecosystem.\n\nStudents will be challenged to put their knowledge and skills into action through their engagement with startups where they will be exposed to the challenges of bringing innovative and novel products and services to market.\n\nThe course advances entrepreneurship students' knowledge of entrepreneurship by building their ability to understand the startup process and broader ecosystem in which startups are embedded.",
        "semesters": 2,
        "prerequisites": "TIMS7301"
    },
    "NURS2002": {
        "course_name": "Immunological Health",
        "course_code": "NURS2002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "Students will learn issues associated with the nursing management of persons with breast cancer, relevant pharmacology treatment & strategies to assist individuals & families cope with change, loss & grief and terminal illness. The problem will introduce students to significant social issues & a range of measures in developing a pain management plan & complex wound management. Health education for individuals & health promotion strategies [including screening] for communities to prevent a range of cancers are discussed.",
        "semesters": 1,
        "prerequisites": ""
    },
    "POLS3115": {
        "course_name": "Environmental Politics & Policy",
        "course_code": "POLS3115",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "This course was previously offered as the Level 2 POLS2115. Please note: the course Levels are not interchangeable - if the course is completed as a Level 2 it cannot be credited as a Level 3.\nThis course explores contemporary challenges in environmental politics and policy, and probes responses to these, using a range of methods and approaches. We will work collaboratively on developing in-depth analyses of prominent contemporary concerns, from climate change through biodiversity issues to contestations over extractive industries, and questions of sustainable development. The course will be run in the format of weekly two-hour workshops, comprising short introductory `mini-lecturesÂ¿ (15-20 minutes), in-class research sessions, task-based group work, and plenary conclusions. Our focus is on combining advanced learning about cutting-edge theories and methods in political analysis with producing substantive analyses of policy and political problems and challenges based on extensively researched case-examples. The latter will cover local, national, international, and transnational instances.\nPlease note that this course, due to its adopted format, will not have lectures recorded and requires a commitment to attending weekly classes.",
        "semesters": 1,
        "prerequisites": ""
    },
    "LAWS5156": {
        "course_name": "International Humanitarian & Criminal Law",
        "course_code": "LAWS5156",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "The course begins by considering the key rules and principles of international law regulating the conduct of armed conflict, focusing on the four Geneva Conventions of 1949 and their two Additional Protocols of 1977. It then examines the central principles and procedures of international criminal law, as developed and applied by bodies such as the International Criminal Court.",
        "semesters": 0,
        "prerequisites": "All Level 1 LAWS courses"
    },
    "ANIM3044": {
        "course_name": "Pig & Poultry Science",
        "course_code": "ANIM3044",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Advanced concepts and practices used in the sustainable management of pig and poultry enterprises.",
        "semesters": 0,
        "prerequisites": ""
    },
    "CHEE2010": {
        "course_name": "Engineering Investigation & Statistical Analysis",
        "course_code": "CHEE2010",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School, Mathematics & Physics School",
        "description": "Project based investigation of engineering operations. Effective quantitative sampling & statistical analysis including hypothesis testing, standard probability models, estimation, regression & experimental design. Technical reporting & project management skills",
        "semesters": 2,
        "prerequisites": "CHEE2001"
    },
    "CHEM3011": {
        "course_name": "Advanced Physical Chemistry",
        "course_code": "CHEM3011",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "description": "This course is an introduction to concepts, theories & methods in modern physical chemistry & elements of computational molecular science. It will include molecular quantum mechanics, electronic structure, molecular dynamics, biomolecular & materials simulations, spectroscopy & statistical thermodynamics.",
        "semesters": 2,
        "prerequisites": "CHEM2056 or CHEM2002 or CHEM2902 or (PHYS2020 + PHYS2041)"
    },
    "TRFCR1008": null,
    "PSYC7444": {
        "course_name": "Applied Decision Making",
        "course_code": "PSYC7444",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "NOT OFFERED IN 2014.\nReview of basic approaches to understanding decision-making and application to assist decision-making of professionals. Topics include uncertainty in decision-making, rationality, heuristics and biases, modelling and aiding decision-making. Strong practical component using computerised decision aids.",
        "semesters": 0,
        "prerequisites": ""
    },
    "LTCS7000": {
        "course_name": "Thesis",
        "course_code": "LTCS7000",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "",
        "school": "",
        "description": "Not 2007. Dissertation on a topic chosen by the student in consultation with supervisor.",
        "semesters": 0,
        "prerequisites": ""
    },
    "BIOL3310": {
        "course_name": "Macroecology and Biogeography",
        "course_code": "BIOL3310",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Biological Sciences School",
        "description": "Biological diversity has puzzled and fascinated evolutionary biologists and ecologists for well over a century. In this course we will explore evolutionary and ecological theories of diversity, while learning core methods for studying patterns of diversity from a variety of angles. Questions we will explore in this course include: Why are species found in some locations and not others? Are the geographic distributions of communities, higher order taxa, species, and alleles predictable by geography, environment, historical contingencies or interactions with other species, or inherent characteristics of species?\nMacroecology and biogeography are the study of spatial and temporal distributions of organisms, drawing upon the complementary disciplines of ecology and evolutionary biology. In this course, students will consider spatial patterns of biodiversity from global to local scales and considering both terrestrial and marine examples. Students will gain experience using approaches from comparative phylogenetics, community ecology, and landscape genetics to infer underlying causes of extant distributions and project future distributions in a changing world. Weekly learning activities will emphasize student participation, with discussions based on readings from the primary literature and problem solving using state-of-the-field computing. Enrolling students are expected to have basic familiarity with R (and have completed Biostatistics,BIOL2006) and to have completed second Ecology (BIOL2010) or Evolution (BIOL2201).",
        "semesters": 1,
        "prerequisites": "BIOL2006 or BIOL2106"
    },
    "PUBH7110": {
        "course_name": "Directed Studies in Population Health A",
        "course_code": "PUBH7110",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Public Health School",
        "description": "Description: A directed study is a project determined and developed by the individual student, with prior approval of the Program Coordinator. Supervision and assessment is by a member of staff. The student may be asked to attend a seminar program.",
        "semesters": 3,
        "prerequisites": ""
    },
    "MGTS7303": {
        "course_name": "Principles of Strategic Management",
        "course_code": "MGTS7303",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course investigates the concepts & techniques of strategic analysis & implementation at the business & corporate levels. Specific concepts examined include industry & environment analysis; business strategy analysis, organisation performance analysis; capabilities analysis; gap analysis; business & corporate strategic options; strategic decision making; implementation; corporate strategic analysis; mergers & acqisitions; & strategic alliances.",
        "semesters": 3,
        "prerequisites": "IBUS7302 or TIMS7301 or TIMS7317. Pre-requisites do not apply to MPsychBus students."
    },
    "ERTH7611": {
        "course_name": "Advanced Field Geology",
        "course_code": "ERTH7611",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Advanced geological mapping in Mount Isa (two weeks), followed by a map compilation, geometrical analysis and tectonic analysis. Students will learn field techniques in metamorphic and igneous rocks, and will conduct a regional synthesis of field data. The fieldwork will be carried out during the July inter-semester break.",
        "semesters": 2,
        "prerequisites": "Structural geology, sedimentology, igneous and metamorphic petrology, basic field geology."
    },
    "AGRC2001": {
        "course_name": "Agricultural Biochemistry",
        "course_code": "AGRC2001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "The role of animals, plants & microbes in agriculture & the environment from a knowledge of metabolism & biochemical pathways.",
        "semesters": 1,
        "prerequisites": "CHEM1100 or CHEM1004; AGRC1020; AGRC1021"
    },
    "VETS2011": {
        "course_name": "Structure and Function I",
        "course_code": "VETS2011",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "Anatomy & physiology of cardiovascular, respiratory, lymphatic & nervous systems of production & other animals; pain & behaviour neurobiology.",
        "semesters": 1,
        "prerequisites": "AGRC1041"
    },
    "MOLI7107": {
        "course_name": "MR-PET Hardware and Software Integration",
        "course_code": "MOLI7107",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "This course will cover MR-PET instruments used for clinical applications. Consideration will be given to the physical structure of magnet, gradients and RF coils, as well as PET ring construction and integration into a combined MR-PET system.\n \nCalibration and general workflow considerations will be introduced to enable simultaneous acquisition of MRI and PET images.",
        "semesters": 3,
        "prerequisites": ""
    },
    "DENT1030": {
        "course_name": "Foundations of Oral Rehabilitation",
        "course_code": "DENT1030",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "Introduction to principles of Oral Rehabilitation, associations between structure & function in the jaws, teeth & associated structures. Development of manual skills & introduction to practical laboratory procedures which simulate clinical tasks or build fine motor skills in handling dental materials in clinically relevant ways. Provides foundation knowledge for later courses in Oral Rehabilitation stream.",
        "semesters": 0,
        "prerequisites": "ORAL1010 + 1020 + 1030"
    },
    "SCIE3270": {
        "course_name": "Introduction to Research in Agriculture and Food Science (A)",
        "course_code": "SCIE3270",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Students should have adequate background in the area of their topic as assessed by the project supervisor and course co-ordinator. Students are recommended to have completed #4 of level 3 courses.",
        "semesters": 3,
        "prerequisites": ""
    },
    "PSYC7011": {
        "course_name": "Clinical Psychology Dissertation Part A",
        "course_code": "PSYC7011",
        "duration": "Two Semesters",
        "units": 6,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "Develops skills in research design, implementation and reporting for students completing postgraduate coursework degrees. Topic must be approved by Director of MPsychClin program and may be field or laboratory based. Students enrol in PSYC7011 for 2 semesters, Part A in their first semester and Part B for the final semester.",
        "semesters": 3,
        "prerequisites": ""
    },
    "PUBT6020": {
        "course_name": "Public Transport Planning",
        "course_code": "PUBT6020",
        "duration": "One Semester",
        "units": 1,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "(course runs for 3 days intensive - total 20 hours)\nThis course aims to enable students to apply leading practice principles for an integrated approach to public transport planning. This course covers strategy and planning, stakeholder and community engagement, developing options, resourcing programs, policy and regulatory framework, policy options, organisations and institutions and delivery.",
        "semesters": 1,
        "prerequisites": ""
    },
    "TRFCR1018": null,
    "HOSP2003": {
        "course_name": "Entrepreneurship in Hospitality",
        "course_code": "HOSP2003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course develops an understanding of small business management and operations in the context of the hospitality industry. It assists in the development of deep understanding and appreciation of the principles and practice of small business enterprises.",
        "semesters": 1,
        "prerequisites": ""
    },
    "SCIE3221": {
        "course_name": "Biomedical Science Research Project",
        "course_code": "SCIE3221",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Biomedical Sciences School",
        "description": "This course will present students with the opportunity to undertake an undergraduate research project in the field of biomedical science, under the supervision of a researcher. The research project will be carried out over 6 to 8 weeks in the summer semester.",
        "semesters": 6,
        "prerequisites": "Completion of #24 units"
    },
    "HRSS7808": {
        "course_name": "Advanced Research Processes in Health Sciences",
        "course_code": "HRSS7808",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Mathematics & Physics School, Health & Rehab Sci School",
        "description": "This course is no longer offered.\nStudents who require this course for their current program should enrol in HRSS7102.\nArchived offerings\n\n\n\nCourse offerings\nLocation\nMode\nCourse Profile\n\n\n\n\n\n\n\tSemester 1, 2015\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2015\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2014\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2014\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2013\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2013\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2012\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2012\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2011\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2011\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2010\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2010\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2009\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2009\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n",
        "semesters": 0,
        "prerequisites": ""
    },
    "PHIL6007": {
        "course_name": "Philosophy Honours Seminar 1",
        "course_code": "PHIL6007",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "The course is based on a seminar program designed to develop awareness and understanding of the broad range of issues on the research agenda of contemporary philosophers, and also philosophers' methods of inquiry, along with the development of extended research, writing, and presentation skills. The seminar program will consist of 2x 2 hour seminars run weekly throughout the semester. Each five week module will be introduced and led by a different member of the philosophy program. Students will choose to write two 4,000 word essays and give a presentation on two of the module topics. The presentation is designed to develop skills in the presentation of a conference paper and to develop the ability to discuss philosophical questions in a professional manner.",
        "semesters": 1,
        "prerequisites": "Philosophy Major, PHIL2110"
    },
    "ENVM7127": {
        "course_name": "Environmental Management Research Project",
        "course_code": "ENVM7127",
        "duration": "Two Semesters",
        "units": 6,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "A research topic approval form must be submitted before enrolment can be completed. Contact School for details. Students completing the course in one semester must enrol in ENVM7125. Students enrolling in the year-long course with #2/#4 split enrol in ENVM7126 if commencing in semester 1 and finishing in semester 2 or ENVM7127 if commencing in semester 2 and finishing in semester 1 or ENVM7128 if commencing in semester 2 and finishing in summer or ENVM7129 if commencing in summer and finishing in semester 1. Students enrolling in year-long course with #4/#2 split enrol in ENVM7190 if commencing in semester 1 and finishing in semester 2 or ENVM7191 if commencing in semester 2 and finishing in semester 1 or ENVM7192 if commencing in semester 2 and finishing in summer or ENVM7193 if commencing in summer and finishing in semester 1. Students must enrol in the same course code in 2 semesters.",
        "semesters": 2,
        "prerequisites": ""
    },
    "PHTY4403": {
        "course_name": "Professional Practice 3",
        "course_code": "PHTY4403",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "Students will develop an ability to integrate the knowledge, physical skills, principles of evidence based practice, clinical reasoning, and ethical & professional behaviours that are necessary to function competently as a physiotherapist. Students in this course will undergo a supervised full-time physiotherapy professional practice immersion. Professional skills & reflective practice will be facilitated in order to prepare the student for challenges in health care service & delivery. Emphasis will be placed on developing student's knowledge & skills to function autonomously as primary contact health care practitioners in a range of contexts (e.g. hospital, community, ambulatory, & primary health care settings).",
        "semesters": 7,
        "prerequisites": "All Year One, Year Two and Year Three courses for the BPhty (Hons) program"
    },
    "COMP7500": {
        "course_name": "Advanced Algorithms & Data Structures",
        "course_code": "COMP7500",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Analysis of algorithms. Solution of summation & recurrence equations. Algorithm paradigms: divide-&-conquer, greedy algorithms, dynamic programming, backtracking, branch-&-bound. Advanced graph algorithms. Amortised analysis. Self-adjusting data structures. Complexity classes, NP-completeness. Approximation algorithms. Randomized algorithms.",
        "semesters": 2,
        "prerequisites": "COMP7505"
    },
    "MUSC3340": {
        "course_name": "Music, Cognition & Development",
        "course_code": "MUSC3340",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Music School",
        "description": "This course aims to engage students with contemporary and seminal investigations exploring the intersections of music, cognition, and development. Key questions to be explored include: Are musical abilities innate? What are the key cognitive processes involved in perceiving, learning, and performing music? How do music and cognitive abilities interact and develop across the lifespan? How can research knowledge be applied to professional music practice? How is music used in applied situations, including artistic, educational, and therapeutic contexts? Research from fields including psychology, neuroscience, education and development will be synthesised to provide students with a theoretically integrated and structured understanding of music cognition and development from rich and diverse perspectives.\n\nPlease note that this course offering may be cancelled if fewer than 10 students enrol.",
        "semesters": 2,
        "prerequisites": "MUSC2320 or PSYC2050"
    },
    "GENP7004": {
        "course_name": "General Practice Dermatology",
        "course_code": "GENP7004",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine & Biomedical Sciences",
        "school": "",
        "description": "The course will cover the anatomy, physiology and immunology of the skin; an introduction to analysis and description of the skin; and principles of a comprehensive skin history and examination in the general practice setting. It will include common presentations in general practice including dermatitis (endogenous, and exogenous), psoriasis, acne, infectious disease, common maculopapular and urticarial eruptions, and cutaneous manifestations of internal disease. Feature of pre-malignant and malignant skin disease and their management (malignant melanoma, basal cell carcinomas, solar keratoses, squamous cell carcinomas, and the non-surgical management of solar keratoses and skin cancers) will also be covered, as will pigmented lesions and their differentiation including dysplastic nevi. Hair and nail presentations in primary care, skin rejuvenation therapy, chronic ulcer management and new models of collaborative practice (teledermatology, the cameral in general practice, templates and referral process) will complete the on-line learning. The course workshop will cover basics of skin surgery (biopsy techniques, curettage, simple closures), and an introduction to dermatoscopy and laser therapy.",
        "semesters": 0,
        "prerequisites": ""
    },
    "FOOD7011": {
        "course_name": "Principles of Food Preservation",
        "course_code": "FOOD7011",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Food preservation methods & techniques used in commercial food processing.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PSYC4161": {
        "course_name": "Personnel Training",
        "course_code": "PSYC4161",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Social & Behavioural Sciences",
        "school": "Psychology School",
        "description": "NOT OFFERED IN 2011.\nThis course is designed for students who wish to pursue a career in organisational psychology. A strong emphasis will be placed on developing an understanding of current research and the contribution that this research can make to the design of effective training programs. Topics covered will include cognitive, motivational and contextual influences on training, the problem of transfer of training and the systematic evaluation of training outcomes.",
        "semesters": 0,
        "prerequisites": ""
    },
    "SLAT2002": {
        "course_name": "Language in the Digital World",
        "course_code": "SLAT2002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course is designed to introduce students to the use of technology in language teaching and learning. This will include both theoretical and practical aspects, based on the rich CALL literature and on current pedagogical approaches to language learning.\nThis course may be cancelled if there are fewer than 20 enrolments.",
        "semesters": 2,
        "prerequisites": ""
    },
    "MEDI7132": {
        "course_name": "Ethics & Professional Practice 2",
        "course_code": "MEDI7132",
        "duration": "One Semester",
        "units": 1,
        "faculty": "Medicine",
        "school": "Medicine Faculty",
        "description": "This course continues to familiarise students with the ethical, professional, and social frameworks in which medicine is practised, and the agreed and debated issues within these frameworks, through topics that arise within cases and clinical learning. The course will be delivered using a combination of lectures and symposia (often involving outside experts), CBL discussion and supportive web-based materials.",
        "semesters": 2,
        "prerequisites": "MEDI7131"
    },
    "WRIT9500": {
        "course_name": "Creative Writing Seminar",
        "course_code": "WRIT9500",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "The Writing Seminar supports MPhilCW and PhDCW students approaching research by creative practice. It introduces creative practice as a form of research, investigates its variations, and supports students as they apply it within their own work.",
        "semesters": 0,
        "prerequisites": ""
    },
    "JAPN3295": {
        "course_name": "Introduction to Japanese/English Translation",
        "course_code": "JAPN3295",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course introduces basic skills in Japanese/English translation and some professional aspects of translation. It aims to develop students' Japanese proficiency through the practice of Japanese/English translation.",
        "semesters": 0,
        "prerequisites": "JAPN3102 or equivalent"
    },
    "ECON6020": {
        "course_name": "Macroeconomics A",
        "course_code": "ECON6020",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "This is a core course in macroeconomic theory which addresses fundamental problems including output growth, business cycles and inflation in the context of mainstream models of the economy, fiscal and monetary policies.",
        "semesters": 1,
        "prerequisites": "ECON3020"
    },
    "FOOD3032": {
        "course_name": "Professional Practice",
        "course_code": "FOOD3032",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "",
        "school": "",
        "description": "Period of 13 weeks continuous, full-time, structured, course-related experience in a production enterprise or service industry which enables the student to apply their basic knowledge to that industry & to acquire knowledge & skills which can be used later in the program.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MUSC2510": {
        "course_name": "Music in Society 3",
        "course_code": "MUSC2510",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Music School",
        "description": "Study of Western Music from circa 1890-present in social context; study of selected representative works.",
        "semesters": 1,
        "prerequisites": "MUSC1050, MUSC2051"
    },
    "PUBH7611": {
        "course_name": "Epidemiology in Practice",
        "course_code": "PUBH7611",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Public Health School",
        "description": "This course will provide in-depth exposure to the fundamental concepts, research designs and analytic strategies of epidemiology. It aims to develop a coherent understanding of the principles of epidemiology. This course has prerequisite of PUBH7600 Introduction to Epidemiology and students must have successfully completed this course before enrolling in PUBH7611.",
        "semesters": 2,
        "prerequisites": "PUBH7600"
    },
    "COMP3702": {
        "course_name": "Artificial Intelligence",
        "course_code": "COMP3702",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Methods & techniques within the field of artificial intelligence, including problem solving and optimisation by search, representing and reasoning with uncertain knowledge and machine learning. Specific emphasis on the practical utility of algorithms and their implementation in software.",
        "semesters": 2,
        "prerequisites": "CSSE1001"
    },
    "COMP3401": {
        "course_name": "Compilers and Interpreters",
        "course_code": "COMP3401",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Compiler modules; programming language specifications; lexical analysis, parsing - recursive descent & table driven; static semantics - symbol tables & type checking; error handling; introduction to code generation & optimisation; compiler generators; interpreters.",
        "semesters": 0,
        "prerequisites": "COMP7505"
    },
    "AGRC7049": {
        "course_name": "Extension and Participatory Practice",
        "course_code": "AGRC7049",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "This course will no longer be offered in external mode from 2017 onwards\nThe course covers the principles and practices of extension and participation methodologies in rural settings. It describes the aims, incentives and barriers to stakeholder participation and learning, and practice change. It includes models of extension and theories of change, action learning and participatory processes.\nArchived offerings\n\n\n\nCourse offerings\nLocation\nMode\nCourse Profile\n\n\n\n\n\n\n\tSemester 1, 2018\t\n\nGatton\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2017\t\n\nGatton\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2016\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2016\t\n\nGatton\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2015\t\n\nGatton\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2015\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2014\t\n\nGatton\nInternal\n\n\tCourse Profile\n\n\n\n\n",
        "semesters": 1,
        "prerequisites": ""
    },
    "MEDI7122": {
        "course_name": "Clinical Practice 2",
        "course_code": "MEDI7122",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Medicine Faculty",
        "description": "This course will build on the foundation of knowledge and skills established in MEDI7121 to further develop and demonstrate knowledge and skills in history-taking, patient examination, communication, clinical reasoning and procedural skills. It consists of five areas: Clinical Coaching, Clinical Communication, Procedural Skills, Masterclasses and Professional behaviour. In Clinical Coaching students are taught the history taking and examination skills integral to medical consultations. Students cover the five major body systems over the year in Clinical Practice 1 & 2. Clinical Communication Skills concentrates on the process of communicating with patients using history taking as the context. A biopsychosocial model underpins the theory that the students learn and then demonstrate. Procedural Skills Workshops provide the opportunity for students to learn and then practise a range of basic procedures. The Nutrition Masterclass will introduce principles of nutrition in practice and further develop history-taking skills. Professional behaviour is expected at all times.",
        "semesters": 2,
        "prerequisites": "MEDI7111 and MEDI7121"
    },
    "COMU7311": {
        "course_name": "Intercultural Communication",
        "course_code": "COMU7311",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "COMU7311 provides specialised, advanced, and integrated knowledge and skills for research and professional practice in intercultural communication. Students will critically review a complex body of knowledge in intercultural communication, reflect on and synthesise theories and research, apply and transmit knowledge and skills to specialist and non-specialist audiences. The general goal of this course is to equip students with the capacity to demonstrate autonomy, expert judgement, adaptability and responsibility as effective communicators in intercultural contexts.",
        "semesters": 1,
        "prerequisites": ""
    },
    "COMS4104": {
        "course_name": "Microwave Engineering",
        "course_code": "COMS4104",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "This course uses electromagnetic principles to present the theory & operation of simple circuit devices & antennas at microwave frequencies, which are the part of modern microwave communication equipment. The emphasis is placed on planar guiding & radiating structures that enable either hybrid &/or monolithic integration of the devices. Modern CAD software packages are introduced & demonstrated through simulations of microwave networks & antenna configurations.",
        "semesters": 1,
        "prerequisites": "ELEC3100 and MATH2000"
    },
    "AGRC7001": {
        "course_name": "Sustainable Rangeland Production Systems and Regions",
        "course_code": "AGRC7001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "This foundation course examines global and national sustainability issues and the requirements for sustainable regions, landscapes and enterprises. The course provides insight into the evolving concept of sustainability, drivers of change in the rangelands, impediments and progress towards sustainability. \nNOTE: The Intensive offering may involve additional costs associated with its offering in a remote location. (Minimum enrolment required: 5 each for External & Internal mode, 8 for Intensive mode)",
        "semesters": 0,
        "prerequisites": ""
    },
    "ARCH3241": {
        "course_name": "Aboriginal Architecture",
        "course_code": "ARCH3241",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Architecture School",
        "description": "The study of buildings & cultural landscapes made by & for Aboriginal people in the past & present, considering the significance of culturally distinct behaviours, relationships & life-ways, and a critical account of issues of race & culture for architectural design.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ENGY7103": {
        "course_name": "Project Management for Energy Studies",
        "course_code": "ENGY7103",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "(no longer offered)This course aims to introduce the principles of project management and how this is applied to carbon management. Students will gain an understanding of the core functions of project management, including cost, time, quality, risk, scope, communications, human resources procurement and project life cycle integration in line with the Australian Competency Standards for Project Management. Students will work on a practical group project based on their chosen specialization topic.",
        "semesters": 0,
        "prerequisites": ""
    },
    "POLS7524": {
        "course_name": "Preventing Sexual and Gender Based Violence",
        "course_code": "POLS7524",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "This course examines the global politics of, and practical and ethical challenges to, preventing sexual and gender-based violence (SGBV) that constitute acts of genocide and mass atrocities. The course will analyse the underlying and immediate causes for the high prevalence of SGBV in mass atrocity situations, and equip students to assess corresponding structural and direct approaches to prevention. Through in-depth historical and contemporary case studies, students will critically evaluate: (1) the evolving politics of preventing sexual and gender-based atrocities; (2) the range of government, humanitarian, health and social service actors involved at the local, national and international levels in prevention efforts; (3) the strategies these various actors adopt; and (4) dilemmas and tensions these actors face in coordinating and delivering effective preventive action.",
        "semesters": 0,
        "prerequisites": ""
    },
    "CIVL3510": {
        "course_name": "Introduction to Project Management with Building Information Modelling",
        "course_code": "CIVL3510",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "This course will deliver the principles of project management in the context of civil engineering. This will include: work planning & control; scheduling, including critical path methods; internal and external costs (understanding, estimating and controlling); teams communication and team leadership; quality and safety culture; resources; professional ethics and Building Information Modelling for project management.",
        "semesters": 2,
        "prerequisites": "1st and 2nd year Civil Engineering compulsory courses"
    },
    "CSSE4011": {
        "course_name": "Advanced Embedded Systems",
        "course_code": "CSSE4011",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Advanced topics in Embedded System, including wireless networks and wireless sensor networks.",
        "semesters": 1,
        "prerequisites": "CSSE3010"
    },
    "DENT4000": {
        "course_name": "Population Oral Health and Professional Practice II",
        "course_code": "DENT4000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "This course provides a foundation in dental public health and professionalism in the practice of dentistry. The course explores principles of behaviour management in clinical care. Professional matters such as ethics, governance and regulation of dental practice in Australia will also be covered. The competency building activities of this course will provide students with learning through workshops and a series of case-based virtual patients.",
        "semesters": 1,
        "prerequisites": ""
    },
    "LAWS5207": {
        "course_name": "Patent and Trademark Law",
        "course_code": "LAWS5207",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "The course will examine patent and trademark law, which are of increasing importance to knowledge-based industries. It will consider registration criteria, protection of unregistered interests and associated legal concepts.",
        "semesters": 0,
        "prerequisites": "All Level 1 & 2 LAWS courses"
    },
    "CRIM2099": {
        "course_name": "Crime, Race and Gender",
        "course_code": "CRIM2099",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Social Science School",
        "description": "This course examines connections between crime, gender and race. There are persistent differences in patterns of crime, victimisation, and criminal processing between men and women, as well as between people of different racial and ethnic backgrounds. Students will be exposed to historical and theoretical frameworks for understanding the complex intersection between race, gender and crime.",
        "semesters": 2,
        "prerequisites": "#4 units criminology or sociology courses"
    },
    "AGRC6004": {
        "course_name": "Honours Research Project",
        "course_code": "AGRC6004",
        "duration": "Two Semesters",
        "units": 14,
        "faculty": "",
        "school": "",
        "description": "Design, implementation & presentation of research project in the field of animal or plant Science with an emphasis on defining the research issue, establishing methodology, undertaking appropriate analysis of data and drawing defensible conclusions.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MKTG3960": {
        "course_name": "Applied Market Research",
        "course_code": "MKTG3960",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Principles & techniques of marketing research as they apply in an international business context.",
        "semesters": 2,
        "prerequisites": ""
    },
    "GEOS2110": {
        "course_name": "Tectonics and Geomorphology of Active Plate Boundaries",
        "course_code": "GEOS2110",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Course will not be offered in 2018\n\nPlate tectonic processes exert a key influence on the development of landscapes through not only Earth deformation, but also through their influence on climate. Earth deformation processes are most intense at active plate margins. This field course will concentrate its investigation on boundaries of the Indo-Australian plate to examine how surface geomorphology is influenced by deep-earth processes. This course is a field trip course that requires travel to New Zealand and will be held in February (prior to semester one commencement). Additional fees are payable. For further information, and to express your interest in applying for this course, please see the School of Earth and Environmental Sciences . In the event that students complete the fieldwork and then subsequently withdraw from this course without financial liability, the School reserves the right to charge full cost recovery for this fieldtrip.",
        "semesters": 0,
        "prerequisites": "GEOS1100 & permission of Head of School"
    },
    "AUDL7825": {
        "course_name": "Hearing and Communication Across the Lifespan",
        "course_code": "AUDL7825",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "The normal processes of communication, the effects of hearing impairment on communication & the rehabilitation of communication skills across the lifespan.",
        "semesters": 1,
        "prerequisites": "All Year 1 Semester 1 AUDL courses & AUDL7803 plus AUDL7823"
    },
    "CIVL4412": {
        "course_name": "Travel Behaviour and Transport Modelling",
        "course_code": "CIVL4412",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "The course provides students with novel knowledge about modelling transport in general, and modelling travel behaviour in particular. The course provides theoretical understanding of behavioural theories underpinning different statistical and econometric model (e.g., regression models, discrete choice models, count data models), as well as their practical application to datasets provided in lab exercises.",
        "semesters": 1,
        "prerequisites": "(MATH1052 or MATH1072) and (CIVL2530 or STAT2201)"
    },
    "ECON2011": {
        "course_name": "Principles of Microeconomics",
        "course_code": "ECON2011",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "Provides students with tools of microeconomic analysis. These tools are developed from an introductory to an intermediate level using models of perfect and imperfect competition with emphasis on benefits, costs, optimization and welfare.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ARCH7052": {
        "course_name": "Architectural Research Thesis",
        "course_code": "ARCH7052",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Architecture School",
        "description": "Development of an independent research project that extends a topic relevant to the discipline of architecture. Topics include architectural and environmental design, technology, practice, history, theory, heritage, and people-environment studies. This course is available to students who have completed 2 of the following: ARCH7012, ARCH7022, ARCH7032 and ARCH7042.",
        "semesters": 0,
        "prerequisites": "A GPA of 5.5 or above and two of: ARCH7012, ARCH7022, ARCH7032 and ARCH7042"
    },
    "TOUR6007": {
        "course_name": "Honours Thesis A",
        "course_code": "TOUR6007",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This thesis course gives honours students the opportunity to undertake a substantial piece of work in a topic of interest as approved by the Head of School. This course is designed to be undertaken over 2 semesters and it is intended that students complete a literature review and research proposal in semester 1 and the research project is undertaken, analysed and written up in semester 2. Students are encouraged to choose a topic that is of particular interest to them personally and which is also relevant to their study area. On completion of this course, students are required to submit a Thesis of not less than 20,000 words. \nThe thesis provides an opportunity for students to undertake a significant piece of research and as such is ideal preparation for the student to undertake higher research studies.",
        "semesters": 1,
        "prerequisites": ""
    },
    "MATH7704": {
        "course_name": "Special Topics IV",
        "course_code": "MATH7704",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Advanced topics in mathematics.",
        "semesters": 3,
        "prerequisites": "Permission of Head of School"
    },
    "MEDI7411": {
        "course_name": "Obstetrics & Gynaecology",
        "course_code": "MEDI7411",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "By the end of the Obstetrics and Gynaecology course, students will have developed their knowledge, skills, personal attributes and acquired further clinical skills in women's health. Students are assigned to an Obstetrics and Gynaecology unit in a hospital within a Clinical School for six weeks of work-integrated learning during the course. Students will be an active participant of the medical team involved in the patient's care during this period, and will be expected to discuss problems and management plans using critical reasoning. Students are instructed how to take a patient's history and perform a physical examination. Students will learn about progress in labour and technique of normal delivery. It is expected that students will achieve a solid foundation to critically evaluate issues in women's health and reproductive health care.",
        "semesters": 0,
        "prerequisites": "MEDI7212, MEDI7222, MEDI7232 and MEDI7202"
    },
    "ARTT1106": {
        "course_name": "Looking at Art",
        "course_code": "ARTT1106",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "This course introduces students to how art functions as collective expression of cultures, nations, and communities across history, and develops skills in visual literacy and analysis; image-based communication; and the psychology of visual perception.",
        "semesters": 1,
        "prerequisites": ""
    },
    "HLTH7072": {
        "course_name": "Strategic Planning for Health Services",
        "course_code": "HLTH7072",
        "duration": "",
        "units": 0,
        "faculty": "Medicine & Biomedical Sciences",
        "school": "",
        "description": "",
        "semesters": 0,
        "prerequisites": ""
    },
    "BISM7216": {
        "course_name": "Business Process Improvement",
        "course_code": "BISM7216",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course introduces students to Business Process Management and various process improvement techniques used in business to improve operational efficiency and effectiveness. Students will develop knowledge of the process lifecycle and skills in modelling organisational processes using the international BPMN modelling standard. Students will further develop knowledge of several popular process analysis and improvement techniques, including Lean. Developing skills in applying various process improvement techniques will be supported through the use of case studies and a group assignment.",
        "semesters": 2,
        "prerequisites": "8 units of MCom courses"
    },
    "SOSC7100": {
        "course_name": "Development Practice Thesis",
        "course_code": "SOSC7100",
        "duration": "One Semester",
        "units": 6,
        "faculty": "Humanities and Social Sciences",
        "school": "Social Science School",
        "description": "Students work by themselves, under the individual supervision of a member of the academic staff of one of the following schools: School of Social Science; School of Political Science and International Studies; or School of Earth and Environmental Sciences. This allows students of exceptional ability to engage in a substantial research project. Students need to be self-motivated and self-disciplined and will determine and develop their own project in consultation with their supervisor. At the outset of their research, it is vital for students to swiftly identify and focus upon a clear research question. The semester then involves independent reading and research, regular contact between student and supervisor, and the preparation of a 10,000 to 12,000-word report. This course can only be undertaken if the planned project is of immediate interest to a supervisor in one of the three Schools. Prospective students must themselves identify and approach a potential supervisor and discuss their proposed research question; supervisors are not assigned by the Program Director, however they can assist in facilitating potential supervisors, if necessary. \nThis is a restricted entry course and requires prior approval from the Program Director. Students interested in this course should in the first instance download and read through the Expression of Interest form available on the School of Social Science website.\nStarting from Semester 2, 2017 the minimum GPA for enrolment has been increased to 5.5.",
        "semesters": 3,
        "prerequisites": "GPA of 5.5 and the agreement of a supervisor"
    },
    "MEDI7313": {
        "course_name": "General Practice",
        "course_code": "MEDI7313",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "The General Practice course includes a placement component which is community-based and involves the use of general practices in the geographical region in which each student is based. It offers students the opportunity to see and participate in the delivery of health care to patients with a large range of biopsychosocial problems. Through exploring the community context of health and illness students will learn about people's experiences and everyday management of health and health problems, as well as some of the ways in which different community groups and organisations contribute to maintaining and promoting health in the community. Students are encouraged to be enthusiastic and inquisitive, to become familiar with the everyday procedures involved in the workings of the general practice, and to function as a member of the health care team. Additionally, students are expected to use evidence based medicine skills to answer clinical questions as they arise, thus providing a benefit to the GP preceptors, as well as to their own learning. They are requested to work up illustrative cases to contribute at weekly small group, case based tutorials.",
        "semesters": 0,
        "prerequisites": "MEDI7212, MEDI7222, MEDI7232 and MEDI7202"
    },
    "MGTS3606": {
        "course_name": "Global Human Resource Management",
        "course_code": "MGTS3606",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course is designed to provide students with an understanding of three interrelated aspects of managing in the global workplace. Theme 1: General human resource management (HRM) in the multinational enterprise. Theme 2: Engaging in and supporting global mobility. Theme 3: Building awareness of present and emerging international human resource management trends. The course places equal value on building students' understanding of the theoretical foundations and practical implications of working in a global HRM environment.",
        "semesters": 1,
        "prerequisites": "MGTS2604"
    },
    "TOUR6034": {
        "course_name": "Change & Innovation in Tourism, Hospitality & Events",
        "course_code": "TOUR6034",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course adopts a problem based learning approach to explore the topic of change and innovation as it affects tourism, hospitality and events. Issues of innovation and creativity are explored in a real world context and are applied to specific case studies. Broad trends and change drivers are critically examined and debated. Students are required to analyse and discuss the potential implications of innovation and creativity for the industry and propose appropriate industry responses to these trends.",
        "semesters": 0,
        "prerequisites": ""
    },
    "NURS6001": {
        "course_name": "Advanced Discipline Readings",
        "course_code": "NURS6001",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course provides students with the necessary skills to perform a review of the scientific literature relevant to the research question chosen for their research thesis. Students conduct a literature review, critique the relevant literature and synthesise the information.",
        "semesters": 3,
        "prerequisites": ""
    },
    "EDUC7644": {
        "course_name": "Mathematics: Curriculum Studies",
        "course_code": "EDUC7644",
        "duration": "Two Semesters",
        "units": 4,
        "faculty": "",
        "school": "",
        "description": "This course prepares pre-service teachers to teach Mathematics in the junior secondary school through intermediate levels of mathematics in the senior phase of schooling. The course will engage pre-service teachers in a critical analysis of recent disciplinary developments in scholarship and professional practice in the teaching of Mathematics. Students will become familiar with Australian Curriculum: Mathematics and how the curriculum documents are used to plan for and inform classroom practice. They will be provided with opportunities to develop relevant knowledge and teaching strategies to address literacy and numeracy demands and learning opportunities that exist in Mathematics. A focus of the course will be on interacting with and developing activities and learning experiences which engage and deepen student understanding of mathematics beyond the textbook. Pre-service teachers will demonstrate the application of knowledge and skills to practice through (i) designing, implementing and evaluating effective learning and teaching sequences and discipline specific assessment tasks that draw on curriculum, assessment, reporting, and ICT knowledge; and (ii) identifying and designing discipline specific opportunities for professional engagement and communication within the school context, teaching networks and the broader community.",
        "semesters": 0,
        "prerequisites": ""
    },
    "HIST6700": {
        "course_name": "Honours Research Thesis",
        "course_code": "HIST6700",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "Students commencing in Semester 1 enrol in HIST6700; Students commencing in Semester 2 enrol in HIST6701.",
        "semesters": 1,
        "prerequisites": ""
    },
    "ENGG7301": {
        "course_name": "Advanced Topics in Engineering II",
        "course_code": "ENGG7301",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Topics in general areas of engineering to be given by visiting lecturers or staff members nominated by the Head of School. Until advised please contact School of ITEE (enquiries@itee.uq.edu.au )",
        "semesters": 3,
        "prerequisites": "Permission of Head of School"
    },
    "PSYC7554": {
        "course_name": "Organisational Psychology Practicum D",
        "course_code": "PSYC7554",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "Practicum courses develop professional skills in organisational psychology. Theories and techniques are applied in organisational settings under supervision of placement supervisors and organisational psychology staff.",
        "semesters": 7,
        "prerequisites": "Provisional or full registration as a Psychologist with the Psychology Board of Australia and PSYC7524, PSYC7534, PSYC7544"
    },
    "PSYC7544": {
        "course_name": "Organisational Psychology Practicum C",
        "course_code": "PSYC7544",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "Practicum courses develop professional skills in organisational psychology.\nTheories and techniques are applied in organisational settings under supervision of placement supervisors and organisational psychology staff.",
        "semesters": 7,
        "prerequisites": "Provisional or full registration as a Psychologist with the Psychology Board of Australia and PSYC7524, PSYC7534"
    },
    "EDUC7657": {
        "course_name": "Legal Studies: Curriculum Studies",
        "course_code": "EDUC7657",
        "duration": "Two Semesters",
        "units": 4,
        "faculty": "",
        "school": "",
        "description": "This course prepares pre-service teachers to teach Legal Studies in the senior phase of schooling. Pre-service teachers will be provided with opportunity to develop knowledge and understanding of relevant curriculum documents. The course will engage pre-service teachers in a critical analysis of recent disciplinary developments in scholarship and professional practice in the teaching of Legal Studies. They will be provided with opportunities to develop the appropriate knowledge and teaching strategies to effectively deal with literacy and numeracy demands and learning opportunities that exist in Legal Studies. Pre-service teachers will demonstrate the application of knowledge and skills to practice through (i) designing, implementing and evaluating effective learning and teaching sequences and discipline specific assessment tasks that draw on curriculum, assessment, reporting, and ICT knowledge; and (ii) identifying and designing discipline specific opportunities for professional engagement and communication within the school context, teaching networks and the broader community.",
        "semesters": 0,
        "prerequisites": ""
    },
    "POLS7509": {
        "course_name": "Gender and the Global Politics of Development",
        "course_code": "POLS7509",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "This course examines the gendered impacts of a variety of development challenges in areas such as economic production, health, conflict, environmental resource extraction and political representation and how these are shaped by global political and economic conditions. While women's experience of the masculinist structures which regulate international politics and development are investigated, students will also consider how groups of men are made vulnerable or empowered through the privileging of particular masculine 'norms' within the international political and economic order.",
        "semesters": 2,
        "prerequisites": ""
    },
    "JAPN3102": {
        "course_name": "Continuing Japanese 4",
        "course_code": "JAPN3102",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course will extend students' knowledge and skills in Japanese languages in all four macro skills and develop linguistic and cultural competency with an emphasis on mastering kanji and advanced grammar for written communication. Capstone course for student completing a Single Major in Japanese (Stream B) or a Extended Major in Japanese (Stream A).",
        "semesters": 2,
        "prerequisites": "JAPN3101 or equivalent"
    },
    "EDUC2711": {
        "course_name": "Primary Schooling Pedagogical Practices",
        "course_code": "EDUC2711",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Social & Behavioural Sciences",
        "school": "Education School",
        "description": "This course is offered as EDUC2716 from 2011.\nThis course is a compulsory unit of study for all students enrolled in the primary schooling program. It incorporates basic understandings critical to work in this area. This course examines teaching and learning in the early and middle years of schooling with a focus on developing appropriate approaches to pedagogy, curriculum and assessment for effective teaching and learning of children and young people. Unique attributes of 'millennial' and 'Z' generation young people will be used in conjunction with understandings of 'new times' as the basis for this thinking. The course provides understandings of the context specific professional and pedagogical issues which beginning teachers encounter in primary and middle schooling, and identifies specific contextual factors relevant to the contemporary educational environment. Importantly, this course facilitates the development of a personal philosophy of teaching. It also highlights the importance of collaborative team approaches to teaching and learning that are critical work practices for middle years educators in particular, and relatively new to the profession as a 'mainstream' approach to teacher preparation.\nArchived offerings\n\n\n\nCourse offerings\nLocation\nMode\nCourse Profile\n\n\n\n\n\n\n\tSemester 1, 2010\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n",
        "semesters": 0,
        "prerequisites": "EDUC1702"
    },
    "MGTS2000": {
        "course_name": "Practicum 1",
        "course_code": "MGTS2000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "NOT 2006\nThe course enables students to demonstrate their familiarity with the international hotel and tourism industry by means of at least 200 hours of work experience. Where necessary, students may be required to demonstrate this knowledge through submission of relevant assignments/reports or journals.",
        "semesters": 0,
        "prerequisites": ""
    },
    "RELN7310": {
        "course_name": "Violence and Religion",
        "course_code": "RELN7310",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "The course introduces students to violence and fundamentalisms in the world's religions, including Judaism, Christianity, Islam, & Hinduism. The aim is to discover root causes and the variety of expressions of violence in various religious traditions.",
        "semesters": 0,
        "prerequisites": ""
    },
    "AGRC6623": {
        "course_name": "Honours Research Project II",
        "course_code": "AGRC6623",
        "duration": "Four Semesters",
        "units": 12,
        "faculty": "",
        "school": "",
        "description": "Design, implementation & presentation of research project relevant to student's program of study, with emphasis on defining the research issue, establishing methodology, undertaking appropriate analysis of data & drawing defensible conclusions. \nStudents commencing in sem 2 part-time enrol in AGRC6623 for 4 consecutive semesters; full-time students enrol in AGRC6619 for 2 consecutive semesters\nStudents commencing in sem 1 part-time enrol in AGRC6622 for 4 consecutive semesters; full-time students enrol in AGRC6618 for 2 consecutive semesters",
        "semesters": 0,
        "prerequisites": ""
    },
    "COMP6801": {
        "course_name": "Computer Science Honours Project",
        "course_code": "COMP6801",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "A research-based thesis course that offers students the opportunity to work on a comprehensive, individual project that demonstrates mastery of computer science. Topic to be agreed in consultation with a supervisor. The project will be of suitable complexity for results to be published for an expert audience. Students commencing in semester 1 enrol in COMP6801, students commencing in semester 2 enrol in COMP6802. Students wishing to complete thesis in a single semester enrol in COMP7880.",
        "semesters": 1,
        "prerequisites": "Admission to BSc (Hons) or BInfTech (Hons)."
    },
    "POLS7514": {
        "course_name": "The Politics and Power of Nonviolence",
        "course_code": "POLS7514",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "Violence is often viewed as the ultimate manifestation of power. It permeates the societies we live in. In this course we challenge the ethical foundations of this view and explore how nonviolence can be an effective way of yielding power and promoting social change. Making use of historical and contemporary case studies, we examine a wide range of nonviolent strategies, from strikes and civil disobedience to street protests and everyday resistance. They reveal how nonviolence offers pathways to political transformation when normal institutionalised politics fails to provide justice.",
        "semesters": 2,
        "prerequisites": ""
    },
    "CSSE4020": {
        "course_name": "Wireless Sensor Networks",
        "course_code": "CSSE4020",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "(Offered on an occasional basis.) The course aims to provide students with a theoretical understanding of the fundamentals of Wireless Sensor Networks (WSN), plus experience in programming WSN systems through a major group project. Topics may include: fundamental principles of WSN operation; WSN hardware - processing, communications and sensors; WSN software - operating systems and programming languages; WSN communications - understanding all layers of the wireless communications data stack; WSN applications - how data is collected, transmitted, stored and accessed; WSN programming.",
        "semesters": 0,
        "prerequisites": "CSSE2310"
    },
    "POLS7306": {
        "course_name": "International Crisis Management",
        "course_code": "POLS7306",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "This course provides students with an understanding of the policies and practices of crisis governance and the dynamics of post-crisis institutional reform, and emphasizes the participatory solutions which are now being proposed within this governance agenda. The course locates contemporary crises within an international development context, and, within this context, explores crisis causation, state-led crisis responses, and consequential reform efforts through governance, policy-analysis, and (participatory) democratic perspectives.",
        "semesters": 2,
        "prerequisites": ""
    },
    "WRIT2100": {
        "course_name": "Creative Writing: Poetics",
        "course_code": "WRIT2100",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "This creative writing course studies techniques of poetic expression and develops writing skills and an appreciation of language aesthetics.",
        "semesters": 2,
        "prerequisites": "4 units of BA list courses"
    },
    "LAWS7024": {
        "course_name": "Occupational Health & Safety Law",
        "course_code": "LAWS7024",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course will introduce students to the central legal concepts and principles in occupational health and safety, including the history and development of OH&S legislation, the relationship between OH&S law and industrial law, and the relationship between OH&S legislation and common law.",
        "semesters": 2,
        "prerequisites": ""
    },
    "LAWS2113": {
        "course_name": "Criminal Law and Procedure A",
        "course_code": "LAWS2113",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "Criminal Law & Procedure A involves the study of the general principles of criminal responsibility & of specific offences & defences under Queensland's criminal law. The course draws comparisons - where relevant - to developments at common law. It also introduces the rapidly expanding area of federal criminal law.",
        "semesters": 1,
        "prerequisites": "LAWS1111 (LLB(Grad Entry) & LLB(Hons#48) students excepted)"
    },
    "OCTY7828": {
        "course_name": "Occupational Performance & Participation for Adults with Acute & Chronic Medic",
        "course_code": "OCTY7828",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "This course will assist students to develop an understanding of the impact of injury, acute illness & chronic medical conditions on client's occupational performance & participation. Students will learn from the lived experience of adult clients & will develop skills in information gathering, service provision & service evaluation for these clients.",
        "semesters": 2,
        "prerequisites": "OCTY7811, OCTY7823, OCTY7825 or OCTY7835, OCTY7829 or OCTY7834"
    },
    "PHRM3021": {
        "course_name": "Dosage Form Design B1",
        "course_code": "PHRM3021",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Pharmacy School",
        "description": "Specialised drug delivery systems; extemporaneous formulation, compounding & quality control; physicochemical incompatibilities.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PHYS4070": {
        "course_name": "Advanced Computational Physics",
        "course_code": "PHYS4070",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "This course covers advanced numerical simulation techniques used in computational physics and their application to several physical problems. Topics covered include the solution of few-body classical dynamics, quantum mechanical eigenproblems, Monte Carlo techniques, the Metropolis algorithm, and classical models of magnetism. The course will cover some topics in advanced C++ programming, including floating point numbers, vectorisation, optimisation, parallelisation, and debugging techniques. The course requires the use of C++, and this will be introduced from scratch.",
        "semesters": 2,
        "prerequisites": "PHYS3020, PHYS3040 and PHYS3051"
    },
    "POLS7218": {
        "course_name": "Specialist Studies in International Relations",
        "course_code": "POLS7218",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "Semester 2 2016 : China in a Changing World.\nAs a permanent member of the United Nations Security Council and major world economy with extensive overseas development projects, China is an integral player in global efforts to address some of the most pressing security challenges in the world today. This course will critically examine ChinaÂ¿s international policies and diplomacy toward such issues as climate change, counter-terrorism, human rights, sustainable development and mass atrocities prevention. It will consider the key economic, political, social and normative factors that shape ChinaÂ¿s foreign policy and diplomacy on these issues, and examine the impact of China on broader efforts to strengthen institutional and collective response to new security challenges. By examining the complexity and nuance of ChinaÂ¿s position on a range on non-traditional security issues, the course aims to provide students with a deeper understanding of ChinaÂ¿s global engagement in a changing world.\nSpecialist Studies in International Relations provides an opportunity for areas of study, not covered in other courses, to be offered under special circumstances (for example, a course to be given by a visiting lecturer in a specialty area that is not usually available). Regardless of changes in the content of the course, students can only take the course once. Please contact the Senior Administrative Officer (Academic) in the School of Political Science and International Studies for information on the current topic.",
        "semesters": 0,
        "prerequisites": ""
    },
    "BISM3222": {
        "course_name": "Information Analysis and System Design",
        "course_code": "BISM3222",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Structured analysis & design for business; data analysis & design; object-oriented analysis & design; testing & quality assurance; practical group experience with computer-assisted software engineering tools for business applications.",
        "semesters": 1,
        "prerequisites": "BISM1201 or MGTS1201 or 2 units COMP/COMS/INFS courses"
    },
    "PHIL7200": {
        "course_name": "Epistemology & Metaphysics (Graduate)",
        "course_code": "PHIL7200",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "Problems in epistemology and metaphysics, knowledge and belief, time, free will, existence, change and identity.",
        "semesters": 0,
        "prerequisites": ""
    },
    "HLTH7006": {
        "course_name": "Critical Evaluation in Practice",
        "course_code": "HLTH7006",
        "duration": "Two Semesters",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Students take an aspect of their current work practice as the source of their study and write a personal learning contract (in consulation with course coordinator) to advance their knowledge of this area. Students use this knowledge to make a change in their current practice and evaluate the outcomes of the change. Students commencing in Semester 1 enrol in HLTH7006. Students commencing in Semester 2 enrol in HLTH7007.",
        "semesters": 0,
        "prerequisites": ""
    },
    "DECO3001": {
        "course_name": "Special Topics in Design Computing 3B",
        "course_code": "DECO3001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Specialist lectures/projects on topical issues in design computing to be given by visiting lecturers or staff members nominated by Head of School. For details and availability contact enquiries@itee.uq.edu.au.",
        "semesters": 3,
        "prerequisites": "Permission of Head of School"
    },
    "LAWS7167": {
        "course_name": "Asian Legal Systems",
        "course_code": "LAWS7167",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course aims to introduce students to the characteristics of the legal systems of Asian nations. Focus is on three components: structural, substantive and cultural. The nations to be covered include: China, Taiwan, Korea, Vietnam, Malaysia, Brunei Darussalam, Indonesia, and Japan.",
        "semesters": 0,
        "prerequisites": "LAWS7000 or LAWS7936"
    },
    "ECON7003": {
        "course_name": "Economics for Managers",
        "course_code": "ECON7003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Introduces professional accounting & management students to both microeconomics & macroeconomics; highlights practical applicability of economics to analysis of contemporary problems; market trends & government policies.",
        "semesters": 0,
        "prerequisites": ""
    },
    "SWSP7033": {
        "course_name": "Research & Evaluation for Social Work Practice",
        "course_code": "SWSP7033",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "NOT OFFERED IN 2011.\nThis research methods course builds on content covered in SWSP7302. There is a strong emphasis on the application of research methods in practice and program evaluation. A working knowledge of social research methods, including the capacity to choose the most appropriate methods to investigate particular research questions, to critically review social research, and to apply research findings to specific practice and policy contexts, is an essential component of social work practice.\nThis course comprises two interrelated components: developing skills in critically reviewing existing research, and building studentsÂ¿ repertoire of research and evaluation knowledge and skills. The latter include single system design, focus groups, developing composite measures, analysing secondary data, qualitative analysis, and evaluation planning.",
        "semesters": 0,
        "prerequisites": ""
    },
    "CHIN6340": {
        "course_name": "Advanced Chinese Language",
        "course_code": "CHIN6340",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Advanced training in Chinese language.",
        "semesters": 3,
        "prerequisites": ""
    },
    "LAWS7206": {
        "course_name": "Copyright Law",
        "course_code": "LAWS7206",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course provides an in depth examination of copyright law. It seeks to develop students' knowledge of the nature and significance of copyright (including moral rights) in Australia, and compare Australian law with that in jurisdictions including the UK/Europe, the US and Canada. It will pose normative questions about the appropriate scope of copyright protection.",
        "semesters": 2,
        "prerequisites": "LAWS7000 or LAWS7936"
    },
    "BIOT3004": {
        "course_name": "Commercialisation of Biotechnology Products",
        "course_code": "BIOT3004",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "description": "Technical & non-technical issues in commercialisation of biotechnology products, including research, development & production; safety, regulatory & legal issues; financial aspects, quality control, environmental concerns & social issues affecting successful commercialisation of biotechnology products.",
        "semesters": 2,
        "prerequisites": ""
    },
    "BISM1201": {
        "course_name": "Transforming Business with Information Systems",
        "course_code": "BISM1201",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Uses of information systems in organisations, management of information systems. Introduction to computer hardware & software; information systems development, implementation & operation. Practical experience with spreadsheets, database management and other business applications software for business problems.",
        "semesters": 3,
        "prerequisites": ""
    },
    "BIOM3010": {
        "course_name": "Human Physiology & Pharmacology B1",
        "course_code": "BIOM3010",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Biomedical Sciences School",
        "description": "Continuing development of basis for understanding function of human body & use & effects of drugs in disease-oriented context. Integrated approach to cardiovascular & renal systems.",
        "semesters": 1,
        "prerequisites": "BIOM1052"
    },
    "LAWS6100": {
        "course_name": "Corporations, Law and Governance",
        "course_code": "LAWS6100",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Further examination of issues involving commercial companies, including insolvency & takeovers.",
        "semesters": 0,
        "prerequisites": "LAWS3100 or 4112 or 5017 or 7011 + permission from Head of School"
    },
    "EDUC7643": {
        "course_name": "Japanese: Curriculum Studies",
        "course_code": "EDUC7643",
        "duration": "Two Semesters",
        "units": 4,
        "faculty": "",
        "school": "",
        "description": "This course prepares pre-service teachers to teach Japanese in the secondary school. Pre-service teachers will be provided with opportunity to develop knowledge and understanding of relevant curriculum documents. The course will engage pre-service teachers in a critical analysis of recent disciplinary developments in scholarship and professional practice in the teaching of Japanese. They will be provided with opportunities to develop the appropriate knowledge and teaching strategies to effectively deal with literacy and numeracy demands and learning opportunities that exist in Japanese. Pre-service teachers will demonstrate the application of knowledge and skills to practice through (i) designing, implementing and evaluating effective learning and teaching sequences and discipline specific assessment tasks that draw on curriculum, assessment, reporting, and ICT knowledge; and (ii) identifying discipline-specific opportunities for professional engagement and communication within the school context, teaching networks and the broader community.",
        "semesters": 0,
        "prerequisites": ""
    },
    "LAWS7302": {
        "course_name": "Business and Commercial Law",
        "course_code": "LAWS7302",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course introduces students to the Australian legal system and develops student knowledge of Australian business and corporations law. The course is intended to provide a foundation for non-legal professionals intending to work in business.",
        "semesters": 0,
        "prerequisites": ""
    },
    "AGRC7023": {
        "course_name": "Grazing Land Management",
        "course_code": "AGRC7023",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "This course explores issues in the sustainable use & management of the rangelands, with particular emphasis on meat & wool production. The course covers the theory & practice of grazing management, strategies to optimise productivity in a variable climate, & options for management of major rangeland types. \nNOTE: The Intensive offering may involve additional costs associated with its offering in a remote location. (Minimum enrolment required: 5 each for External & Internal mode, 8 for Intensive mode)",
        "semesters": 0,
        "prerequisites": ""
    },
    "SWSP3027": {
        "course_name": "Foundational Social Work Field Practice Course in Mental Health",
        "course_code": "SWSP3027",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course provides an introduction to social work practice with people with mental health problems in everyday social work settings. The emphasis is on understanding the lived experience of mental illness and treatments as a starting point for helping. Topics covered include conceptualising mental health and illness, social work in multidisciplinary settings, mental health policy and law, social work assessment, case management, community work and family work.",
        "semesters": 2,
        "prerequisites": ""
    },
    "BIOL3350": {
        "course_name": "Genetics and Evolution of Complex Traits: From Humans to Non-Model Organisms",
        "course_code": "BIOL3350",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Biological Sciences School",
        "description": "Course will not be offered in 2018\nThis course will provide students with a foundation for understanding the genetic basis and evolution of traits that are influenced by both genetics and the environment. In many cases, such traits are due to a large number of genes and their genetic study requires a specialised approach. This course covers theory, methods and applications of quantitative genetics. With a strong emphasis on phenotypic microevolution, the course will cover the evolution of complex traits, such as life histories, morphology, complex behaviours and disease. The course centres around the study of two fundamental relationships; the genotype-phenotype map and the phenotype fitness map. We cover the predictive theories for evolution by natural selection and the measurement of evolvability and constraints. Approaches for genetic dissection of adaptive traits via Quantitative Trait Locus (QTL) and Genome-wide Association Studies (GWAS) will be covered as well as their application to the testing of evolutionary processes. Example topics include the evolution of life histories (e.g. ageing) and trade-offs, adaptive radiations, pleiotropy and its consequences, mutation and the maintenance of\ngenetic variation. We use examples from non-model organisms and human disease. The human genetics component will be delivered by practising researchers from UQ's Diamantina Institute.",
        "semesters": 0,
        "prerequisites": "BIOL2202 or BIOL2902 and BIOL2006 or BIOL2106"
    },
    "ANIM3045": {
        "course_name": "Sustainable Animal Systems",
        "course_code": "ANIM3045",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Advanced concepts and practices used in the sustainable management of animal systems in Australia.",
        "semesters": 2,
        "prerequisites": ""
    },
    "EDUC7915": {
        "course_name": "Project B: MEdSt",
        "course_code": "EDUC7915",
        "duration": "One Semester",
        "units": 6,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "Elective project for students enrolled in Master of Educational Studies. Project topics are confined to specialised research & teaching interests of permanent staff of the School of Education. Students must choose and approach a potential supervisor. Projects are negotiated with supervisors and typically take the form of literature reviews or small research projects. Students and supervisors together complete the Application to Undertake a Supervised Research Project Form located on the School website (Calendars, Forms, Handbooks). Forms should be submitted two weeks prior to the enrolment due date for the chosen semester to the Administrative Officer. Subsequent for approval to undertake the project being received from the School of Education, students enroll in the course.\n\nStudents completing in one semester enrol in EDUC7915. Students completing in one year commencing in semester 1 enrol in EDUC7916 in both semesters. Students completing in one year commencing in semester 2 enrol in EDUC7917 in both semesters.\n\nStudents are expected to maintain contact with their supervisor. Contact times for internally enrolled students must be arranged with the supervisor at the commencement of semester.",
        "semesters": 3,
        "prerequisites": ""
    },
    "ECON7000": {
        "course_name": "Foundations in Microeconomics",
        "course_code": "ECON7000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "This course provides students with a basic knowledge of the core economic principles. These principles will be explained and developed using a variety of examples involving businesses, governments, and households. Topics include supply and demand analysis, imperfect competition, producer and consumer theory, marginal analysis, welfare analysis, benefits and costs.",
        "semesters": 3,
        "prerequisites": ""
    },
    "OCTY3103": {
        "course_name": "Promoting Occ Performance & Participation for Individuals with Complex Issues",
        "course_code": "OCTY3103",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "This course will expose students to the complexity of occupational therapy practice through the investigation of individual case scenarios addressing complexity at the levels of person, environment & occupation. Cultural & linguistic diversity, complexity of practice across health, education, disability & welfare sectors & complexity related to health & social issues experienced by carers & other family members will be introduced. Case studies will be the basis for teaching, demonstrating the complexity of enhancing occupational performance & participation throughout the lifespan.",
        "semesters": 1,
        "prerequisites": "All of Year Two of BOccThy (Hons) program"
    },
    "LAWS7714": {
        "course_name": "Refugees, Asylum Seekers and the Law: Rights and Realities",
        "course_code": "LAWS7714",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course critically examines international and regional laws (treaties and case-law), and domestic policies and laws (legislation and case-law) and politics, relating to forced migration. Study will focus on both historical and contemporary refugee law and practice in Australia in light of international refugee law, and international human rights law in particular. The transplantation of those international norms into domestic law via the Migration Act 1958 (Cth) (and key cases interpreting and applying those laws) will be carefully and critically analysed. Attention will also focus on the key challenges to refugee protection raised by contemporary Australian practices, especially in respect of asylum seekers arriving irregularly by sea; including mandatory detention, offshore (regional) processing and temporary protection. The course will encourage students to incorporate comparative and/or interdisciplinary perspectives into their legal analyses of international law and domestic law and practice.",
        "semesters": 2,
        "prerequisites": ""
    },
    "PSYC7494": {
        "course_name": "Advanced Personnel Assessment",
        "course_code": "PSYC7494",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "The aim of this course is to develop an understanding of advanced personnel assessment issues, from both theoretical and applied perspectives. It assumes that students have knowledge of principles of measurement and psychometrics and theories and techniques of selection in an occupational setting. The course pays particular attention to psychological testing (cognitive ability, personality, and vocational interests), and behavioural assessment (job interviewing, work samples, and multi-method strategies associated with assessment centres). It also explores contemporary issues in recruitment, selection, and appraisal that offer special challenges to the personnel practitioner.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ENGL2320": {
        "course_name": "Literature & Environment",
        "course_code": "ENGL2320",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "NOT 2010\nExamines works from the USA, Canada & Australia which portray a variety of interactions among people, animals & environments, and which reflect and help to frame awareness of environmental issues.",
        "semesters": 0,
        "prerequisites": "#4 Arts"
    },
    "ECON7921": {
        "course_name": "Research Methods in Economics",
        "course_code": "ECON7921",
        "duration": "Two Semesters",
        "units": 4,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "This course provides an opportunity for students to build up a research credential before undertaking the Thesis. It encourages students' critical thinking and informed judgement through the completion of a journal article review and the development of a research proposal, which is then used as a platform for the Thesis. [Note: If enrolling in this course across 2 semesters: Students commencing in Sem 1 must enrol in ECON7921 for both semesters. Students commencing in Sem 2 must enrol in ECON7922 for both semesters. Students enrolling in a single semester must enrol in ECON7920.]",
        "semesters": 0,
        "prerequisites": "#8 of level 7 ECON courses or 40 credit points of level 8 EC courses"
    },
    "MINE3209": {
        "course_name": "Mineral Processing I",
        "course_code": "MINE3209",
        "duration": "One Semester",
        "units": 1,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "Liberation of minerals & textures after comminution; design, engineering & operation of different comminution circuits and machineries.",
        "semesters": 0,
        "prerequisites": "MINE2101 or 2201 or MMME2101 or 2201 or ERTH1501"
    },
    "EXCH1022": {
        "course_name": "Exchange Studies",
        "course_code": "EXCH1022",
        "duration": "One Semester",
        "units": 0,
        "faculty": "The University of Queensland",
        "school": "Architecture School, Biological Sciences School, Biomedical Sciences School, Business School, Chemical Engineering School, Chemistry & Molec Biosciences, Civil Engineering School, Communication & Arts School, Economics School, Education School, Human Movement & Nutrition Sci, Historical & Philosophical Inq, Humanities and Social Sciences, Info Tech & Elec Engineering, Law School, Languages & Cultures School, Mathematics & Physics School, Mech & Mine Engineering School, Medicine Faculty, Music School, Nursing, Midwifery & Social Wk, Politic Sc & Internat Studies, Psychology School, Public Health School, Health & Rehab Sci School, Agriculture Food Sciences Schl, Earth and Environment Sc Schl, Social Science School, Veterinary Science School",
        "description": "Course to be used for Semester 2 enrolments by outgoing exchange students.",
        "semesters": 2,
        "prerequisites": ""
    },
    "SPCG7002": {
        "course_name": "Skill Acquisition & Movement Analysis for Coaches",
        "course_code": "SPCG7002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "Critical examination of the stages of motor learning and expert performance in elite sport. A particular focus on learning, stages of learning and facilitation of the learning process. A strategic approach to the qualitative analysis of human movement in specific sports.",
        "semesters": 0,
        "prerequisites": ""
    },
    "SWSP7394": {
        "course_name": "Research Project Part A",
        "course_code": "SWSP7394",
        "duration": "Two Semesters",
        "units": 4,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "The report will be on a topic chosen by the student and approved in advance by the Postgraduate Coursework Program Director, 6 weeks prior to the commencement of semester. The report may be the result of an original investigation, or embody a critical appraisal of analysis of primary or secondary source material. \nStudents must contact the School of Nursing, Midwifery and Social Work at least 6 weeks prior to the commencement of semester to seek permission to enrol in this course. This involves the completion of an application involving a 600 word research proposal, two supervisor nominations, identification of ethical clearance (if required) and an academic progression check. \nSWSP7394 is for part-time students completing the Research Project over two semesters starting in semester 2 and completing in semester 1 of the following year. Students must be enrolled in SWSP7394 in each semester. Students need to complete both semesters to get a grade",
        "semesters": 0,
        "prerequisites": "Departmental consent required, please contact the Postgraduate Coursework Program Director"
    },
    "SLAT7852": {
        "course_name": "Portfolio & Synthesis",
        "course_code": "SLAT7852",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "The course consists of a folio of the student's assessed work during their program, plus a 3,500-4,000 word Synthesis Essay which brings together key theoretical and empirical aspects of the program in critical perspective. The course is undertaken in the final semester of the coursework MA. \nThis course may be cancelled if there are fewer than 20 enrolments.",
        "semesters": 3,
        "prerequisites": ""
    },
    "HIST3302": {
        "course_name": "The City in History",
        "course_code": "HIST3302",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "From ancient Athens and Rome to Chang'an (Xian) in China, Edo (Tokyo) in Japan and Paris and New York, cities have been the stage for the great dramas of human history. Whether as seats of monarchies and political power, seedbeds of subversion and revolution, or centres of trade and innovation and .culture, cities have punctuated human history - they might even be the greatest achievement of humankind. HIST3302 The City in History is a broad-ranging thematic course that seeks to explore the essence of urbanism and the urban experience through time via a wide set of case studies. Major cities from the ancient world to the present day are examined through developments in politics, social life, religion, urban reform and culture. We explore the urban spectacles of power, creativity, conflict and innovation from ancient Europe to Asia, the Americas and contemporary Australia. The course is thus concerned with the interconnections between urban places and human culture throughout recorded history. It suggests that the built fabric of cities is a material embodiment of historical developments in human society, economics, politics and culture. Particular cities and moments in time can be viewed as focal points to exemplify major patterns in human history.",
        "semesters": 1,
        "prerequisites": ""
    },
    "NUTR3201": {
        "course_name": "Advanced Nutrition Sciences",
        "course_code": "NUTR3201",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "NUTR3201 aims to develop knowledge and scientific critical thinking in contemporary nutrition topics and emerging issues. This course builds on prior studies in nutrition science, and the understanding of human physiology, biochemistry and molecular principles. The course examines the scientific basis for nutrition reference standards and guidelines, nutraceuticals and functional foods; the strengths and limitations of nutrition research methodology; the nutritional outcomes of food processing and exposure to related metabolites; the emerging paradigm of personalised nutrition through the understanding of nutritional genomics, and nutritional epigenetic marks; the role of the gut microbiota in health and disease, and interactions with dietary constituents with related outcomes; the concept of energy balance with processes involved in the regulation and dysregulation of appetite, and association with eating disorders. Finally, it explores the scientific evidence of the role of dietary patterns and food constituents in regulating the metabolic drivers of lifestyle and ageing-related chronic disease.",
        "semesters": 2,
        "prerequisites": "BIOC2000 + physiology at year 2 level (either PHYL2730 or BIOM2011 or BIOM2015) + NUTR2101"
    },
    "RBUS6993": {
        "course_name": "Honours Thesis",
        "course_code": "RBUS6993",
        "duration": "Two Semesters",
        "units": 6,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Independent research thesis in any relevant field of management. Research supervised by academic staff & involves application of current models to investigate challenges facing modern organisation & its leaders. Students commencing in sem 1 enrol in RBUS6991 in both semesters. Students commencing in sem 2 enrol in RBUS6993 in both semesters. Students completing in one semester enrol in RBUS6994.",
        "semesters": 2,
        "prerequisites": "Permission from Head of School"
    },
    "MATH7091": {
        "course_name": "Financial Calculus",
        "course_code": "MATH7091",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Topics from financial calculus including financial derivatives & arbitrage, asset prices, price dynamics, continuous-time hedging, Brownian motion, Martingales, stochastic integration, solving stochastic differential equations & stochastic control.",
        "semesters": 1,
        "prerequisites": ""
    },
    "MATH1050": {
        "course_name": "Mathematical Foundations",
        "course_code": "MATH1050",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Core content of Senior Mathematics C syllabus. Provides introduction to sequences & series, linear algebra, calculus, complex numbers & mathematical induction.",
        "semesters": 3,
        "prerequisites": "MATH1040 or SA in Year 12 Maths B"
    },
    "ENGL2405": {
        "course_name": "Thinking about Literature: Criticism and Theory",
        "course_code": "ENGL2405",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "ENGL2405 is the cornerstone of the major and extended major in English Literature, so it builds on the introduction to literary texts you've received in the gateway course, ENGL1800. Here, we start to explore some more general ideas about how literary texts work: how they're constructed, what they do, the questions they raise, how they circulate and function, and the ways in which they're cultural and social phenomena. ENGL2405 will familiarize you with some of the main themes and currents of literary criticism and theory, and give you scope to explore issues of particular interest to you. It will also enrich any of the second-level courses you choose to do, and prepare you for the major's third-level options and capstone study.",
        "semesters": 1,
        "prerequisites": "4 units of BA list courses"
    },
    "CIVL7360": {
        "course_name": "Computational Design and Structural Geometry",
        "course_code": "CIVL7360",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "A range of advanced computational methods exist to enable engineers to solve complex analysis and design challenges. The first half of this course introduces students to topics related to computational methods for design problems, including: parametric design, generative design, optimisation & form-finding, and digital fabrication. The second half of this course introduces students to topics related to computational methods for design and analysis of performance-driven structural geometries, including: cable-net & membrane structures (tension), shell structures (compression), tensegrity structures (tension & compression), and bending-active structures (bending).",
        "semesters": 2,
        "prerequisites": "CIVL4332 or MECH3300"
    },
    "NURS1007": {
        "course_name": "Musculo-skeletal Health",
        "course_code": "NURS1007",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "NURS1007 introduces students to: anatomy, physiology & pathophysiology of the musculo-skeletal and integumentary systems; Nursing care of a minor who has sustained a musculo-skeletal injury, including associated pharmacological management, wound management and family centred care; Legal and ethical issues associated with informed consent of minors, and the legal and safe administration of pharmacological medications in relation to the case scenario; Prevalence and risk factors for musculoskeletal related health issues including cultural and socio-demographic factors, and the health education and promotional strategies that target risk factors.",
        "semesters": 2,
        "prerequisites": "NURS1001, NURS1002, NURS1003, NURS1004"
    },
    "MATH2070": {
        "course_name": "Natural Resource Mathematics",
        "course_code": "MATH2070",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "From Semester 2 2018, MATH2070 will be replaced by MATH3070.\nThe biggest challenge facing our planet is how to maintain and manage our natural systems such as fisheries, forestry and biodiversity in the face of habitat destruction, climate change, pollution and over harvesting. In this course you will learn how to apply deterministic differential and difference equation models to real world examples, and how to solve them using numerical methods in MATLAB. You will also learn how to quantify system uncertainties with the help of statistical and probabilistic methods. Students will be taught a range of methods which are employed in industry, research, consultancies and government to model complex natural resource problems. In the process, students will learn how certain fundamental mathematical concepts such as critical points, orthogonality, eigenvalues and singularity recur in different mathematical frameworks with different but, invariably, vitally important physical interpretations.\nArchived offerings\n\n\n\nCourse offerings\nLocation\nMode\nCourse Profile\n\n\n\n\n\n\n\tSemester 2, 2017\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2016\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2014\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2013\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2012\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n",
        "semesters": 0,
        "prerequisites": "(STAT1201 or STAT1301), (MATH1052 or MATH1072)"
    },
    "PUBH7618": {
        "course_name": "Cost Effectiveness in Health and Medicine",
        "course_code": "PUBH7618",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine & Biomedical Sciences",
        "school": "Public Health School",
        "description": "This course is taught using lectures and exercises. Assessment is based on a set of tutorial questions (answers due 1 week after close of the workshop) and a take-home exam (due I month after close). The course will expand on concepts learnt in Health Economics and Evaluation & will explore some of the more advanced methodological issues inherent in economic evaluation of health care interventions. The course will focus on practical application with particular attention devoted to the usefulness & limitations of cost-effectiveness analysis as a technique of economic appraisal. The lectures/tutorials for this course will be taught in a block of 5 days and students must be available to attend every day during that period. This course may not be offered if the enrolment is less than 10 students. Enrolment is limited to 25 participants.",
        "semesters": 0,
        "prerequisites": ""
    },
    "SPAN6340": {
        "course_name": "Advanced Spanish Language Skills",
        "course_code": "SPAN6340",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Analysis & practice of academic writing in Spanish. Enrolment in this course is restricted to students in the BA Honours.",
        "semesters": 3,
        "prerequisites": "Major in Spanish + permission of Head of School"
    },
    "LAWS7152": {
        "course_name": "Financial Services Regulation",
        "course_code": "LAWS7152",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "A study of aspects of corporations and securities law concerned with the nature of corporate securities, prospectuses, corporate capital restructuring, the securities industry, duties and liabilities of stockbrokers and advisers, prohibited practices and takeovers.",
        "semesters": 0,
        "prerequisites": "LAWS7000 or LAWS7936"
    },
    "MATH6035": {
        "course_name": "Advanced Mathematics Research Project",
        "course_code": "MATH6035",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "",
        "school": "",
        "description": "Supervised project on research topic in mathematics, approved by the Head of Mathematics. Each student will select a supervisor and project topic through negotiation with academic staff. The research will be presented in a thesis, and in a seminar. Students enrolling in course with #4/#4 split enrol in MATH6031 if commencing in semester 1 or MATH6032 if commencing in semester 2. Students enrolling in course with #2/#6 split enrol in MATH6033 if commencing in semester 1 or MATH6034 if commencing in semester 2. Students enrolling in course with #6/#2 split enrol in MATH6035 if commencing in semester 1 or MATH6036 if commencing in semester 2. Students must enrol in the same course code in 2 semesters.",
        "semesters": 0,
        "prerequisites": "Completion of #48 of BAdvSc(Hons) degree"
    },
    "FINM7407": {
        "course_name": "Financial Institutions and Markets",
        "course_code": "FINM7407",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Provides primarily an overview of the operation of financial institutions including risk management and profitability, as well as an overview of financial markets.",
        "semesters": 3,
        "prerequisites": "FINM7065 or 7401 or 7805"
    },
    "CHIN4666": {
        "course_name": "Translation and interpreting for Science, Engineering and Technology",
        "course_code": "CHIN4666",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "Languages & Cultures School",
        "description": "This course introduces students to translation and interpreting between English and Chinese for science, engineering and technology. It includes translation and interpreting skills, contextual knowledge, and research skills involved in doing T&I for SET. It also covers readings and case studies of T&I in SET.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MGTS7905": {
        "course_name": "Strategic Analysis and Implementation",
        "course_code": "MGTS7905",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course investigates the concepts & techniques of strategic analysis and implementation at the business and corporate levels. Specific concepts examined include industry and environment analysis; business strategy analysis, organisation performance analysis; capabilities analysis; gap analysis; business and corporate strategic options; strategic decision making; implementation; corporate strategic analysis; mergers & acquisitions; and strategic alliances.",
        "semesters": 1,
        "prerequisites": ""
    },
    "OCTY7826": {
        "course_name": "Occupational Therapy for Children & Youth II for Graduates",
        "course_code": "OCTY7826",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "This course introduces students to occupational therapy practice for children & youth with social-emotional challenges, those at risk of developing mental health issues, & those with developmental or acquired neurological conditions that impact on their occupational performance & participation. Frames of reference for addressing these issues will be introduced along with appropriate information gathering methods, interventions & service provision. It will also address the participation of children, youth & their families in relation to their home, school & community environments.",
        "semesters": 2,
        "prerequisites": "OCTY7811, OCTY7823, OCTY7824, OCTY7825, OCTY7829"
    },
    "TRFCR1006": null,
    "MECH2700": {
        "course_name": "Engineering Analysis I",
        "course_code": "MECH2700",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Mech & Mine Engineering School",
        "description": "Modelling & analysis in mechanical engineering. Computer-assisted problem solving: calculation, simulation & numerical methods.",
        "semesters": 2,
        "prerequisites": ""
    },
    "GEOS3107": {
        "course_name": "Plants, People and the Environment",
        "course_code": "GEOS3107",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl, Social Science School",
        "description": "This course will examine how human activity and/or natural climatic variability has shaped the vegetated landscapes of the planet. Key aspects will include: Palaeoecological and archaeobotanical techniques; the relative role people and natural climatic variability played in ecosystem change; the geography of food, i.e. how and where our staple crops and livestock arose, their subsequent patterns of dispersal, and the environmental impacts of food production; and the impacts that future environmental change will have on vegetated landscapes. Case studies will be used to illustrate these topics from a variety of Australian and international contexts.",
        "semesters": 2,
        "prerequisites": ""
    },
    "HPRM3000": {
        "course_name": "Health Promotion: Perspectives & Practice",
        "course_code": "HPRM3000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "Introduction to the science and art of health promotion through evidence-based individual, community and societal approaches for improving health and preventing illness, including needs assessment, priority setting, and planning and developing health promotion initiatives.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PLAN7116": {
        "course_name": "Transport Planning",
        "course_code": "PLAN7116",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "This is an introductory course on transport planning and management of transport systems. The course covers basic concepts on the interaction between transport and land use as well as with the overall urban context, integrated transport planning process, transport data and modelling, transport economics and finance, travel behaviour and travel demand management, public transport planning, active transport planning.",
        "semesters": 2,
        "prerequisites": ""
    },
    "JAPN3002": {
        "course_name": "Continuing Japanese 1B",
        "course_code": "JAPN3002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course is for A and B stream students and should be taken either at the same time as JAPN2101, or in the following year. The course content is complementary to JAPN2101, focussing on developing students' ability to use the Japanese language, for example, to discuss an issue or design and conduct a survey, while consolidating their knowledge and accurate use of the language.",
        "semesters": 1,
        "prerequisites": "JAPN2100 or equivalent"
    },
    "ENVM7003": {
        "course_name": "Applied Research Methods",
        "course_code": "ENVM7003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Introduction to broad range of research techniques relevant to environmental managers. Research process, types of research, research validity and reliability, survey research and questionnaire design, sampling, quantitative and qualitative analysis, decision making techniques (e.g. cost-benefit analysis; multi-criteria analysis) and ethics in research.",
        "semesters": 2,
        "prerequisites": ""
    },
    "BIOT6011": {
        "course_name": "Research Project B",
        "course_code": "BIOT6011",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "description": "Individual laboratory research project. Undertaken either within the Univerity or in an industry setting with co-supervision by an academic staff member.",
        "semesters": 7,
        "prerequisites": "Permission of Director, Biotechnology Program"
    },
    "MKTG7504": {
        "course_name": "Service Strategy",
        "course_code": "MKTG7504",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Special marketing requirements of service & not-for-profit organisations. Relevance & limitations of marketing theories & concepts, practical implications for Australian organisations. Understanding services, classifications, designing & delivering services, importance of people in organisation, quality service, managing customer service, developing strategies.",
        "semesters": 2,
        "prerequisites": ""
    },
    "LAWS7104": {
        "course_name": "Criminal Law and Procedure A",
        "course_code": "LAWS7104",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "Involves the study of the elements and aims of criminal law, classification of offences, general doctrines, general defences, homicide and defences, non-fatal offences against the person and defences, offences against property.",
        "semesters": 0,
        "prerequisites": ""
    },
    "BIOC7025": {
        "course_name": "Advanced Research Project & Seminar",
        "course_code": "BIOC7025",
        "duration": "Two Semesters",
        "units": 16,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "description": "Extended and in-depth laboratory or computer-based project involving research & analysis of a specific topic in molecular biology. The area of work may be the technology or business of molecular biology. Students must enrol in BIOC7022 if commencing in sem 1 & completing in sem 2 or BIOC7023 if commencing in sem 2 & completing in sem 1 the following year or BIOC7024 if commencing in sem 2 and completing in summer sem or BIOC7025 if commencing in summer sem & completing in sem 1 the following year.",
        "semesters": 4,
        "prerequisites": "Permission of Director, Postgraduate Molecular Biology Programs"
    },
    "AGRC6619": {
        "course_name": "Honours Research Project II",
        "course_code": "AGRC6619",
        "duration": "Two Semesters",
        "units": 12,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Design, implementation & presentation of research project relevant to student's program of study, with emphasis on defining the research issue, establishing methodology, undertaking appropriate analysis of data & drawing defensible conclusions.\nStudents commencing in sem 2 full-time enrol in AGRC6619 for 2 consecutive semesters.\nStudents commencing in sem 1 full-time enrol in AGRC6618 for 2 consecutive semesters.",
        "semesters": 0,
        "prerequisites": ""
    },
    "EDUC6755": {
        "course_name": "Accounting: Specialist Teaching Area",
        "course_code": "EDUC6755",
        "duration": "Two Semesters",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "This course is designed to challenge preservice teachers to use their knowledge, expertise and experience to design learning environments that will engage students in the learning process and cater for a variety of learning styles. Students will participate in an in-depth study of the current Accounting syllabus. Opportunities will be provided to develop appropriate teaching/learning strategies, activities, assessment instruments and resources for use in the classroom.\n\nThis course may not be offered if the enrolment is less than 10 students.",
        "semesters": 0,
        "prerequisites": ""
    },
    "PSYC7594": {
        "course_name": "Motivating & Leading in the Workplace",
        "course_code": "PSYC7594",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "This course develops knowledge of motivation and leadership in organisational settings. It covers traditional and contemporary theories of motivation and leadership, as well as new developments and applications of these topics. There is an emphasis on links between leadership and motivation and on using case studies and exercises to apply theory to organisational situations and problems.",
        "semesters": 0,
        "prerequisites": ""
    },
    "BIOT3009": {
        "course_name": "Quality Management Systems in Biotechnology: GMP, GLP, GCP",
        "course_code": "BIOT3009",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences, Medicine Faculty",
        "description": "This course will provide advanced teaching on Quality Management Systems (QMS) used within biotechnology, including GLP, GMP and GCP, as well as ISO17025 (General requirements for the competence of testing and calibration laboratories). Knowledge of these disciplines is essential for potential employees of the biotechnology sector. The course will be taught by persons who actively work within the sector and have helped pioneer the introduction of some of these standards in Australia.",
        "semesters": 1,
        "prerequisites": ""
    },
    "RELN2000": {
        "course_name": "The idea of the sacred: texts, places and festivals",
        "course_code": "RELN2000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "All the major religious traditions have texts, places or occasions that have been invested with 'sacrality'. Why should this be so? How did the Bible, the Buddhist canonical material, the Koran or the Veda become the sacred canons of their traditions? Why are Easter, the Kumbh Mela, Thaipusam or Hanukkah so significant for their participants? What compels pilgrims to travel great distances to have religious experiences? What does it mean when we call something 'sacred'? How does something - a text, a place, an event, or even a person - become sacred? This unit will explore these and related questions from the perspective of a variety of religious traditions.",
        "semesters": 1,
        "prerequisites": ""
    },
    "TRFCR1010": null,
    "FREN3210": {
        "course_name": "Textes et Modernite",
        "course_code": "FREN3210",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course aims to explore the concept of literary modernism in French literature of the 19th and 20th centuries. By spanning a broad period, the course will give students a global view of important literary movements while allowing close analysis of relationships and connections among the specific texts and authors studied.",
        "semesters": 1,
        "prerequisites": "FREN2120 or FREN3115 or permission of course coordinator"
    },
    "MICR3002": {
        "course_name": "Virology",
        "course_code": "MICR3002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences, Veterinary Science School",
        "description": "Viruses have been shown to infect all forms of life and this course provides the fundamental background for studying the way in which viruses interact with their hosts. Surprisingly these interactions may be beneficial as well as deleterious. The course will cover both sides of this dynamic interplay including virus disease in humans, animals and plants as well as molecular aspects of the nature of viruses, their evolution, replication, applications in genetic engineering and gene therapy, detection and control by both vaccines and antiviral strategies. The course will familiarize students with practical skills relevant to the isolation, purification and characterization of animal and plant viruses. These include tissue culture techniques and virus growth, as well as molecular aspects of the detection and study of viral genes and expressed proteins, and the application of virus vectors in cell biology and biotechnology.",
        "semesters": 1,
        "prerequisites": "MICR2000 or BIOC2000"
    },
    "PSYC3192": {
        "course_name": "Sensory Neuroscience",
        "course_code": "PSYC3192",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "The sensation of seeing, hearing, touching or smelling is a product of activity in your brain. Scientists who wanted to work out how this activity could generate conscious perceptual experiences established experimental Psychology as a discipline. In this course we will appraise contemporary evidence concerning these links. Students will be taught how to critically appraise empirical evidence, establish research hypotheses, and how to test those hypotheses.",
        "semesters": 1,
        "prerequisites": ""
    },
    "SOCY6006": {
        "course_name": "Honours Research Thesis Part A",
        "course_code": "SOCY6006",
        "duration": "Four Semesters",
        "units": 10,
        "faculty": "Humanities and Social Sciences",
        "school": "Social Science School",
        "description": "Independent research and thesis preparation under the guidance of a supervisor. Full-time students enrol in SOCY6005; part-time students enrol in SOCY6006.",
        "semesters": 0,
        "prerequisites": "Single major in Sociology or Criminology with a GPA of 5 or higher"
    },
    "LAWS7868": {
        "course_name": "International Commercial Arbitration Law",
        "course_code": "LAWS7868",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course deals in depth with the process of international commercial arbitration, which is one of the major growth areas of legal practice and possibly the most widely used dispute resolution method in international business.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PHTY7207": {
        "course_name": "Advanced Physiotherapy Practice in Geriatrics",
        "course_code": "PHTY7207",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Enables student to develop further expertise in a chosen area of gerontological clinical practice not covered by PHTY7205, PHTY7208 or PHTY7209..",
        "semesters": 0,
        "prerequisites": ""
    },
    "HLTH1000": {
        "course_name": "Professions, People and Healthcare",
        "course_code": "HLTH1000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Behavioural Sciences",
        "description": "Professions, People and Healthcare is a core course for students in the Faculty of Health and Behavioural Sciences (HaBS), as well as those with an interest in working in the Australian health and behavioural sciences sectors.\n\nThe philosophy of this 'common course' is for first year HaBS students to be provided with a foundational learning experience that is focussed on perspectives on health, our health system within a global context, healthcare practices and services that are person-centred and collaborative, and health trends and priorities. Each week, students will have the opportunity to work together in multiprofessional tutorials which will expose them to different perspectives on the course content. The multidisciplinary approach to the course delivery also aims to give students a beginning understanding of the range of roles within Australia's health system and how they contribute to the health and wellbeing of individuals and communities. Students will have an enhanced capacity to navigate the health landscape of the future and be better equipped for future roles in increasingly complex and changing workplaces, especially those that are multi- and interprofessional.\n\nHLTH1000 is offered using a 'flipped format'. Students will independently engage with online learning resources while having authentic learning experiences with peers and teaching staff in weekly tutorials. Students will have more flexibility to learn but it is expected that the associated workload is similar to a traditional course.\nArchived offerings\n\n\n\nCourse offerings\nLocation\nMode\nCourse Profile\n\n\n\n\n\n\n\tSemester 2, 2017\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n",
        "semesters": 2,
        "prerequisites": ""
    },
    "POLS2222": {
        "course_name": "Humanitarianism in World Politics",
        "course_code": "POLS2222",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Politic Sc & Internat Studies",
        "description": "Human security emerged in the 1990s as an alternative to the traditional state-based national security paradigm. It is based on the idea that individuals, rather than states, should be the primary referent point for security and consequently that the provision of security for civilian populations is a responsibility of both the state and the international state system. This pivotal shift is not without tensions and problems, the most significant of which is that threats to the individual may be significantly different than threats to the state and may even encompass the state itself.At the same time, the human security concept remains exposed to academic and policy debates around whether threats should be narrowly (the freedom from fear agenda) or broadly (the freedom from want agenda) defined. Thus the course will focus on these divisions and on how human security changes the role that different actors and the international community play in conflict; examining how conflict affects individuals -- including civilians, refugees, and internally displaced persons -- and how humanitarian actors respond; as well as recent developments at the UN level including the protection of civilians agenda and the Responsibility to Protect doctrine on humanitarian intervention.",
        "semesters": 2,
        "prerequisites": ""
    },
    "MIDW7200": {
        "course_name": "Advanced Practice Midwifery I",
        "course_code": "MIDW7200",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course will assist midwives to advance their health assessment skills across the continuum of midwifery care. Midwives will extend their knowledge of human sciences, develop advanced physical and behavioural assessment techniques, interpret diagnostic study results and evidence based resources and use clinical reasoning to formulate plans of care to address complex health related issues of the individual woman, baby and family.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PSYC2371": {
        "course_name": "The Science of Everyday Thinking",
        "course_code": "PSYC2371",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "This course explores the nature of everyday thinking. Why people believe weird things, how to deal with opinion change, and why expectations and emotions skew our judgements. We examine and debate topics such as subliminal persuasion, paranormal phenomena, alternative medicine, placebos and miracles. You will learn how to evaluate claims, understand why we consistently make the same kinds of \"irrational\" mistakes, and how to make better decisions.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ENVM3525": {
        "course_name": "Sustainable Business Practice",
        "course_code": "ENVM3525",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Environmental and social information in business strategy and decision processes, societal expectations and community licence to operate, intergenerational issues, business and industry life cycles, value chain analysis, and evaluating eco-efficiency outcomes.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ACCT7108": {
        "course_name": "Advanced Management Accounting and Control",
        "course_code": "ACCT7108",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Managerial accounting, planning & control systems. Divisional & managerial performance evaluation. Application of underlying conceptual frameworks in analysis of case studies in business & non-profit organisations.",
        "semesters": 0,
        "prerequisites": "ACCT7107"
    },
    "ENVM3001": {
        "course_name": "Principles of Wildlife Management",
        "course_code": "ENVM3001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Principles of wildlife management, social context, modes of population growth, ecological principles on which wildlife management relies, management of pests & critically endangered populations, adaptive management.",
        "semesters": 2,
        "prerequisites": ""
    },
    "BIOL2201": {
        "course_name": "Evolution",
        "course_code": "BIOL2201",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Biological Sciences School",
        "description": "\"Evolution\" provides an overview of the most significant evolutionary transitions in relation to the environmental changes associated with them, details the processes that contributed to these changes & thus develops an understanding of the principles of evolutionary biology. Human evolution is explored in relation to this background & in relation to the evolution of language & disease.",
        "semesters": 2,
        "prerequisites": "BIOL1020"
    },
    "MATH2401": {
        "course_name": "Mathematical Analysis and Advanced Topics",
        "course_code": "MATH2401",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Sequences & series of real functions. Mean value theorem, iterative procedures. Taylor's Theorem & error estimates. Criteria for integrability. Vector functions, continuity & differentials. Implicit & Inverse Function Theorems & applications. Selected advanced topics in modern mathematics from: Theory and applications of fixed points, introduction to geometry and topology.",
        "semesters": 1,
        "prerequisites": "MATH1071"
    },
    "ERTH7711": {
        "course_name": "Advanced Structural Geology",
        "course_code": "ERTH7711",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "(offered in semester 2 in even numbered years only) Geometric, kinematic and microstructural analysis of complexly deformed rocks, regions and shear zones. Field, mine and digial map techniques applied to real geological problems.",
        "semesters": 2,
        "prerequisites": "Permission of Head of School"
    },
    "ECON1010": {
        "course_name": "Introductory Microeconomics",
        "course_code": "ECON1010",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "Provides students with a practical understanding of the core economic principles that explain why individuals, companies and governments make the decisions they do, and how their decision-making might be improved to make best use of available resources.",
        "semesters": 7,
        "prerequisites": ""
    },
    "LING7001": {
        "course_name": "English Through Time and Space",
        "course_code": "LING7001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course explores the history of English across the centuries - from its Anglo-Saxon origins to the modern tongue; then looks globally at some of the many different varieties of English that are now in use around the world, including creoles. The course focuses in particular on social, cultural and political factors which have influenced the development of the language and how language changes to adapt to the needs and desires of its speakers.",
        "semesters": 2,
        "prerequisites": ""
    },
    "LAWS5189": {
        "course_name": "Islamic Law",
        "course_code": "LAWS5189",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "An introduction to the history and scope of Islamic law and the legal system including an examination of comparative issues relating to Islamic and western secular legal and constitutional thought. Topics include: pre-Islamic background; features of the Islamic legal system; sources, the theoretical and practical application of Islamic law; comparative issues and Islamic criminal law and procedure.",
        "semesters": 1,
        "prerequisites": "All Level 1 & 2 LAWS courses"
    },
    "WRIT7040": {
        "course_name": "Industry Internship",
        "course_code": "WRIT7040",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "This course allows student to undertake an internship and related work-integrated learning, or a research project on a topic decided in consultation with the course coordinator.",
        "semesters": 3,
        "prerequisites": ""
    },
    "BIOM3011": {
        "course_name": "Human Physiology & Pharmacology B2",
        "course_code": "BIOM3011",
        "duration": "One Semester",
        "units": 1,
        "faculty": "Medicine",
        "school": "Biomedical Sciences School",
        "description": "Continuing development of basis for understanding function of human body & use & effects of drugs in disease-oriented context. Integrated approach to respiratory system, ageing & chemotherapy.",
        "semesters": 2,
        "prerequisites": "BIOM1052"
    },
    "EDUC7603": {
        "course_name": "Contemporary Theories of Development and Learning",
        "course_code": "EDUC7603",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "This course engages pre-service teachers in an analysis of historical and recent developments in research that furthers our understandings of physical, social-emotional, and intellectual development. Critical knowledge and understanding of the science of learning, and the mind, drawing distinctions between psychological, biological and socio-cultural viewpoints, will be required. A particular focus of the course will be the developmental and contextual characteristics of students during early childhood, middle childhood and the adolescent years and how these may affect student learning and engagement. Pre-service teachers will demonstrate the application of knowledge and skills to practice by understanding the importance of the state of the learner for optimal learning and engagement. Consideration will be given to the importance of parent engagement in the educative process and strategies for maximising this engagement. This will include identifying strategies that are responsive to the learning strengths and needs of each student and that build a supportive, safe and inclusive educational environment.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PXPY7022": {
        "course_name": "Interpersonal Processes in Psychotherapy",
        "course_code": "PXPY7022",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine & Biomedical Sciences",
        "school": "",
        "description": "Introduction to theory & empirical literature relating to interpersonal processes in psychotherapy. Designed to provide basis for more specialised studies in psycho-therapy technique which are offered in second year.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MGTS7976": {
        "course_name": "Effective Stakeholder Engagement",
        "course_code": "MGTS7976",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "The course develops students' knowledge, understanding and skills to engage with diverse stakeholders and to design and manage effective stakeholder engagement processes. The course includes the principles of engagement, practical processes for conducting engagement and ways of enhancing engagement procedures to maximise the effectiveness of stakeholder relationships.The course is offered in internal and external modes. The external offering involves independent study but also regular contact with the lecturer. The minimum total enrolment required, including both modes, is 15.\nArchived offerings\n\n\n\nCourse offerings\nLocation\nMode\nCourse Profile\n\n\n\n\n\n\n\tSemester 2, 2017\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2017\t\n\nGatton\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2016\t\n\nGatton\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2016\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2015\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2015\t\n\nGatton\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2015\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2014\t\n\nGatton\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2014\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2014\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2013\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2013\t\n\nRemote\nIntensive\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2012\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2012\t\n\nRemote\nIntensive\nProfile unavailable\n\n\n\n\n\n\tSemester 2, 2011\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2011\t\n\nRemote\nIntensive\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2010\t\n\nExternal\nExternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2010\t\n\nRemote\nIntensive\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 2, 2009\t\n\nRemote\nIntensive\n\n\tCourse Profile\n\n\n\n\n",
        "semesters": 2,
        "prerequisites": ""
    },
    "KORN3011": {
        "course_name": "Written Korean IIB",
        "course_code": "KORN3011",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course consolidate work done in KORN2003 and focuses on the development of reading comprehension of intermediate level texts and practicing of a wide range of writing from simple to more complex narrative forms and genres such as email writing by using various expression and increasingly complex grammatical structures. The course will broaden the students' knowledge of vocabulary and grammar use and enhance the ability to translate between the two languages (Korean/English). Materials are drawn from textbooks, authentic print, and internet sources.",
        "semesters": 2,
        "prerequisites": "KORN2003"
    },
    "ORAL2070": {
        "course_name": "Essentials of Oral Health Therapy I",
        "course_code": "ORAL2070",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "Provides fundamental training in clinical aspects of oral health therapy. Integration of dental hygiene practice & dental therapy practice, radiography, dental ergonomics, oral health promotion, reflective learning, collaborative team skills & professional communication. Emphasis on risk assessment, prevention of oral diseases, maintenance of oral health in children & adults & management of specific oral health problems. Builds on material introduced in Year 1 & explores fundamental concepts in greater depth with emphasis placed on application of knowledge in the clinical setting & development of basic clinical skills in Oral Health Therapy. Knowledge & skills obtained will enable commencement of clinical practice in Dental Hygiene Practice & optimise clinical & professional learning in Year 2.",
        "semesters": 0,
        "prerequisites": "ORAL1030 + ORAL1050 + ORAL1060"
    },
    "AGRC6618": {
        "course_name": "Honours Research Project II",
        "course_code": "AGRC6618",
        "duration": "Two Semesters",
        "units": 12,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Design, implementation & presentation of research project relevant to student's program of study, with emphasis on defining the research issue, establishing methodology, undertaking appropriate analysis of data & drawing defensible conclusions. \nStudents commencing in sem 1 full-time enrol in AGRC6618 for 2 consecutive semesters.\nStudents commencing in sem 2 full-time enrol in AGRC6619 for 2 consecutive semesters",
        "semesters": 0,
        "prerequisites": ""
    },
    "PSYC7801": {
        "course_name": "Advanced Interpersonal Skills",
        "course_code": "PSYC7801",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk, Psychology School",
        "description": "This course will introduce students to the basic foundational knowledge and skills of counselling. Students will be introduced to the various foundational counselling skills through direct teaching and demonstrations as well as being given supervised practice in the performance of these skills and their integration into a respectful approach to counselling. A link between skills and theoretical underpinnings is an important part of the course. It encourages the student to consider the balance between the science and the practice of psychology, and the value of interviewing skills in the the process of assessment and case formulation. A satisfactory level of proficiency is expected before students can pass this course.",
        "semesters": 1,
        "prerequisites": ""
    },
    "FINM7406": {
        "course_name": "International Financial Management",
        "course_code": "FINM7406",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "The course extends financial decision-making to the international setting. Topics include the foreign exchange market, predicting exchange rate movements, hedging exposures with various derivative and other alternatives, the challenges of raising funds internationally and the process and documents of international trade. The course makes extensive use of case studies and there is an expectation that students will make recommendations to real life problems and justify their decisions. This is a challenging course with a significant theory content which requires seminar attendance and participation in addition to the appropriate independent study and thought to be successful.",
        "semesters": 3,
        "prerequisites": "FINM7065 or 7401 or 7805"
    },
    "SWSP4281": {
        "course_name": "Advanced Research and Evaluation in Health and Ageing",
        "course_code": "SWSP4281",
        "duration": "Two Semesters",
        "units": 4,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This #4 unit advanced research course builds on content covered in SWSP3303 Research in Social Work and Human Services (Research Preparation course - Year 3).There is a strong emphasis on the application of research methods to complete a small scale independent research project across the two semesters. Students will complete an individual project and produce a 6,000-8,000 word research report over Semester 1 and Semester 2 in Year 4. The research project involves the design, implementation, analysis and interpretation of data and an oral and written presentation of the project. The approach taken is blended learning with a combination of workshops, simulated learning and peer and group supervision to support students to gain the necessary knowledge and skills to complete the project.",
        "semesters": 1,
        "prerequisites": "SWSP3303 or equivalent"
    },
    "ECON7330": {
        "course_name": "Advanced Econometric Theory",
        "course_code": "ECON7330",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "This is an advanced course in econometric theory which builds upon ECON3330. The focus will be on theoretical foundations of econometrics, including the asymptotic theory behind M-estimators and likelihood-based inference, nonparametric and semiparametric econometrics.",
        "semesters": 2,
        "prerequisites": "ECON3310 or (3330 + 3320) or 2310"
    },
    "PHYS6502": {
        "course_name": "Advanced Physics Research Project",
        "course_code": "PHYS6502",
        "duration": "Two Semesters",
        "units": 10,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Advanced theoretical or experimental project in Physics or another field recommended by supervisor and approved by Head of Discipline. Students enrolling in course with #4/#6 split enrol in PHYS6501 if commencing in semester 1 or PHYS6502 if commencing in semester 2. Students enrolling in course with #6/#4 split enrol in PHYS6503 if commencing in semester 1 or PHYS6504 if commencing in semester 2. Students must enrol in the same course code in 2 semesters.",
        "semesters": 2,
        "prerequisites": ""
    },
    "COMP7860": {
        "course_name": "Computer Science Research Project",
        "course_code": "COMP7860",
        "duration": "One Semester",
        "units": 6,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "A research-based thesis course that offers students the opportunity to work on a comprehensive, individual project that demonstrates mastery of computer science. Topic to be agreed in consultation with a supervisor. The project will be of suitable complexity for results to be published for an expert audience. Students commencing in semester 1 enrol in COMP7861, students commencing in semester 2 enrol in COMP7862. Students wishing to complete thesis in a single semester enrol in COMP7860.",
        "semesters": 3,
        "prerequisites": "Permission Head of School"
    },
    "PHYS2082": {
        "course_name": "Space Science & Stellar Astrophysics",
        "course_code": "PHYS2082",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "This course develops a broad understanding of the physical processes taking place in stars and solar systems. Topics include the orbits of planets and binary stars, the classification of stars, stellar atmospheres, star formation, supernovae, white dwarf stars and neutron stars. There is particular emphasis on the scientific techniques used to explore solar systems.",
        "semesters": 2,
        "prerequisites": "PHYS1001 or PHYS1171"
    },
    "ANCH3030": {
        "course_name": "Special Topic in Roman History",
        "course_code": "ANCH3030",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "This course will present the student with an in-depth look at the achievements of a specific time period or society of the Roman world with special emphasis on the sources. The problems associated with any such study will be included.",
        "semesters": 0,
        "prerequisites": ""
    },
    "LEIS2005": {
        "course_name": "Adventure Recreation and Tourism",
        "course_code": "LEIS2005",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Tourism School",
        "description": "This course will provide a contemporary exploration of the motivations behind people's participation in adventure recreation and tourism in a variety of settings. Such a review will entail a consideration of the social and environmental responsibilities that go hand-in-hand with such activities when interacting with the natural environment. Students will also gain an overview of the leisure industry in Australia-particularly looking at the history and philosophy of the following sectors such as outdoor recreation, adventure recreation and tourism, and sport tourism.",
        "semesters": 0,
        "prerequisites": ""
    },
    "ELEC2003": {
        "course_name": "Electromechanics & Electronics",
        "course_code": "ELEC2003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "First principles introduction to electromagnetic fields & their applications in electrical machines. Physical models of semiconductor devices. Common electronic circuits using discrete semiconductor devices. Theoretical investigations, substantial case studies & laboratory experiments.",
        "semesters": 1,
        "prerequisites": "ELEC1000 or ENGG1300"
    },
    "LAWS2704": {
        "course_name": "Trusts and Equity I",
        "course_code": "LAWS2704",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course provides an introduction to the nature and history of the equitable jurisdiction and to the law of trusts, focusing upon the creation of trusts, both testamentary and inter vivos. It also considers the classification of trusts, and commercial and other applications of trusts.",
        "semesters": 1,
        "prerequisites": "All level 1 LAWS courses"
    },
    "PHYS7730": {
        "course_name": "Advanced Research Project",
        "course_code": "PHYS7730",
        "duration": "Two Semesters",
        "units": 6,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "This course provides an introduction to research in physics. Students choose a topic and a supervisor, and submit a written report by the end of semester. Students commencing in sem 1 enrol in PHYS7730 for sem 1 and sem 2; students commencing in sem 2 enrol in PHYS7731 for sem 2 and the following sem 1. Students completing in single semester enrol in PHYS7732.",
        "semesters": 1,
        "prerequisites": "Permission of Head of School"
    },
    "HIST2411": {
        "course_name": "Witchcraft & Demonology in Early Modern Europe & Its Colonies",
        "course_code": "HIST2411",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "Addresses social implications of belief in devils and witches. Examines writings on demonology, and impact of particular beliefs in relation to witch trials and question of women as witches.\nThis course may not run if there are fewer than 20 enrolments.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ENGY7117": {
        "course_name": "Energy Markets, Law and Policy",
        "course_code": "ENGY7117",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "This course provides an introduction to world energy markets,\nenergy policy and how governments regulate and intervene in these systems. Its context is the rapid\ntransformation that is underway and the key drivers for this. Students will gain an understanding of how\nvarious energy markets have changed over recent times and what challenges they bring to energy policy\ndevelopment. Energy regulations, policies and agreements from a range of countries will be examined.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ERTH3003": {
        "course_name": "Geomicrobiology",
        "course_code": "ERTH3003",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Geomicrobiological processes recorded in the Earth record and bacteria-mineral interactions in contemporary systems will be examined, including phenotypic methods for the analysis of prokaryotes, the factors affecting their community structure and function, and their relationship to geochemistry and mineralogy. Principles of inorganic geochemistry including an introduction to thermodynamics; applications of geochemistry and geomicrobiology to ore-forming processes, weathering and subsurface microbiology, e.g., acid mine drainage environments. ERTH3003 is strongly recommended for Geological Science majors, Environmental Microbiologists and Environmental Science majors.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ENGY4000": {
        "course_name": "Energy Systems",
        "course_code": "ENGY4000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School, Mech & Mine Engineering School",
        "description": "This course provides an overview of a wide range of energy systems including energy production from renewable (solar, wind, hydro, ocean, biomass) and non-renewable (fossil and nuclear) resources in the context of climate change and energy transitions. A range of engineering principles will be consolidated (i.e. mass & energy balances, thermodynamic cycles, process optimisation & power generation) in tandem with the application of sustainable development principles and business perspectives.",
        "semesters": 1,
        "prerequisites": "[(CHEE3020 or CHEE2002) and CHEE3004] or MECH3400"
    },
    "VETS5028": {
        "course_name": "Veterinary Anaesthesia, Diagnostic Imaging and Emergency and Critical Care",
        "course_code": "VETS5028",
        "duration": "Two Semesters",
        "units": 2,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "Students develop their clinical reasoning and technical skills in the practice of veterinary anaesthesia/analgesia, diagnostic imaging and emergency and critical care of both small and large animals, by participating in activities within the School of Veterinary ScienceÂ¿s clinical facilities.",
        "semesters": 1,
        "prerequisites": "VETS4010, VETS4022, VETS4035, VETS4034, VETS4012, VETS4021"
    },
    "ENGG7507": {
        "course_name": "Petroleum Project Economics and Decision Making",
        "course_code": "ENGG7507",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "[Taught in intensive mode over a 5 day period with assessment following after this.] \nThe aim of this module is to: Understand the economic concepts involved in project evaluation. Understand the value of investments as defined within a fiscal system. Evaluate risks associated with economic decisions.",
        "semesters": 2,
        "prerequisites": ""
    },
    "CIVL7170": {
        "course_name": "Advanced Sustainable Built Environment",
        "course_code": "CIVL7170",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "Engineering a sustainable built environment (e.g., buildings, precincts, cities) requires the ability to quantify a wide range of physical, chemical and biological processes governing sustainable performance. This course develops appropriate skills to model transport of energy and mass in the built environment. Specifically students will learn how to dynamically model flows in the context of: (1) urban air and water quality, (2) heat and mass exchanges between a building and the surrounding environment (including ground heat exchange), and (3) waste management. Students will be introduced to the critical assessment of sustainable performance from a `cradle-to-graveÂ¿ perspective, including the role of quantitative methods. Approaches to assessing sustainable performance of a range of existing and emerging construction materials are also critically reviewed and applied.",
        "semesters": 2,
        "prerequisites": "CIVL4180"
    },
    "HOSP7051": {
        "course_name": "Global Hospitality Operations",
        "course_code": "HOSP7051",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course aims to prepare students for careers within the international hospitality industry by critically examining the management of key operational departments. The primary focus of study is operations management in the international hotel industry. Insights into other significant and emerging hospitality sectors, including casinos and gaming, spas and resorts and the cruise industry are also investigated. Students will develop advanced knowledge and desirable attributes applicable to the key operational functions via engagement with a variety of departmental executives.",
        "semesters": 6,
        "prerequisites": ""
    },
    "ADVT7507": {
        "course_name": "Digital Advertising Strategy",
        "course_code": "ADVT7507",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course introduces students to marketing and advertising processes for creating value and managing consumers in expanding electronic, interactive, and networked environments. In this subject students will examine marketingÂ¿s role in developing solutions that leverage consumers engagement with technological platforms and gain practical insight into the application of technology in product and service design, advertising, branding and communications, and e-marketing strategy.",
        "semesters": 1,
        "prerequisites": ""
    },
    "SWSP7046": {
        "course_name": "Human Services Practice with Indigenous Australians",
        "course_code": "SWSP7046",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course is no longer offered.\nStudents who require this course for their current program should enrol in INDH7107.\n\nSocial Workers can expect to interact with clients at the intersections between government and community, and at the individual, group, and organisational level. While this field of practice can encompass broadly different areas of social experience, it is likely to bring the practitioner into contact with people from differing ethnic and cultural groups. By canvassing topical issues relating to Australian Indigenous people, this course aims to prepare Social Work graduates to apply their knowledge appropriately and ethically as professional practitioners in this field.\nArchived offerings\n\n\n\nCourse offerings\nLocation\nMode\nCourse Profile\n\n\n\n\n\n\n\tSemester 2, 2017\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n",
        "semesters": 0,
        "prerequisites": ""
    },
    "MRES7008": {
        "course_name": "Functional Magnetic Resonance Imaging",
        "course_code": "MRES7008",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "Interrogating sensory, motor & cognitive processes with functional magnetic resonance imaging (fMRI). Neural & vascular mechanisms contributing to the fMRI signal. Procedures involved in conducting fMRI investigations. Issues in experimental design & analysis. Relevance to clinical diagnosis. Current research status.",
        "semesters": 2,
        "prerequisites": "Admission to Magnetic Resonance Technology postgraduate program suite + (MRES7001 or MRES7100) + MRES7004"
    },
    "HOSP3004": {
        "course_name": "Strategic Hospitality Management",
        "course_code": "HOSP3004",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This capstone course analyses management issues and challenges specific to the hospitality industry. It provides a framework for evaluating management theories and practices as they apply to customer-centric, geographically diverse hospitality businesses and organisations.",
        "semesters": 2,
        "prerequisites": ""
    },
    "STAT7608": {
        "course_name": "Categorical Data & Generalised Linear Models",
        "course_code": "STAT7608",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Public Health School",
        "description": "Description: This course begins with conventional methods for contingency tables and then introduces generalised linear models (GLM's)(exponential family of distributions; parameter estimation and inference for GLM's). This is followed by binary, nominal and ordinal logistic regresion and poisson regression. This course is part of the Biostatistics Collaboration of Australia. If you are not enrolled in a Biostatistics program at UQ, please contact the Program Director, Dr Mark Jones, to seek permission before enrolling.",
        "semesters": 2,
        "prerequisites": "PUBH7600 + STAT7604 + STAT7614"
    },
    "HIST1600": {
        "course_name": "History of the Future",
        "course_code": "HIST1600",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "The course will examine the major force that has been driving recent world history - globalization - from a historical perspective. How did the world become more \"global\"? What can history tell us about the likely trends of the future? Major themes will include: capitalism, multi-national corporations, environment, war and terrorism, development and poverty, and anti-globalization movements .",
        "semesters": 0,
        "prerequisites": ""
    },
    "OHSS7005": {
        "course_name": "Occupational Health & Safety Management Systems",
        "course_code": "OHSS7005",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "This course has been designed to provide students with high level skills and knowledge to develop, implement, evaluate and manage OHS Management Systems. The course also prepares students to undertake OHS related audits by evaluating and utilizing a variety of audit tools and criteria. Using a combination of underpinning theory and current practice the course will explore the various aspects of OHS management systems; including organisational theory, behaviour based safety, management system frameworks, the history of OHS management systems and future directions.",
        "semesters": 2,
        "prerequisites": ""
    },
    "FIRE7512": {
        "course_name": "Research Thesis",
        "course_code": "FIRE7512",
        "duration": "Two Semesters",
        "units": 0,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "This course provides students with an opportunity to apply all the knowledge and skills developed across the whole course to a research or real-world problem. Students will undertake a research project or a program of independent enquiry under the direction of an academic or research staff member.",
        "semesters": 2,
        "prerequisites": "FIRE3700 or ENGG3700"
    },
    "NEUR7006": {
        "course_name": "Molecular and Cellular Neuroscience",
        "course_code": "NEUR7006",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine & Biomedical Sciences",
        "school": "Biomedical Sciences School",
        "description": "Molecular and Cellular Neuroscience is concerned with cell and molecular biology of the neuron. Advanced treatment of the following specific topics will be given by selected research experts: cytology of the neuron; synthesis and trafficking of neuronal proteins; ion channels; G-Protein receptors; synaptic transmission; trans-synaptic signalling; modulation of synaptic transmission; and molecular pathological processes underlying neural disorders. \nStudents who do this course will be given an up-to-date understanding of how the nervous system works at its most fundamental level. It will also provide the latest knowledge on our understanding of the cellular and molecular basis of some key nervous system disorders.",
        "semesters": 0,
        "prerequisites": ""
    },
    "HPRM1100": {
        "course_name": "Introduction to Health Promotion Principles & Strategies",
        "course_code": "HPRM1100",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "This course provides an introduction to the principles of health promotion and the strategies used to promote health to individuals, to groups in specific settings such as schools and worklplaces, and to whole communities. The course will develop and extend students' understanding of public health principles, human behaviour and determinants of health, to explore recent advances in the science and art of health promotion.",
        "semesters": 2,
        "prerequisites": ""
    },
    "STAT7012": {
        "course_name": "Designs of Factorial Experiments",
        "course_code": "STAT7012",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Factorial designs common in Science, Technology and Engineering with application in Food Science and Technology. The principles and techniques of design and ANOVA of full and partial factorial, Taguchi and mixture experiments are taught on the basis of experiments in food physical assessment, quality control and the assessment of process performance.",
        "semesters": 0,
        "prerequisites": ""
    },
    "ANAT1012": {
        "course_name": "Regional Anatomy",
        "course_code": "ANAT1012",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Biomedical Sciences School",
        "description": "Regional anatomy of the human body. An integrated approach focusing on the skeletal, muscular & nervous systems, particularly of the limbs & back.",
        "semesters": 2,
        "prerequisites": "ANAT1020"
    },
    "PXMH7067": {
        "course_name": "Independent Mental Health Project A",
        "course_code": "PXMH7067",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Medicine Faculty",
        "description": "This course provides students with basic training in preparation and planning to successfully undertake an independent research project. Students are required to formulate a research question, undertake a literature review and design and write up a research project. The size of the research project will be limited so that it can be completed in one semester. Students will receive intensive training in research design and participate in fortnightly group supervision throughout the duration of their projects. They also have access to a tutor who can provide advice as required. It is however expected that the student will demonstrate capacity to work independently.",
        "semesters": 3,
        "prerequisites": ""
    },
    "ORAL2010": {
        "course_name": "Community Oral Health",
        "course_code": "ORAL2010",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "To provide individial & community perspectives of oral disease experience as well as contemporary philosophies & methods of oral disease prevention, as a scientific basis for clinical & community practice.",
        "semesters": 0,
        "prerequisites": "ORAL1050 + 1060"
    },
    "LAWS2701": {
        "course_name": "Criminal Law: Process and Procedure",
        "course_code": "LAWS2701",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course examines procedural criminal law and demonstrates how the rules governing criminal procedure are integral to a fair and efficient criminal justice system.",
        "semesters": 2,
        "prerequisites": "LAWS2700"
    },
    "ENGY7114": {
        "course_name": "Professional Project",
        "course_code": "ENGY7114",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "Students are required to complete a professional project (4 course equivalence) in their chosen field of study before the end of the third semester. Students will be encouraged to select a suitable project or a dissertation topic upon enrolling, ideally with a suitable industry partner, and to continuously consider their topic throughout the program, adding value from the different courses they undertake.",
        "semesters": 2,
        "prerequisites": ""
    },
    "PSYC7990": {
        "course_name": "Applied Psychology Dissertation",
        "course_code": "PSYC7990",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Social & Behavioural Sciences",
        "school": "Psychology School",
        "description": "NOT OFFERED IN 2011.The dissertation will be a 10,000 word document and will consist of a typical thesis in psychology (i.e., introduction, method, results, discussion). Each student's topic must be approved by the program director and should be field-based. \nStudents commencing in semester 1 enrol in PSYC7800 for two semesters. Students commencing in semester 2 enrol in PSYC7990 for two semesters.",
        "semesters": 0,
        "prerequisites": ""
    },
    "CHEE3205": {
        "course_name": "Metallurgical Process Modelling",
        "course_code": "CHEE3205",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "Introduction to numerical modelling & process control that is directly applicable to the mineral processing industry. Includes use of commercial software packages.",
        "semesters": 0,
        "prerequisites": "MINE2201 and CHEE3002 and CHEE3003"
    },
    "AGRC1015": {
        "course_name": "Knowledge Management in Natural and Agrifood Systems",
        "course_code": "AGRC1015",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Foundation course on accessing, organizing, using and presenting scientific information for knowledge creation and problem solving in natural and agrifood systems.",
        "semesters": 0,
        "prerequisites": ""
    },
    "INFS1200": {
        "course_name": "Introduction to Information Systems",
        "course_code": "INFS1200",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Information systems analysis, design and implementation, relational database technology, data modelling, data querying using SQL, building a small scale information systems using a relational database management system.",
        "semesters": 3,
        "prerequisites": ""
    },
    "FREN3380": {
        "course_name": "Identites francaises et francophones",
        "course_code": "FREN3380",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Taught in French, this course allows students to study a variety of French language texts in order to gain insights into how issues relating to identity (nationality, ethnicity, gender, sexuality etc) influence cultural production across various genres.",
        "semesters": 2,
        "prerequisites": "FREN3111 or FREN3112"
    },
    "VETS1018": {
        "course_name": "Veterinary Professional Foundations",
        "course_code": "VETS1018",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "This course provides a general introduction to the veterinary profession, to evidence-based veterinary medicine and to research skills for veterinary scientists and addresses a range of foundational topics that underpin the skills, knowledge and values of veterinarians.",
        "semesters": 1,
        "prerequisites": ""
    },
    "TOUR7071": {
        "course_name": "Professional Consultancy Project II",
        "course_code": "TOUR7071",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course offers a capstone experience that provides students with the opportunity to conduct a project focussed on a real world industry problem or opportunity in a field related to their area of study. Projects are expected to address specific issues and problems that are of practical relevance to the industry and that explicitly elaborate on themes from other courses in the program. Students will examine themes in the context of the problems and challenges facing the industry, undertake a thorough analysis of appropriate data, and then suggest solutions or options that might assist the industry in moving forward. Student projects will be supported by an industry mentor.\n\nStudents commencing in semester 1 enrol in TOUR7071 in both semesters. Students commencing in semester 2 enrol in TOUR7070 in both semesters.",
        "semesters": 1,
        "prerequisites": "#8 of study"
    },
    "AGRC1040": {
        "course_name": "Food for a Healthy Planet",
        "course_code": "AGRC1040",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "The course addresses a pertinent challenge of humankind: how to feed 12 billion people while maintaining the integrity and function of our planet. The course confronts participants with contrasting viewpoints for a nuanced understanding of the multidimensional aspects of food consumption and production. Course participants will explore the food debate as critical consumers and with view of the science behind innovation of food and food systems, locally and globally. The course challenges participants to map the future of food and agriculture. With an emphasis on scientific discussion, small-group mentoring, scientific literacy and communication skills, and networking with world-class researchers, AGRC1040 delivers an authentic learning experience.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PUBH2007": {
        "course_name": "Health Research Methods",
        "course_code": "PUBH2007",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Public Health School",
        "description": "This course will introduce the main statistical methods used in health care research.",
        "semesters": 2,
        "prerequisites": ""
    },
    "EDUC7205": {
        "course_name": "Development in Multiple Contexts",
        "course_code": "EDUC7205",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "This course provides a framework for understanding the development of persons with disabilities. The particular focus is on the implications of recent ideas about individual differences, human variation and variability for policy and practice in education, psychology and other areas of human service delivery to persons with disabilities and their families.\n\nThis course may not be offered internally if the enrolment is less than 10 students.",
        "semesters": 2,
        "prerequisites": ""
    },
    "MEDI4018": {
        "course_name": "Clinical Skills",
        "course_code": "MEDI4018",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine & Biomedical Sciences",
        "school": "",
        "description": "This course covers clinical skills from all rotations in years 3 and 4 including Medicine in Society, Surgery, Mental Health, General Practice, Medicine, Obstetrics and Gynaecology, Paediatrics and Child Health, Specialties I and Specialties II.",
        "semesters": 0,
        "prerequisites": ""
    },
    "NURS7401": {
        "course_name": "Introduction to Nursing Practice in Chronic Disease Management and Palliative",
        "course_code": "NURS7401",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course will introduce the student to the principles of symptom management in people with chronic disease and/or life-limiting illness (LLI). The focus is on gaining knowledge of the nursing care of pain and other common symptoms in this field of study. Students will examine the process of self-management by people with chronic disease and the development of care plans for people with life-limiting illness. The course prepares students for the practice of advanced nursing in the field of chronic disease management and palliative care, and lays the foundation for further study in this field.",
        "semesters": 1,
        "prerequisites": ""
    },
    "MGTS7095": {
        "course_name": "Leadership Workshop",
        "course_code": "MGTS7095",
        "duration": "One Semester",
        "units": 1,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "This course is not offered in 2013. \nThe course focuses on the key aspects of leadership & career development. Students get a clearer appreciation of their personal leadership style & their career goals.\nArchived offerings\n\n\n\nCourse offerings\nLocation\nMode\nCourse Profile\n\n\n\n\n\n\n\tSemester 2, 2012\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2011\t\n\nSt Lucia\nWeekend\n\n\tCourse Profile\n\n\n\n\n\n\tSemester 1, 2010\t\n\nSt Lucia\nInternal\n\n\tCourse Profile\n\n\n\n\n",
        "semesters": 0,
        "prerequisites": ""
    },
    "AGRC6642": {
        "course_name": "Postgraduate Advanced Topic III",
        "course_code": "AGRC6642",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "An advanced piece of work in a specialist area relevant to the student's program & conducted under the supervision of a member of academic staff.",
        "semesters": 4,
        "prerequisites": ""
    },
    "SWSP7297": {
        "course_name": "Family Therapy: Life Stages and Contexts",
        "course_code": "SWSP7297",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "NOT OFFERED IN 2011.\nTo enrol in this course, students must have completed an interpersonal skills training course. Please contact the School of Social Work and Human Services for further information.\nExamines the family as both historical entity and evolving system. Includes the family therapy conceptualization and treatment of common difficulties in family contexts. Explores history, family life cycles, formation variations, socio-political critique, sexual abuse/assault, domestic violence, mental illness, behavioural difficulties. Course will only be offered if enrolments exceed 15 students\n\nThis course will not be offered in 2010. It is unlikely to be offered in future semesters. Please contact the School of Social Work and Human Services if you require further advice.",
        "semesters": 0,
        "prerequisites": ""
    },
    "BIOT8007": {
        "course_name": "Biotechnology Thesis",
        "course_code": "BIOT8007",
        "duration": "Two Semesters",
        "units": 16,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "description": "Major biotechnology research thesis. Research to be in a technology or business/law/technology management area. May be undertaken in an industry or international location. All part-time students must enrol in BIOT8005 over 4 semesters. Students commencing full-time in sem 1 enrol in BIOT8003. Students commencing full-time in sem 2 enrol in BIOT8004. Students commencing full-time in Summer sem enrol in BIOT8007.",
        "semesters": 4,
        "prerequisites": "Permission of Biotechnology Program Coordinator"
    },
    "EDUC3250": {
        "course_name": "Junior Science Curriculum for HMS",
        "course_code": "EDUC3250",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "This course is designed to prepare Human Movement Studies students to be effective teachers of Junior Science (Years 7-10). This course will draw on the new Australian Curriculum: Science and place it in a Queensland context. EDUC3250 will emphasise the curriculum reform, content knowledge and curriculum construction aspects of Junior Science courses. EDUC3250 will also address the foundational policy and pedagogical practices underpinning the safe delivery of learning experiences within a typical school science laboratory and make links to the Senior Science curriculums explicit.",
        "semesters": 1,
        "prerequisites": "[BIOL1040 or BIOM1050] + PHYL1007"
    },
    "MECH4470": {
        "course_name": "Hypersonics & Rarefied Gas Dynamics",
        "course_code": "MECH4470",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Mech & Mine Engineering School",
        "description": "Hypersonic gas dynamics including: hypersonic equivalence, small perturbation, blunt body analysis, viscous flows, non-equilibrium flows, rarefied gas dynamics, satellite drag. For students who need to complete MECH4470, you will now enrol in AERO4470. This is a Course Code change only.",
        "semesters": 0,
        "prerequisites": "MECH3410"
    }
}