{
    "OCTY7120": {
        "course_name": "Utilising Technology Resources in Occupational Therapy Practice",
        "course_code": "OCTY7120",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "Provides graduates with an overview of current technology & information sources, update skills in using computer technology, & provide frames of reference for addressing the Human-Technology interface.",
        "semesters": 0,
        "prerequisites": ""
    },
    "DRAM6500": {
        "course_name": "Honours Research Thesis",
        "course_code": "DRAM6500",
        "duration": "One Semester",
        "units": 8,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "A supervised 15,000 word thesis which reports an original piece of research, grounded in knowledge of the theories and previous studies in the field, and completed in a manner consistent with research reporting in that field. This course is part of the Bachelor of Arts (Honours) Drama program.",
        "semesters": 3,
        "prerequisites": ""
    },
    "ENVH7008": {
        "course_name": "Environment Health Dissertation",
        "course_code": "ENVH7008",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "",
        "school": "",
        "description": "This is a supervised dissertation that allows students to consolidate and extend the knowledge and skills acquired during the coursework and apply these in a scientific way in the environmental health context. This dissertation can form the basis of a paper publishable in a national or international journal.",
        "semesters": 0,
        "prerequisites": "Have completed 8 units of coursework, including 4 units of Part A courses, with a minimum Grade Point Average (GPA) of 5.5"
    },
    "NEUR3001": {
        "course_name": "Molecular & Cellular Neuroscience",
        "course_code": "NEUR3001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Biomedical Sciences School, Chemistry & Molec Biosciences",
        "description": "Introduces aspects of molecular & cellular neuroscience through lectures tutorials, presentations & SDLs. Part 1 will provide the basic information & Part 2 will place this information in the context of current developments in molecular neuroscience & neurochemistry.",
        "semesters": 1,
        "prerequisites": "BIOM2011 + BIOL2200"
    },
    "SCIE3240": {
        "course_name": "Introduction to Research in Biology",
        "course_code": "SCIE3240",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Biological Sciences School",
        "description": "Students undertaking this course will have a unique opportunity to develop core research skills relevant to a wide spectrum of biological research, including written and oral communication, skills in making scientific observations, and recording and analysing data by participating in an individual or group research project associated with a discipline of interest to them.",
        "semesters": 3,
        "prerequisites": ""
    },
    "NURS7502": {
        "course_name": "Rural and Remote Nursing: High Acuity Practice",
        "course_code": "NURS7502",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course is designed to further develop the student's knowledge and management of specific health issues prevalent in rural and remote communities and the nursing approach required to provide care. The management of selectied high acuity health issues, including but not limited to, medical emergencies, chronic disease, palliative care, children's and Indigenous health will be explored. The legislative, legal and ethical constructs governing advanced nursing practice are also investigated along with professional and contemporary issues.",
        "semesters": 2,
        "prerequisites": ""
    },
    "CIVL4331": {
        "course_name": "Advanced Structural Engineering",
        "course_code": "CIVL4331",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "This course was replaced by CIVL4332 and CIVL4333\n\nPrestressed concrete structures, analysis of prestressed concrete beams, design of simple prestressed concrete bridges and portal frames, Design of FRP plated reinforced concrete members, Design of FRP plated steel-concrete composite members.",
        "semesters": 0,
        "prerequisites": "CIVL2360 + CIVL2340 +CIVL3340 + CIVL3350"
    },
    "CIVL4516": {
        "course_name": "Civil Design III",
        "course_code": "CIVL4516",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "Advanced civil engineering design projects; philosophy of design & selection of systems; risk assessment; integrated design primarily focussing on hydraulics, coastal, environmental, geomechanics and transport engineering.\n[Note: students will be required to meet costs associated with copying of design reports prior to submission.]",
        "semesters": 2,
        "prerequisites": "CIVL3210 and CIVL3140 and CIVL3420"
    },
    "LAND7009": {
        "course_name": "Soil and Growth Media Management",
        "course_code": "LAND7009",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "This course is intended to provide students with an overview of the role that soil plays in the environment. This independent study course is intended to introduce graduate students to key soil science concepts in preparation for independent researches and/or further studies. This course addresses: properties of soils and other mineral-based media (mine spoil, waste rock, tailings); the impacts of soil physical and chemical properties on plant growth and vegetative community development and sustainability; soil sampling strategies; trace and toxic elements, organic pollutants and soil amendments, and nutrient management for the development of a favourable plant root zone.",
        "semesters": 2,
        "prerequisites": ""
    },
    "LING6110": {
        "course_name": "English: History, Change & Variation",
        "course_code": "LING6110",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "Languages & Cultures School",
        "description": "Provides overview of historical development of English from Anglo-Saxon to present day. Particular focus on development of different varieties of English around the world.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MEDI3010": {
        "course_name": "Mental Health (Honours)",
        "course_code": "MEDI3010",
        "duration": "One Semester",
        "units": 3,
        "faculty": "Medicine & Biomedical Sciences",
        "school": "",
        "description": "The Mental Health Rotation will be conducted in mainstream mental health services, such as community, public and private hospitals or fully integrated services. The clinical attachment sites provide a variety of experiences and access to the private sector and community-outreach services occurs in some sites. Learning in the clinical setting is central to the rotation, additional learning being through Clinical Case Review Discussions (similar to PBLs) and interactive workshops.",
        "semesters": 0,
        "prerequisites": ""
    },
    "HLTH7200": {
        "course_name": "The Australian Healthcare System: Present & Future Challenges",
        "course_code": "HLTH7200",
        "duration": "One Semester",
        "units": 1,
        "faculty": "Medicine & Biomedical Sciences",
        "school": "Public Health School",
        "description": "In the coming decade, how the Australian Health System operates will be the major issue of Australian political and public debate. This course examines three fundamental questions: Why is it a major challenge to sustain the Australian health system? Why healthcare leaders will need to rethink workforce planning? What are some current solutions on offer? In this course, you will learn to understand and to discuss with confidence the most important features of the Australian healthcare system. This means not only being able to understand the structure and arrive at your own answers to the above questions, but also to analyse significant policies, players, debates, and ideas informing current health system planning. A key objective of this course is to use this knowledge to reflect on your own management style and workplace practices, to understand where your organisation fits in with `the systemÂ¿, and to learn to decipher important policy patterns and trends in public health practice. You will have a clearer understanding of the factors and influences shaping the future of the Australian Health System.",
        "semesters": 0,
        "prerequisites": ""
    },
    "CHEE7600": {
        "course_name": "Special Topics in Chemical Engineering",
        "course_code": "CHEE7600",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "Special topics in an area of chemical engineering. Course may be offered at relatively short notice by visiting or specialist lecturers.",
        "semesters": 1,
        "prerequisites": "Permission of Head of School"
    },
    "DENT2074": {
        "course_name": "Head & Neck Anatomy for Dentistry",
        "course_code": "DENT2074",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "This course provides an in depth knowledge of head & neck anatomy as it relates to general dental practice. Structures will be examined from a range of perspectives (gross, microscopic and imaging) to ensure a detailed, integrated and clinically relevant course.",
        "semesters": 2,
        "prerequisites": ""
    },
    "EDUC4004": {
        "course_name": "Leadership, Innovation and Research in HPE",
        "course_code": "EDUC4004",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Human Movement & Nutrition Sci",
        "description": "Four health & physical education curriculum problems will be addressed individually & in small groups. Course concludes with a student conference.",
        "semesters": 2,
        "prerequisites": "EDUC3008"
    },
    "ECON6010": {
        "course_name": "Microeconomics A",
        "course_code": "ECON6010",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "A course in advanced microeconomic theory. The focus is on consumer theory, the theory of the firm, general equilibrium and welfare.",
        "semesters": 1,
        "prerequisites": "ECON3010"
    },
    "ANIM2039": {
        "course_name": "Equine Breeding and Stud Management",
        "course_code": "ANIM2039",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "This course provides the underpinning science of reproduction in the horse and its application to the equine breeding industry. Anatomy, physiology, endocrinology and reproductive behaviour in the mare and stallion are discussed. Students gain extensive experience in reproductive management of the mare. Causes of reproductive wastage including infertility, embryonic and fetal loss and foaling difficulties and care of the neonate are covered. The theory and practice of ultrasonography are presented. Students gain experience in areas such as semen collection and evaluation. The principles or artificial insemination, embryo transfer and other assisted reproductive techniques are also covered. Facility design and stud farm management are also discussed.",
        "semesters": 2,
        "prerequisites": "ANIM1006"
    },
    "COMU3222": {
        "course_name": "Political Communication",
        "course_code": "COMU3222",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "Study how spin-doctors, politicians and the mass media work together to create public opinion.",
        "semesters": 1,
        "prerequisites": ""
    },
    "BIOM2222": {
        "course_name": "Advanced Techniques in Biomedical Science",
        "course_code": "BIOM2222",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Biomedical Sciences School",
        "description": "This course will give students 'hands-on' experience with advanced techniques in biomedical science. Students will gain competency in a broad range of biomedical techniques, an understanding of the theory behind the different types of experiments and an appreciation of experimental controls. They will also get practice in data analysis and scientific writing.",
        "semesters": 2,
        "prerequisites": "BIOL1040, BIOL1020, SCIE1200"
    },
    "TRFCR1016": null,
    "MRES7100": {
        "course_name": "Magnetic Resonance Imaging: Fundamentals",
        "course_code": "MRES7100",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "This unit of study explores the principles and methods that underpin Magnetic Resonance Imaging (MRI), a key molecular imaging technique. Topics covered include Physical principles of nuclear magnetic resonance (MR), underlying mechanisms of relaxation in MR and descriptions of the way in which pulse sequences are able to exploit relaxation to produce contrast. ",
        "semesters": 3,
        "prerequisites": "Admission to the Magnetic Resonance Technology, MR-PET, or Molecular Imaging suite of programs."
    },
    "NURS7112": {
        "course_name": "Introduction to Contemporary Nursing Practice and Health",
        "course_code": "NURS7112",
        "duration": "One Semester",
        "units": 1,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "In this course students will be introduced to contemporary nursing practice and the Australian health care system. Students will have the opportunity to examine the nature and breadth of nursing and the underpinning concepts of nursing theory and research. The basic principles of reflective practice and the legal and ethical issues inherent in nursing care will be explored. Students will also examine the concepts of collaborative and autonomous care of individuals of all ages, families, groups and communities, sick or well in the Australian health care setting.",
        "semesters": 1,
        "prerequisites": ""
    },
    "OHSS7615": {
        "course_name": "Ergonomics Thesis",
        "course_code": "OHSS7615",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "",
        "school": "Human Movement & Nutrition Sci",
        "description": "Individual research project in any area of ergonomics. Requires agreement from academic staff member to act as supervisor. Students taking over a full year year and enrolling in sem 1 enrol in OHSS7615, students taking course over full year and enrolling in sem 2 enrol in OHSS7616, students taking the course for one semester enrol in OHSS7617.\nThis course had the previous code of HMST7615 which can be viewed in the archived area within the Course and Program site http://www.uq.edu.au/study/archive/index.html",
        "semesters": 0,
        "prerequisites": ""
    },
    "PHTY7207": {
        "course_name": "Advanced Physiotherapy Practice in Geriatrics",
        "course_code": "PHTY7207",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Enables student to develop further expertise in a chosen area of gerontological clinical practice not covered by PHTY7205, PHTY7208 or PHTY7209..",
        "semesters": 0,
        "prerequisites": ""
    },
    "PHIL2220": {
        "course_name": "Kant & European Philosophy",
        "course_code": "PHIL2220",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "This course examines the philosophy of Kant & his influence on the development of European philosophy in the 19th & 20th centuries. Kant's philosophy is pivotal for the subsequent developments of Idealism, Marxism, Existentialism & Phenomenology, & analytic philosophy. The course will be of interest to all students who want to deepen their understanding of the origins of some of the central issues in modern philosophy.\nThis course may not run if there are fewer than 20 enrolments.",
        "semesters": 1,
        "prerequisites": ""
    },
    "MECH4552": {
        "course_name": "Major Design Project",
        "course_code": "MECH4552",
        "duration": "Two Semesters",
        "units": 4,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Mech & Mine Engineering School",
        "description": "Group design project based on a multidisciplinary topic sponsored by active players in industry (research, academic & commercial organisations). Requires completion of detailed design calculations to the sponsor's specifications.",
        "semesters": 1,
        "prerequisites": "#44 toward the BE in the relevant field."
    },
    "COMU7016": {
        "course_name": "Participatory Media Production",
        "course_code": "COMU7016",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Communication & Arts School",
        "description": "",
        "semesters": 2,
        "prerequisites": "Students enrolling in this course will have to have completed a minimum of #8 of study, with #4 from Part B of the Master of Communication course list. Students in the #32 program should have completed #4 from Part A."
    },
    "COMP7402": {
        "course_name": "Compilers and Interpreters",
        "course_code": "COMP7402",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "Compiler modules; programming language specifications; lexical analysis, parsing - recursive descent & table driven; static semantics - symbol tables & type checking; error handling; introduction to code generation & optimisation; compiler generators; interpreters.",
        "semesters": 1,
        "prerequisites": "COMP7505"
    },
    "ANIM2005": {
        "course_name": "Australian Terrestrial Vertebrates",
        "course_code": "ANIM2005",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Evolution, taxonomy, distribution, diet & habitat requirements of Australian native & introduced feral vertebrates. The impact that man & introduced species have had on distribution & abundance of native vertebrates.",
        "semesters": 0,
        "prerequisites": ""
    },
    "ECON7550": {
        "course_name": "Global Banking & Economic Institutions",
        "course_code": "ECON7550",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "NOT 2010. This course is writtent to provide a straight forward approach to the understanding international and global banking in a wider economic framework. It covers all the traditional course topics: credit analysis, electronic banking, the Eurobond market, debt crisis, international supervision, commercial banking and investment banking while also providing a solid grounding in the history of banking and its influences on modern practices.",
        "semesters": 0,
        "prerequisites": ""
    },
    "VETS1021": {
        "course_name": "Functional Anatomy of Locomotion and the Integument",
        "course_code": "VETS1021",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Veterinary Science School",
        "description": "Structure & functional anatomy & physiology of movement & locomotion in domestic animals. The gross & histological structure & function of the equine and bovine hoof.",
        "semesters": 2,
        "prerequisites": ""
    },
    "PHRM4031": {
        "course_name": "The Business of Health",
        "course_code": "PHRM4031",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Pharmacy School",
        "description": "This course combines business management with a consideration of the role of other health professions. Strategic, financial, inventory and human resource management are developed, encompassing aspects of community and hospital pharmacy. Students learn the essentials of strategic business planning and sustainable business. This course commences in week 5 of semester.",
        "semesters": 1,
        "prerequisites": ""
    },
    "LAWS7987": {
        "course_name": "International Law & Development",
        "course_code": "LAWS7987",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course will examine the role of international law in the growth and economic evolution of developing states. Issues of international investment, international trade and trade finance, the environment, and human rights will be considered.",
        "semesters": 2,
        "prerequisites": ""
    },
    "BIOL6505": {
        "course_name": "Honours Research Project",
        "course_code": "BIOL6505",
        "duration": "One Semester",
        "units": 16,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "The Bachelor of Science (Honours) program provides students with the opportunity to pursue an independent research project in the area of Plant Science under the supervision of an academic staff member. Students will acquire skills which will enable them to work without close supervision in a research environment in industry or government, or to proceed to a research higher degree.",
        "semesters": 0,
        "prerequisites": ""
    },
    "FINM6902": {
        "course_name": "Special Topics in Finance 2",
        "course_code": "FINM6902",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Business School",
        "description": "Special topics are offered by academic staff or distinguished visitors. Topics may vary each semester. Travel may be required off campus.",
        "semesters": 2,
        "prerequisites": "Permission from Head of School."
    },
    "MINE4125": {
        "course_name": "Coal Mine Design and Feasibility",
        "course_code": "MINE4125",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Mech & Mine Engineering School",
        "description": "Advanced level pre-feasibility study of a coal mine project inclusive of: reserve estimation, mining method selection, design, layout and optimisation, geotechnical design, ventilation, project risk, mine schedule, economics / finance and sustainability of surface and underground mines. Project-based learning.",
        "semesters": 2,
        "prerequisites": ""
    },
    "SCIE3040": {
        "course_name": "STEM Research",
        "course_code": "SCIE3040",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Science",
        "school": "Science Faculty",
        "description": "Students undertaking this course will have a unique opportunity to develop core research skills relevant to a wide spectrum of STEM topics, including written and oral communication, scientific observation, and recording and analysing data by participating in an individual or group research project associated with a discipline of interest to them.",
        "semesters": 1,
        "prerequisites": ""
    },
    "NURS7109": {
        "course_name": "Interprofessional Practice Project",
        "course_code": "NURS7109",
        "duration": "One Semester",
        "units": 4,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course provides students with the opportunity to explore the interprofessional aspects of nursing practice. Students will plan to undertake a project that is based in a clinical setting and involves interacting with health professionals/health professional students from a profession other than nursing with the aim of improving patient care/services.",
        "semesters": 0,
        "prerequisites": "NURS7105, NURS7106, NURS7107,NURS7108"
    },
    "ENVM4323": {
        "course_name": "Environmental Science Project",
        "course_code": "ENVM4323",
        "duration": "Two Semesters",
        "units": 14,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "In the BEnvSc Honours year you will chose and conduct an independent research project supervised by an academic staff member, and possible others including industry staff. This part of the BEnvSc program will extend your independence as a scientist and provide the skills that will enable you to actively design, perform, analyse and communicate original research. It will prepare you for entry into the workforce or a research higher degree (such as PhD) with a considerable degree of independence and advanced skills. The components of the Honours year include identifying project/advisors, developing a research proposal, presenting a proposal seminar, a research report featuring your findings, final seminar and seminar diaries.",
        "semesters": 3,
        "prerequisites": "Completion of Part A of BEnvSc and permission of program coordinator"
    },
    "HLTH7001": {
        "course_name": "Introduction to Digital Health",
        "course_code": "HLTH7001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Medicine",
        "school": "Medicine Faculty",
        "description": "This course introduces students to the utility of information and communication technologies (ICT) within modern healthcare practice. Students will learn about a range of digital technologies and applications in the areas of clinical practice, education and administration that are fast becoming commonplace. The course fosters awareness of digital health at national and international levels; it examines the characteristics of digital health innovation, strategic vision and deployment in various countries such as Australia, US, Canada, Europe and the developing world. While evaluating the technological advances relative to patient-centered care, students will also study the potential pitfalls of the use of technology in healthcare. The course draws attention to the associated social, ethical, legal issues and workflow issues that must be considered when integrating digital health into clinical practice.",
        "semesters": 3,
        "prerequisites": ""
    },
    "PHTY7602": {
        "course_name": "Motor Learning in Children with Motor Dysfunction",
        "course_code": "PHTY7602",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "Health & Rehab Sci School",
        "description": "Motor control in the physiotherapy management of children with motor dysfunction.",
        "semesters": 0,
        "prerequisites": ""
    },
    "BIOM6506": {
        "course_name": "Biomedical Research Background",
        "course_code": "BIOM6506",
        "duration": "One Semester",
        "units": 4,
        "faculty": "",
        "school": "",
        "description": "Students in the Bachelor of Biomedical Science Honours (Advanced Coursework) program will work under the mentorship of an academic staff member to review the literature in a chosen area of biomedical science. They will produce written documents comprising a critical review of the literature and a research grant proposal. They will also present seminars on the literature review and grant proposal. In addition, students will regularly attend seminars given by visiting research scientists. Through the course they will gain a breadth of understanding of biomedical science and research in this discipline.",
        "semesters": 0,
        "prerequisites": "Completion of Part A of the Bachelor of Biomedical Science (Honours) program."
    },
    "CHEM1221": {
        "course_name": "General, Organic & Biological Chemistry",
        "course_code": "CHEM1221",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences",
        "description": "This course builds on concepts that have been introduced in CHEM1090 (Introductory Chemistry) and Senior Chemistry. Students who have completed CHEM1100 (Chemistry 1) will be able to apply a number of concepts they have encountered in new contexts. Students will develop their knowledge and understanding across organic and physical chemistry necessary for advancement to second level biochemistry courses. Core topics include: Structure, reactivity and mechanisms of reaction for organic molecules that form the building blocks of biomolecules (including amino acids and saccharides), acid/base chemistry and intermolecular forces in a biological context. This course is recommended for students in the following programs: B Health Sciences, B Exercise & Nutrition Science, B Applied Science (nutrition & food technology majors); B Science (for majors other than chemistry, chemical sciences, biochemistry & molecular biosciences, biomedical science and physics). It does not provide sufficient background for all areas of CHEM2052.",
        "semesters": 2,
        "prerequisites": "Senior Chemistry or CHEM1090"
    },
    "MEDI7405": {
        "course_name": "Surgical Specialties",
        "course_code": "MEDI7405",
        "duration": "",
        "units": 3,
        "faculty": "Medicine",
        "school": "Medicine Faculty",
        "description": "The primary goal of this Surgery Specialties clinical placement is\nto allow the students to gain exposure to patients with common and serious Orthopaedic & Ophthalmologic Surgical problems; to learn how patients with these conditions present clinically, to develop history taking and physical examination skills in these particular patient populations, to learn the role of investigations for these patients and to develop an understanding of the treatment principles, both operative and non-operative, for patients with these conditions.",
        "semesters": 3,
        "prerequisites": "MEDI7212, MEDI7222, MEDI7232 and MEDI7242"
    },
    "STAT4404": {
        "course_name": "Advanced Probability & Stochastic Processes II",
        "course_code": "STAT4404",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "(offered in odd years only). State of the art in advanced probability and stochastic processes. The selection of topics will depend on the research interest of the lecturer.",
        "semesters": 0,
        "prerequisites": "STAT3004"
    },
    "PSYC3122": {
        "course_name": "Attitudes & Social Cognition",
        "course_code": "PSYC3122",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "This course explores the concept of attitudes, the relationship between attitudes and behaviour, and the processes of attitude change. In addition, central topics in the study of social cognition, including social categories and schemas, self-schemas, and affect and social cognition will be covered. The practicals involve the design and implementation of individual projects on attitude-behaviour relations. A focus of the course is to understand how our social environment changes our thoughts, feelings and actions without our conscious awareness.",
        "semesters": 0,
        "prerequisites": "PSYC2040"
    },
    "OCTY3207": {
        "course_name": "Occupational Therapy Clinical Practice II",
        "course_code": "OCTY3207",
        "duration": "One Semester",
        "units": 3,
        "faculty": "Health & Behavioural Sciences",
        "school": "Health & Rehab Sci School",
        "description": "This course is no longer offered.\n",
        "semesters": 0,
        "prerequisites": "OCTY3102, OCTY3103, HRSS3100"
    },
    "DIPAG1225": null,
    "BIOT3009": {
        "course_name": "Quality Management Systems in Biotechnology: GMP, GLP, GCP",
        "course_code": "BIOT3009",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Chemistry & Molec Biosciences, Medicine Faculty",
        "description": "This course will provide advanced teaching on Quality Management Systems (QMS) used within biotechnology, including GLP, GMP and GCP, as well as ISO17025 (General requirements for the competence of testing and calibration laboratories). Knowledge of these disciplines is essential for potential employees of the biotechnology sector. The course will be taught by persons who actively work within the sector and have helped pioneer the introduction of some of these standards in Australia.",
        "semesters": 1,
        "prerequisites": ""
    },
    "PUBH7102": {
        "course_name": "Vector-borne Diseases",
        "course_code": "PUBH7102",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "Vector-borne diseases in the human host, selected according to student need; biology, behaviour and life cycle of the vectors; transmission cycles and factors important in their epidemiology; methods of treatment, control and surveillance. Lectures, computer-based tutorials, practical classes, field trip.",
        "semesters": 0,
        "prerequisites": ""
    },
    "ENGY7102": {
        "course_name": "Principles of Carbon Capture & Storage",
        "course_code": "ENGY7102",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "(no longer offered)This course provides an overview of Carbon Capture and Storage as an option for carbon reduction for low carbon power generation in Australia and round the world. The course takes a system view of CCS within a framework of policy, economic and technical considerations. Three key carbon capture technologies Â¿ Integrated gasification combined cycle (IGCC), Oxy-firing, Post-combustion carbon capture (PCC) will be briefly discussed. The course will overview geological, terrestrial and biological Carbon Storage options, with a focus on industrial application. The issues related to carbon transport in long distance pipelines will be discussed and the inherent risks and opportunities involved in carbon capture and storage will be reviewed.",
        "semesters": 0,
        "prerequisites": ""
    },
    "EDUC7049": {
        "course_name": "Pedagogies for the Body",
        "course_code": "EDUC7049",
        "duration": "",
        "units": 0,
        "faculty": "",
        "school": "",
        "description": "",
        "semesters": 0,
        "prerequisites": ""
    },
    "NURS7002": {
        "course_name": "Advanced Clinical Practice I",
        "course_code": "NURS7002",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "This course will assist students develop advanced knowledge & skills related to assessment & management of people with ongoing complex & unpredictable illnesses. The impact of issues such as life span, ageing, culture & economics on patient management will be considered.",
        "semesters": 3,
        "prerequisites": "NURS7007"
    },
    "FRST3004": {
        "course_name": "Asia/Pacific Tropical Forest Management and Extension Tour",
        "course_code": "FRST3004",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Natural Resources, Agriculture & Veterinary Science",
        "school": "",
        "description": "Issues and challenges involved with forest management in the tropics through a field trip to a tropical country in the Asia-Pacific region. Forest management within a social, economic and environmental context. Country visited will be determined annually. (Minimum enrolment required 8)",
        "semesters": 0,
        "prerequisites": ""
    },
    "ENGG7000": {
        "course_name": "Systems Engineering",
        "course_code": "ENGG7000",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Info Tech & Elec Engineering",
        "description": "This course will not be offered after 2017. Systems engineering overview. System development life cycle; phases & reviews. Requirements analysis. Functional analysis. System architecture & design. Engineering management. Verification and validation. Systems engineering tools. Industry standards. Trends in systems engineering.",
        "semesters": 0,
        "prerequisites": "Admission in ME or MInfTechSt or MSc (Computer Science) suites"
    },
    "ERTH2004": {
        "course_name": "Structural Geology",
        "course_code": "ERTH2004",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Earth and Environment Sc Schl",
        "description": "Analysis of ductile & brittle deformation. Introduction to stress, strain & fracture theory. Geometry & dynamics of faulting, folding & related structures. Interpretation of geological maps & subsurface structures.",
        "semesters": 2,
        "prerequisites": "ERTH1000 or ERTH1501"
    },
    "PSYC7850": {
        "course_name": "Counselling Placement B",
        "course_code": "PSYC7850",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "Supervised practicum course to develop professional skills in applied psychology. Theories and techniques are applied in the specialist area within Counselling psychology. There is a possibility that students may be required to undertake site workshops prior to placements and these workshops may incur a fee which is payable to the placement provider.",
        "semesters": 7,
        "prerequisites": "Provisional or full registration as a Psychologist with the Psychology Board of Australia."
    },
    "MECH7900": {
        "course_name": "Special Topics in Mechanical Engineering",
        "course_code": "MECH7900",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Mech & Mine Engineering School",
        "description": "Special topics in an area of mechanical or space engineering. Course may be offered at relatively short notice by visiting or specialist lecturers. For information about how to enrol in this course, please email enquiries@mechmining.uq.edu.au.",
        "semesters": 0,
        "prerequisites": "Permission from Head of School"
    },
    "PHIL3612": {
        "course_name": "Advanced Topics in Metaphysics",
        "course_code": "PHIL3612",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Historical & Philosophical Inq",
        "description": "An examination of one or more debates in metaphysics. Topics may be drawn from one or more of the following debates: being, causation, substance, time, essentialism, identity, or the nature of ideas. Offered by classroom seminars.",
        "semesters": 2,
        "prerequisites": ""
    },
    "ARCS3001": {
        "course_name": "Advanced Research in Archaeology",
        "course_code": "ARCS3001",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Social Science School",
        "description": "This course provides higher-level archaeology students with intensive laboratory-based research into topical areas of the discipline. It is taught in seminar mode involving group and problem based learning, literature analysis, peer interaction and intensive laboratory skill development. This course is designed to provide advanced training in archaeological laboratory techniques and methods, theory and research design. It is beneficial for those students continuing to honours as the course provides an opportunity to explore lab-based projects of interest and receive feedback on problem design and research strategies. Depending on current staff research, students can be exposed to practical lab work in palaeobotany, faunal analysis, lithic technology and use, and experimental and historical archaeology. Archaeological collections that may be available for use include the regions of Australia, the Pacific Islands, Europe, the Near East and elsewhere.\n\nThis course is a prerequisite for Bachelor of Arts (Honours) in Archaeology, and Bachelor of Science (Honours) in Archaeological Science.",
        "semesters": 1,
        "prerequisites": "ARCA1000, ARCA1001 or ARCS1001, #8 electives from BA Archaeology major list, and a GPA of 5.0 or above for ARCA/ARCS courses"
    },
    "ECON7360": {
        "course_name": "Applied Econometrics for Microeconomics",
        "course_code": "ECON7360",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "The purpose of the course is to offer advanced students in Economics, Commerce and Business an understanding of the econometric tools that apply to microeconomic data. The approach is from an applied perspective. Lectures will introduce specific cross-sectional and panel models and the techniques required to estimate/predict with the model. The course will make use of the econometric package, Stata, for purposes of analysing of the data. Core content includes the analysis of individual-level data on the economic behaviour of individuals or firms using regression methods for cross section and panel data. Skills and Perspective provided by applications in the area of labour economics, consumer choice, health and education. \nAssumed Background: Students are expected to have an intermediate knowledge (second year undergraduate at least) of economic theory and econometrics or statistics and mathematics (see prerequisites).",
        "semesters": 2,
        "prerequisites": "(ECON7310+ECON7010 or 7110); or ECON2300+(ECON2010 or ECON2400)"
    },
    "AGRC1019": {
        "course_name": "Plant and Animal Biology",
        "course_code": "AGRC1019",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "The diversity of animals and plants and how they function in agricultural production systems and in nature from a knowledge of their anatomy, morphology, organ system function and ecology.",
        "semesters": 0,
        "prerequisites": ""
    },
    "EDUC7014": {
        "course_name": "Creating classrooms of the future with digital technologies across learning ar",
        "course_code": "EDUC7014",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Education School",
        "description": "This course explores the barriers and enablers around integrating educational technologies into classroom practices both now and into the future. It offers you an opportunity to engage with contemporary research, theories, technologies and practice-based models in order to develop and refine your own pedagogical vision and approaches to technology-enhanced teaching and learning practices.\n\nThis course may not be offered internally if the enrolment is less than 10 students.",
        "semesters": 2,
        "prerequisites": ""
    },
    "PSYC3132": {
        "course_name": "Health Psychology",
        "course_code": "PSYC3132",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Psychology School",
        "description": "The mind and the body are intricately linked. In this course we will explore the links between mental processes and behaviours as related to health and illness. Topics include theories of healthy behaviour, health enhancing behaviour (eg exercise), health risk behaviour (eg smoking), and rehabilitation. This course will challenge you to critically evaluate the role that cognition, society and the environment play in the health of individuals.",
        "semesters": 1,
        "prerequisites": ""
    },
    "NURS6004": {
        "course_name": "Thesis (part-time study)",
        "course_code": "NURS6004",
        "duration": "Two Semesters",
        "units": 8,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "Implementation of a research proposal by conducting a research investigation & presenting the completed research findings in an academic thesis. A thesis can be completed in traditional format or by publication.\n\nStudents undertaking the thesis on a full-time basis in one semester should enrol in NURS6003.",
        "semesters": 1,
        "prerequisites": ""
    },
    "SWSP7362": {
        "course_name": "Research Project",
        "course_code": "SWSP7362",
        "duration": "One Semester",
        "units": 6,
        "faculty": "Health & Behavioural Sciences",
        "school": "Nursing, Midwifery & Social Wk",
        "description": "Students undertake an Independent research project approved by the Program Director leading to the preparation of a major report detailing the research process and findings. \n\nStudents commencing in semester 1 or 2 and completing in a single semester enrol in SWSP7362 (full time). Students commencing in semester 1 and completing in semester 2 enrol in SWSP7360 (part time), whereas those commencing in semester 2 and completing in semester 1 of the following year enrol in SWSP7361 (part time). Students completing the research report in a part time capacity must ensure that they enrol in the course code for both semesters.\n\nStudents must contact the School of Nursing, Midwifery and Social Work at least 6 weeks prior to the commencement of semester to seek permission to enrol in this course.\nThis involves the completion of an application involving a 600 word research proposal, two supervisor nominations, identification of ethical clearance (if required) and an acadmic progression check. Please contact the school for further information.",
        "semesters": 0,
        "prerequisites": "Departmental consent required, please contact Postgraduate Coursework Program Director"
    },
    "DENT4021": {
        "course_name": "Research Informed Practice II",
        "course_code": "DENT4021",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Health & Behavioural Sciences",
        "school": "Dentistry School",
        "description": "This course provides students with a foundation for and experience in preparing a research proposal in their self-selected area of interest, with the support of an appointed supervisor(s), with a focus on evidence-based practice. The competency building activities of this course provide students with experiential learning through the development and preparation of a proposal for their chosen research project and workshops.",
        "semesters": 2,
        "prerequisites": "DENT3021"
    },
    "MATH3405": {
        "course_name": "Differential Geometry",
        "course_code": "MATH3405",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Mathematics & Physics School",
        "description": "",
        "semesters": 2,
        "prerequisites": "MATH2000 or MATH2001"
    },
    "ENVM3522": {
        "course_name": "Research, Development and Extension Methodologies",
        "course_code": "ENVM3522",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Science",
        "school": "Agriculture Food Sciences Schl",
        "description": "Examines the broad philosophies, paradigms and methodologies encompassing the whole process of research, development and extension in natural and agrifood systems and rural communities. Provides examples of the field application of various methodologies and challenges students to develop their own research proposals.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MGTS1968D": {
        "course_name": "Enterprise Compliance Systems",
        "course_code": "MGTS1968D",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Gatton Vocational Ed Centre",
        "school": "Gatton Vocational Ed Centre",
        "description": "Enterprise policy, procedures, processes and practice requirements in relation to compliance with occupational health and safety, food safety and quality assurance, and best management practices.",
        "semesters": 3,
        "prerequisites": "Must be enrolled in QLD Dip of Ag Technologies"
    },
    "CHIN7666": {
        "course_name": "Translation and Interpreting for Science, Engineering and Technology",
        "course_code": "CHIN7666",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "This course introduces students to translation and interpreting between English and Chinese for science, engineering and technology. It includes translation and interpreting skills, contextual knowledge, and research skills involved in doing T&I for SET. It also covers readings and case studies of T&I in SET.",
        "semesters": 2,
        "prerequisites": ""
    },
    "LAWS5169": {
        "course_name": "Legal History",
        "course_code": "LAWS5169",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Law School",
        "description": "This course is a comparative investigation into the history of the law of obligations in Australia and England. This course seeks to develop studentsÂ¿ awareness of the historical underpinnings of the modern law of obligations.",
        "semesters": 0,
        "prerequisites": "All Level 1 LAWS courses + LAWS2111 + LAWS2112"
    },
    "ENGY7104": {
        "course_name": "Risk Assessment for Energy Studies",
        "course_code": "ENGY7104",
        "duration": "One Semester",
        "units": 2,
        "faculty": "",
        "school": "",
        "description": "(no longer offered)This course provides the tools and methodologies necessary to allow students to undertake a full risk management analysis, assessment and evaluation of a Carbon Capture, Storage or Management project and allow evaluation of different scenarios to mitigate, minimise and manage all identified risks. The course aligns with present day standards in risk management and uses case studies to underline the key principles involved. The course aims to introduce the principles of project management and how this is applied to carbon management. Students will gain an understanding of the core functions of project management, including cost, time, quality, risk, scope, communications, human resources procurement and project life cycle integration in line with the Australian Competency Standards for Project Management. Students will work on a practical group project based on their chosen specialization topic.",
        "semesters": 0,
        "prerequisites": ""
    },
    "MINE7061": {
        "course_name": "Sustainable Development in the Resources Sector - Tools and Integration",
        "course_code": "MINE7061",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Mech & Mine Engineering School",
        "description": "This course provides students with the skills to apply SD tools in the resource sector and examines the connectivity and pathways that these tools provide across the range of disciplines and their integration into, and practical use, when applied to the resources sector and research projects.",
        "semesters": 1,
        "prerequisites": "MINE7053"
    },
    "LTCS2021": {
        "course_name": "Reading Russia: Literature, State & Society",
        "course_code": "LTCS2021",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Languages & Cultures School",
        "description": "Landmarks of Russian literature in translation; the making of the Russian reading public & its role in the development of Russian society & culture.\nNote: Course offering may be cancelled unless a minimum of 20 students enrol.",
        "semesters": 0,
        "prerequisites": "#4 Arts courses"
    },
    "CIVL4280": {
        "course_name": "Advanced Rock Mechanics",
        "course_code": "CIVL4280",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Civil Engineering School",
        "description": "Applications of rock mechanics; investigation of rock masses; in situ and laboratory testing of rocks, their applications and limitations, and their interpretation; rock mass classification systems; rock parameter assessment; rock support and excavation lining systems; and analytical and numerical analyses of rock masses, including example applications to rock slopes, underground excavations in rock, and rock support and excavation lining systems.",
        "semesters": 2,
        "prerequisites": "MINE3121"
    },
    "ECON6390": {
        "course_name": "Financial Econometrics",
        "course_code": "ECON6390",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Business, Economics & Law",
        "school": "Economics School",
        "description": "This course aims at giving an introduction to various aspects of financial econometrics. Characteristics of financial data will be studied and several major econometric models used in finance will be surveyed. Students will learn how to concretely treat and analyse financial data, will be introduced to some of the major tools used in both in the literature and by practitioners.",
        "semesters": 2,
        "prerequisites": "ECON3350"
    },
    "WATR7900": {
        "course_name": "Collaborative Planning",
        "course_code": "WATR7900",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Chemical Engineering School",
        "description": "Collaborative water planning introduces students to participatory methods and evaluation frameworks relevant to water management and planning. This module extends knowledge of social science concepts and the application of social theories to real life scenarios. Planners agree that community input and participation should influence the development of a water resource plan or strategy and find that they need professional development in this area. Skills in fostering collaboration between organisations are also needed. \nTo foster a greater understanding of the role of collaborative approaches, this course will focus on when, and how these approaches are useful.",
        "semesters": 2,
        "prerequisites": "Permission of Head of School."
    },
    "ABTS3020": {
        "course_name": "Working with Indigenous People",
        "course_code": "ABTS3020",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Humanities and Social Sciences",
        "school": "Humanities and Social Sciences",
        "description": "Critical examination of conceptual and practical issues arising in research on and with Indigenous people with a focus on the Australian context.",
        "semesters": 2,
        "prerequisites": ""
    },
    "BLDG2120": {
        "course_name": "Building Science: Performance and Sustainability",
        "course_code": "BLDG2120",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Engineering, Architecture & Information Technology",
        "school": "Architecture School",
        "description": "This course provides an introduction to the principles of architectural science (heat, light and sound), materials science (embodied energy and energy transfer), building services (power, sewer and water) and passive design for sustainable building. Students examine the principles of energy, air, water and climate in activities and assignments that also develop skills in the design of environmentally sustainable small to medium scale buildings.",
        "semesters": 1,
        "prerequisites": "Year 1 of Bachelor of the Architectural Design or equivalent"
    },
    "AGRC1120D": {
        "course_name": "Agriculture & Biology",
        "course_code": "AGRC1120D",
        "duration": "One Semester",
        "units": 2,
        "faculty": "Gatton Vocational Ed Centre",
        "school": "Gatton Vocational Ed Centre",
        "description": "",
        "semesters": 1,
        "prerequisites": "Only available to students enrolled in the Academic Program in Agricultural Technologies."
    }
}