{
    "course_code": "EDUC7605",
    "course_name": "Building Professional Knowledge",
    "faculty": "Humanities and Social Sciences",
    "school": "Education School, Human Movement & Nutrition Sci",
    "units": "2",
    "duration": "One Semester",
    "description": "This course provides an introduction to school life through workshops and 10 day (5 single days and a 5 day block) of professional experience. Teaching is a multi-faceted profession and schools are complex environments that are driven and influenced by numerous stakeholders in the educative process. Being school ready is an important first step in the journey to becoming a graduate teacher. The course is designed to generate knowledge and understanding of the school environment, allow preservice teachers to investigate and analyse the duties and responsibilities of being a teacher, including supporting student health and wellbeing, and provides the opportunity to understand the importance of communication within a school context. A four week module within the course will focus specifically on building preservice teachersÂ¿ health knowledge, and engages with such topics as child protection, community partnerships in health, studentsÂ¿ mental health and wellbeing, and maintaining teachersÂ¿ own health and wellbeing. There will also be a focus on the development of critical skills for both the observation and planning of lessons, and segments of lessons. Students will be required to critically reflect on their personal teaching philosophy after their first professional experience. This course is developmental and links to EDUC7615 and EDUC7625, providing a basis for these subsequent courses by demonstrating the importance of creativity and initiative in teaching. The course will also build on and apply knowledge developed across the first year of the Master of Teaching (Secondary) program. As this course contains a professional experience component in a school it is permission listed so that academic, preservice teacher risk assessment Blue Card status checks can be completed prior to enrolment.",
    "prerequisites": "Successful completion of 8 units MTeach(Sec) courses including EDUC7602. Students are required to hold a current Blue Card authorised by the School of Education. Forms must be completed at the Front Office in the School of Education.",
    "incompatible": "",
    "restricted": "Restricted to MTeach (Sec) students."
}