{
    "course_code": "EDUC2009",
    "course_name": "Health Education in Schools",
    "faculty": "Health & Behavioural Sciences",
    "school": "Human Movement & Nutrition Sci",
    "units": "2",
    "duration": "One Semester",
    "description": "This course introduces you to the teaching and learning, curriculum and policies of school based programs of health education, including Australian and Queensland programs of HPE for Years Prep - 10 and the Queensland Studies Authority Senior Health Education course. A central organising feature of this course is the World Health Organisation's Health Promoting Schools framework which facilitates a focus on the development of knowledge, skills and attitudes in relation to implementation of health related across the three domains of: teaching and learning, school ethos and policy, and community partnerships within school settings. Across the course you will engage with learning experiences, workshops and authentic scenarios that will build your knowledge, skills and capacity to conduct health education and promotion work across these three domains.\n\nThe course will focus on the key philosophies, propositions and approaches of the Queensland and Australian Health Education syllabus documents. You will explore the biophysical, behavioural, social and salutogenic models of health and develop a critical lens that will help you understand how health is socially constructed and how individuals and communities can contribute to the health and wellbeing of themselves and others. You will confront some of the key issues within health education and develop strategies to deal with what are frequently sensitive and controversial areas. Health education content material provides the context within which a range of pedagogical practices and strategies will be explored, particularly inquiry based approaches to teaching and learning. The development of teaching units, lessons and assessment tasks within the flexibility and constraints of syllabus documents will comprise the focus of course assessment and learning experiences.",
    "prerequisites": "",
    "incompatible": "EDUC3009",
    "restricted": ""
}