{
    "course_code": "INDH7107",
    "course_name": "Working with Aboriginal and Torres Strait Islander People",
    "faculty": "Health & Behavioural Sciences",
    "school": "Nursing, Midwifery & Social Wk",
    "units": "2",
    "duration": "One Semester",
    "description": "This course engages with some of the main conceptual and practical issues that arise in working with Aboriginal and Torres Strait Islander communities, institutions and people.\n\nThe course also aims to develop practice skills, particularly in the important areas of cross-cultural understanding and communication. Some consideration is therefore given to the organisational contexts of practice, and how Aboriginal and Torres Strait Islander people are impacted by differing organisational and policy agendas. It examines a range of policy and social challenges in Aboriginal and Torres Strait Islander Australia, and discusses the implications of these for those working for and with Aboriginal and/or Torres Strait Islander communities.\n\nThe course affords students with an opportunity to reflect on their own cultural practice and on major theoretical and practical questions about cross-cultural workplaces raised by Aboriginal and Torres Strait Islander and non-Indigenous commentators. It provides the opportunity for students to develop respectful person-centred health care and social work practice, recognising and understanding the feelings and experiences of Aboriginal and Torres Strait Islander peoples and communities. Students will also recognise the important role of relationships with Aboriginal and Torres Strait Islander health professionals, organisations and communities, and develop skills to build effective partnerships.\n\nThis course is being delivered in the third cultural space where non-Indigenous and Indigenous tutors deliver course content together role modelling communication strategies and ways of interprofessional working.",
    "prerequisites": "",
    "incompatible": "HSER7046",
    "restricted": ""
}