{
    "course_code": "MGTS7995",
    "course_name": "Private Sector Innovation and Sustainable Development",
    "faculty": "Humanities and Social Sciences",
    "school": "Humanities and Social Sciences",
    "units": "2",
    "duration": "One Semester",
    "description": "To meet the UN's ambitious Sustainable Develop Goals by 2030, we need to increase the role of the private sector in global development, to unlock additional investment and to reach real scale. Neither the market nor aid can solve global poverty and environmental problems; we need enterprise-led innovations that lead to positive change, and new collaborations that cross public, private and civil society divides. The private sector has long contributed to international development, through employment, contracting, foreign direct investment, and contributing to government revenues. Increasingly, the private sector is being encouraged to move beyond these conventional contributions and more actively contribute through innovative inclusive business models, including social entrepreneurship, `human-centred design', and blended-financing arrangements. More companies are now building and rebuilding their business models and brand around social good, which sets them apart from the competition and augments their success. These companies are searching for commercial and development synergies through 'shared value'. They are increasingly confident that profitable business can also sustainably alleviate social problems. Improving the private sector's development contribution involves understanding how and where core business, supply chain and business relationships have a development impact. We must also understand private sector's adverse impacts, so that businesses 'do no harm'. This course will prepare students to explore the potential of the private sector in different development 'contexts'; opportunities and barriers for enhancing the private sector's role in eradicating poverty; and innovative collaborations across the public, private and not-for-profit sectors. Students may be working within private sector organisations or within government or non-government agencies that are partnering with the private sector to harness positive development impact.",
    "prerequisites": "Enrolment in the MLGD. For students in other programs, admission is by permission of the Course Coordinator Â¿ students must be enrolled in a Masters level program, with at least 4 years of work experience.",
    "incompatible": "",
    "restricted": ""
}