{
    "course_code": "MIDW2010",
    "course_name": "Clinical Midwifery Practice A",
    "faculty": "Health & Behavioural Sciences",
    "school": "Nursing, Midwifery & Social Wk",
    "units": "2",
    "duration": "One Semester",
    "description": "MIDW2010 is the alternative clinical practice course (replacing MIDW2004) for BN students who have completed the first year of the Bachelor of Nursing and are making the transition to the Bachelor of Nursing/Bachelor of Midwifery Dual Degree, or Bachelor of Midwifery, and for Bachelor of Nursing graduates entering the Bachelor of Midwifery. MIDW2010 consists of 2 days per week clinical experience of workshops for 12 weeks, as well as clinical laboratories for 2 hours each week. MIDW2010 provides foundation clinical skills and experiences in the Bachelor of Midwifery and dual degree program. This course runs concurrently and is integrated with the theoretical courses MIDW2009, MIDW2002 and MIDW2005. Throughout the semester, clinical learning experiences are planned to integrate with the theoretical concepts covered in the practice problems. Students are rostered to at least 15 days of morning, afternoon, evening or night shifts in a clinical practice site. In alignment with the associated courses in the semester, students have planned clinical sessions in the laboratories in their base hospital with their Clinical Lecturer each week. In these sessions, they learn specific skills that relate to their practice problems and which they may then implement under supervision in their clinical placement. Students are assessed for competence within the clinical placement and maintain a portfolio of evidence in the acquisition of skill based competencies. Starting in this semester, students will be required to complete 20 Continuity of Care experiences during the 3 years of their program and record their participation in these experiences in the electronic portfolio.",
    "prerequisites": "NURS1005, NURS1006, NURS1007 and NURS1008",
    "incompatible": "MIDW2004",
    "restricted": "BMid or BN/BMid"
}