{
    "course_code": "POLS7223",
    "course_name": "Research Project",
    "faculty": "Humanities and Social Sciences",
    "school": "Politic Sc & Internat Studies",
    "units": "6",
    "duration": "Two Semesters",
    "description": "This is a restricted entry course and requires prior approval from the School. Prospective students must themselves identify and approach a potential supervisor and discuss their proposed research question; supervisors are not assigned by the School. \nStudent eligibility fill be examined in the following areas:\nGrade point average (GPA) - successful applicants would be expected to have achieved a program GPA of 5.5 or better in their Masters program \nProgression through degree - successful applicants would be expected to be in the final semester of their studies (or have completed at least #16 units in the program) \nViability of project - the project outline will be reviewed to determine its quality, viability and feasibility. \nAvailability of supervisor - research projects must be of direct interest to an academic staff member within the school, who in turn must have the workload capacity to supervise a student.\nStudents work by themselves, under the individual supervision of a member of the academic staff of the School of Political Science and International Studies. The research report allows students of exceptional ability to engage in a substantial research project. Students are required to not only be self-motivated and self-disciplined, but also to determine and develop their own project in consultation with their supervisor. The semester then involves independent reading and research, regular contact between student and supervisor, and the preparation of a 10,000 to 12,000-word report.\nFull time students wishing to complete the research report in one semester should apply to undertake POLS7220. Part time students wishing to complete the research report over two semesters should apply to undertake POLS7223 for semester 1 commencement or POLS7224 for semester 2 commencement.",
    "prerequisites": "",
    "incompatible": "GT858, GO859, GO860, POLS7220, POLS7221, POLS7224",
    "restricted": ""
}