{
    "course_code": "SWSP7287",
    "course_name": "Theoretical Foundations of Family Therapy Practice",
    "faculty": "",
    "school": "",
    "units": "2",
    "duration": "One Semester",
    "description": "NOT OFFERED IN 2011.\nThis course is concerned with theoretical, ethical and philosophical assumptions that underpin the way that family therapists approach their work. Family therapy's theoretical base is rich, diverse and constantly evolving. Practitioners of family therapy have traditionally had an interest in theoretical and philosophical ideas underpinning their practice. The family therapy literature is replete with theoretical contributions that have accrued over the past six decades and that bring to the field insights from psychoanalysis, cybernetics and systems thinking, postmodernism, and feminism. This subject will introduce students to the key contributions of each of these theories. \nStudents will come to understand the relationships between these theories, their relevance to everyday practice and their respective contributions to the resolution of ethical dilemmas. Students will develop a deeper understanding of the relationships between the various `schoolsÂ¿ of family therapy and what sets them apart from each other.\nThe course will help each student to make informed personal decisions about which theories are most relevant to their own work. \nAgain, theoretical material is tied to the level of everyday practice throughout the workshops. This is achieved through the provision and analysis of case examples and through practical demonstration of how theory and philosophy translates into therapeutic skills and `techniqueÂ¿.\nCourse will only be offered if enrolments exceed 15 students.\n\nThis course will not be offered in 2010. It is unlikely to be offered in future semesters. Please contact the School of Social Work and Human Services if you require further advice.",
    "prerequisites": "To enrol in this course, students must have completed an interpersonal skills training course. Please contact the School of Social Work and Human Services for further information.",
    "incompatible": "",
    "restricted": ""
}