{
    "course_code": "TIMS7302",
    "course_name": "The Business of Complex Projects",
    "faculty": "",
    "school": "",
    "units": "2",
    "duration": "One Semester",
    "description": "This course focuses on the business of complex projects. It is not a traditional course about the art and science of project management. Rather, we focus on understanding the unique managerial and strategic challenges associated with leading project-based organisations. These are an increasingly important type of organisation. Projects account for over 20% of global economic activity and project-based organisations are at the heart of this phenomenon. These are a species of organisation for which survival and prosperity rest on the continuous execution of complex projects. Industries where these organisations are prevalent range from architecture and design (e.g. Arup), construction (e.g. Laing O'Rouke), and mining (e.g. Thiess), through to consulting (e.g. E&Y), video games (e.g. Valve) and feature films (e.g. Fox). The nature of work within these organisations differs significantly to those not organised around projects (Davies and Hobday, 2005). For example, the organisation's core capabilities are embedded in project teams that are often located in the field (\"off-site\"), have limited contact with each other or head quarters, and have to work in project delivery teams with people from complementary organisations. The management of project-based organisations has, as a result, often required a different focus to that seen in the traditional business firm. This is particularly the case when one looks at how best to create and execute strategy, develop and grow capabilities, govern the organisation, and generate innovation. This course will draw strongly on my own research and experience to take you inside this world, help you understand it, and provide you with new analytical tools that will help you understand, operate within, and manage project-based organisations.",
    "prerequisites": "",
    "incompatible": "",
    "restricted": "Quota: Minimum of 15 enrolments"
}